{"3D biscuits ": {"ingredients": ["200g/7oz unsalted soft butter", "200g/7oz caster sugar", "1 tsp vanilla essence", "1 free-range egg, lightly beaten", "400g/14oz plain flour, plus extra for dusting", "1 free-range egg white", "250g/9oz icing sugar", "food colouring, if using", "ready-to-roll icing, in colours of your choice, to decorate the biscuits"], "instructions": ["To make the basic dough, line a baking tray with baking parchment (you may need two baking trays or, alternatively, cook the biscuits in batches).", "In a bowl, use a wooden spoon or a mixer to cream together the butter, sugar and vanilla essence until just creamy.  Do not over work the batter at this stage.  Beat in the egg until well combined. ", "Add the flour and mix on a low speed until a dough forms. In the bowl, use your hands to lightly knead the dough into a ball. Wrap it in cling film and refrigerate for least an hour.", "Roll out the dough on a lightly floured work surface to a depth of about 5mm, if possible use spacers to achieve an even thickness. Cut the desired shapes. For the duck biscuits: use a duck-shaped cutter and a round cutter for the base (the base should be approximately the same size as the duck). For the tree biscuits: cut two simple tree shapes out using either a cutter or a template and cut one tree shape in half vertically. For the ladybird biscuits: cut out two rounds, one slightly smaller than the other (approx. 5cm/2in and 3cm/1¼in). For the lamb biscuits: use a cutter or a template to cut out two lamb shapes for each finished biscuit and cut two additional leg shapes separately (for each finished lamb biscuit you should have two lamb shapes and two leg shapes). For the sitting down person biscuits: cut a gingerbread person out of the dough and then cut off the legs. Trim about 2mm from around the edges of the legs and cut two slots out of the bottom of the gingerbread body, about the depth of the legs (the legs will slot in here once baked). Also cut out two small ovals for feet.  ", "Transfer the shapes onto the baking sheet using a palate knife and chill again for about 30 minutes. (This is important to prevent the biscuits losing their shape when baked.)", "Preheat the oven to 180C/350F/Gas 4.", "Bake the biscuits for 6–10 minutes, depending on size, until lightly golden-brown at the edges. Transfer to a wire rack to cool completely.", "For the icing, lightly beat the egg white in a large bowl.  Add the icing sugar and mix slowly at first to avoid an icing sugar cloud. Once combined, whisk or beat for about five minutes if using an electric beater or whisk, or for longer if using a wooden spoon. Continue whisking until the ingredients form a thick, smooth paste that is bright white in colour. If you are using colours, separate the icing into various bowls and colour accordingly.\r\n", "To decorate the duck biscuits, thinly roll out the yellow ready-to-roll icing and cover the duck shapes. Pipe on any decoration desired for the eyes, beaks and wings. Position a wire rack over a container that will hold it at a suitable height to lean the stand up biscuit against. Use the flooding technique to ice the biscuit circles (see step 10 for more information) to represent a pond. While the icing is still wet, place the round biscuit under the edge of the wire rack. Stand the duck biscuit in position on the wet icing on the round, using the rack as support to keep it upright. Allow the icing to set completely before carefully removing the support rack.\r\n", "To flood ice the biscuits, pipe an outline around the edge of the biscuit using either a fine nozzle or by snipping the very end off a disposable piping bag. Let the icing set for a few minutes. For flooding the icing needs to be slightly runnier, so add a few drops of water. Pipe or spoon enough of the runnier icing into the centre of the iced shape to completely fill it – don’t worry about it being neat at this point. Use a toothpick to spread the icing evenly inside the hard icing ‘wall’. If the surface of the icing isn’t flat, gently shake the biscuit back and forth until you have a smooth covering.", "To decorate the tree biscuits, pipe a line of green icing all around the edge and cover the biscuits using the flooding method described in step 10. Once the icing is completely dry, use some leftover icing to pipe a zig zag along the bare edge of each half tree and attach them to the middle of the whole trees  Repeat at the back of the biscuit with the remaining tree halves. You may have to hold the half trees in place while the icing sets.", "To decorate the ladybird biscuits, brush the rounds with cooled boiled water and cover the larger round with a circle of pink or red ready-to-roll icing and the smaller in white ready-to-roll icing. Attach the white round to the base using a small ball of ready-to-roll icing and tilt on an angle. Finish decorating the ladybird by piping on a face and spots in black icing.", "To decorate the lamb biscuits, ice half the bodies of the lambs using the flooding technique in step 10 - keeping the legs free of icing. Once the icing is dry, spread an undecorated lamb biscuit with icing and sandwich to the back of the decorated biscuit. Dot some icing on the back of the individual lamb legs and stick over the whole lamb’s legs to give a 3D effect. When the icing is dry the biscuits should stand up without support. If desired, decorate the lamb’s legs with icing.\r\n \r\n", "To decorate the sitting down person biscuits, decorate the biscuit bodies as desired. Slot the legs sideways into the precut slots so the person is sitting down with their legs stretched out in front of them.  Attach the feet to the bottom of the legs using icing and leave to dry.  "]}, "3 salad dressings": {"ingredients": ["2 tbsp red or white wine vinegar", "1 tsp mustard, ideally Dijon or French", "½ garlic clove, crushed", "1½ tsp caster sugar", "8 tbsp extra virgin olive oil, or a mix of olive oil and sunflower oil", "salt and freshly ground black pepper", "2 tbsp white wine vinegar or cider vinegar", "1 tbsp wholegrain mustard", "1 tbsp runny honey", "6 tbsp sunflower or vegetable oil", "salt and freshly ground black pepper", "6 tbsp mayonnaise (around 75g/2¾oz)", "2 tbsp tomato ketchup", "1 tsp lemon juice", "splash Worcestershire sauce", "pinch cayenne pepper"], "instructions": ["To make the vinaigrette, put the vinegar, mustard, garlic, sugar, a pinch of salt and some pepper into a bowl. Whisk until well combined. Gradually whisk in the oil, 2–3 teaspoons at a time, until it is all incorporated and the dressing is thick and glossy. ", "To make the honey and mustard dressing, put the vinegar, mustard, honey, a pinch of salt and some pepper into a bowl. Whisk until well combined. Gradually whisk in the oil, 2–3 teaspoons at a time, until it is all incorporated and the dressing is thick and glossy. ", "To make the marie-rose dressing, put all the ingredients in a bowl and stir until thoroughly combined."]}, "3 stir-fry sauces": {"ingredients": ["2 tbsp dark soy sauce or tamari", "2 tsp runny honey", "2 tsp cornflour", "2 tbsp tomato ketchup", "2 tsp runny honey", "1 tsp vinegar", "3 tbsp peanut butter", "2 tbsp sweet chilli dipping sauce", "1 tbsp dark soy sauce or tamari"], "instructions": ["To make the cheat’s teriyaki sauce, mix together the soy sauce and honey in a small bowl. Use as a dip or in a stir-fry. ", "To make the easy sweet and sour sauce, mix the cornflour with 2 tablespoons of water in a small bowl. Add the ketchup, honey and vinegar and mix well. Use as a dip or in a stir-fry. ", "To make the quick satay sauce, put all the ingredients in a small saucepan with 100ml/3½fl oz of water and warm over a low heat for 30 seconds. Use as a dip or in a stir-fry. "]}, "30-Minute Shakshuka with Yogurt": {"ingredients": ["1 teaspoon coriander seeds", "1 teaspoon cumin seeds", "6 garlic cloves, divided", "2 medium shallots, divided", "1 12-ounce jar roasted red peppers", "¼ cup extra-virgin olive oil, plus more for drizzling", "Kosher salt", "Freshly ground black pepper", "1 28-ounce can whole peeled tomatoes", "4 large eggs", "½ cup plain Greek yogurt", "Mint leaves and crusty bread (for serving)"], "instructions": ["Place 1 tsp. coriander seeds and 1 tsp. cumin seeds in little piles on a cutting board. Using the bottom of a medium skillet, crush seeds, pressing down firmly with even pressure. You’ll have to do this several times, repositioning skillet to break apart any whole seeds that remain. Transfer seeds to a small heatproof bowl.", "Slice 2 garlic cloves as thinly and evenly as you can; add to bowl with seeds. Finely chop remaining 4 garlic cloves.", "Cut half of 1 shallot into thin rounds and add to same bowl with seeds and garlic. Chop remaining shallots.", "Open jar of red peppers and pour off any liquid. Remove peppers and coarsely chop.", "Combine ¼ cup oil and seed/garlic/shallot mixture in skillet you used for crushing seeds. Heat over medium and cook, stirring constantly with a wooden spoon, until seeds are sizzling and fragrant and garlic and shallots are crisp and golden, about 3 minutes.", "Place a strainer over same heatproof bowl and pour in contents of skillet, making sure to scrape in seeds and other solids. Do this quickly before garlic or shallots start to burn. Reserve oil.", "Spread out seed mixture across paper towels to cool. Season with salt and pepper.", "Return strained oil to skillet and heat over medium. Add remaining chopped garlic and shallot and cook, stirring often, until shallot is translucent and starting to turn brown around the edges, about 5 minutes. Season with salt and lots of pepper.", "Add chopped peppers to skillet and stir to incorporate. Using your hands, lift whole peeled tomatoes out of can, leaving behind tomato liquid, and crush up with your hands as you add to skillet (beware squirting tomato juices). Discard leftover liquid. Season with more salt and pepper.", "Cook shakshuka, stirring often, until thickened and no longer runs together when a spoon is dragged through, 10–12 minutes.", "Reduce heat to low. Using the back of wooden spoon, create four 2\"-wide divots in tomato sauce. Working one at a time, carefully crack an egg into each divot.", "Cover skillet and cook, simmering very gently and reducing heat if necessary, until whites of eggs are set while yolks are still jammy, 7–10 minutes. Uncover skillet and remove from heat. Season tops of eggs with salt and pepper.", "Top shakshuka with dollops of yogurt, sprinkle with seed mixture, then drizzle with more olive oil. Finish by scattering mint leaves over top.", "Serve shakshuka with crusty bread alongside."]}}