{"5-minute chicken noodle soup ": {"ingredients": ["1 chicken stock cube", "50g/1¾oz dried egg noodles (around 1 nest)", "2 spring onions, thinly sliced", "50g/1¾oz frozen peas ", "50g/1¾oz shredded cooked chicken ", "½ red chilli, thinly sliced", "¼in/1cm piece fresh root ginger, peeled and thinly sliced", "½ garlic clove, thinly sliced", "few fresh coriander leaves", "dash soy sauce"], "instructions": ["Pour 700ml/1¼ pint freshly boiled water into a saucepan, add the stock cube and stir well to dissolve. Add the noodles, spring onions, peas and chicken, bring to the boil and cook for 5 minutes, or until the noodles and peas are cooked and the chicken is hot through. ", "Ladle into a deep, wide bowl and, if you fancy, top with the chilli, ginger, garlic, coriander and soy sauce. "]}, "5-ingredient chickpea coconut curry": {"ingredients": ["2 tbsp medium Indian curry paste, such as tikka masala", "400g can chickpeas, drained and rinsed", "227g can chopped tomatoes", "25g/1oz creamed coconut, from a block, roughly chopped ", "250g sachet basmati rice or 125g uncooked basmati rice"], "instructions": ["Put the curry paste and chickpeas in a frying pan and cook over a low heat for 1–2 minutes, stirring constantly. ", "Add the tomatoes and coconut and bring to a gentle simmer. Cook for 6–8 minutes, stirring regularly, until the curry looks thick and glossy. Stir in a little water if you need it. ", "Serve with basmati rice, cooked according to the packet instructions. "]}, "5-ingredient sausage pasta ": {"ingredients": ["1 tbsp olive oil", "1 red pepper, seeds removed, finely chopped", "400g/14oz good-quality sausages, skins removed", "350g/12¼oz tomato and chilli pasta sauce", "350g/12¼oz penne ", "salt and freshly ground black pepper", "freshly grated Parmesan, to serve ", "1 tbsp chopped fresh basil, to serve (optional)"], "instructions": ["Heat the oil in a large frying pan and add the pepper. Cook over a medium heat, until soft.", "Add the sausages to the pan, breaking up the meat with a wooden spoon. Once the meat is browned, add the tomato sauce and cook for 10 minutes.  ", "Meanwhile, cook the pasta in a pan of boiling salted water according to the packet instructions. ", "Drain the pasta and stir in the sauce. Spoon into four bowls and garnish with grated Parmesan and chopped basil, if using. "]}, "5-ingredient cookies": {"ingredients": ["100g/3½oz lightly salted butter, at room temperature", "125g/4½oz soft light brown or golden caster sugar", "1 free-range egg", "175g/6oz self-raising flour", "100g/3½oz chocolate chips, dark or milk, or 100g/3½oz raisins"], "instructions": ["Preheat the oven to 170C/150C Fan/Gas 3 and line two baking trays with baking paper.", "Using a stand mixer on medium speed, cream the butter and sugar together for about 3 minutes until soft and pale. Add the egg and mix for a further minute. Add the flour and mix with a rubber spatula until just combined, then beat thoroughly. Stir in the chocolate chips or raisins.", "If you have time, cover the mixture and chill for 1 hour before baking. Roll the dough into walnut-sized balls and arrange on the trays, leaving space between them as they will spread during baking.", "Bake for about 12 minutes, or until the cookies are firm and golden brown at the edges. Leave to cool on the baking trays; the cookies will firm further as they cool."]}, "5-Grain Porridge with Bee Pollen, Apples, and Coconut": {"ingredients": ["½ cup brown rice", "½ cup quinoa", "¼ cup amaranth", "¼ cup millet", "¼ cup wheat bran", "½ teaspoon kosher salt", "1 tablespoon virgin coconut oil", "¼ cup unsweetened coconut flakes", "1 large sweet-tart apple (such as Pink Lady), cut into ¼” pieces", "¼ teaspoon ground cinnamon", "2 tablespoons honey, plus more", "Flaky sea salt (such as Maldon) and bee pollen (for serving)", "Bee pollen is available at health food stores, some grocery stores, and online."], "instructions": ["Bring brown rice, quinoa, amaranth, millet, wheat bran, salt, and 6 cups water to a boil in a medium pot. Reduce heat, partially cover, and simmer, stirring occasionally, until cereal is the consistency of porridge (softer and thicker than the usual bowl of oatmeal) and water is absorbed, 40–50 minutes.", "DO AHEAD: Porridge can be made 5 days ahead. Let cool; cover and chill.", "Heat coconut oil in a medium skillet over medium-high. Cook coconut flakes, stirring often, until toasted, 2 minutes; transfer to a plate.", "Add apple, cinnamon, and 2 Tbsp. honey to skillet and cook, stirring occasionally, until apples are browned in spots and tender, about 3 minutes.", "Serve porridge topped with apples, coconut, sea salt, bee pollen, and a drizzle of honey, if you like."]}, "522 North Pinckney Cocktail": {"ingredients": ["2 cups fresh pink grapefruit juice (from 2-3 grapefruits)", "1/2 cup St-Germain (elderflower liqueur)", "1/4 cup Campari", "1 750-ml. bottle chilled sparkling wine"], "instructions": ["Combine grapefruit juice, St-Germain, and Campari in a large pitcher. Cover and chill until cold, about 2 hours.", "Divide grapefruit mixture among glasses and top off with sparkling wine.", "DO AHEAD: Grapefruit mixture can be made 1 day ahead. Keep chilled."]}, "5-Minute Vinegar Slaw": {"ingredients": ["¼ cup red wine vinegar", "2 tablespoons sugar", "2 teaspoons coarse kosher salt", "¼ teaspoon celery seeds", "3 green onions, thinly sliced", "2 8-ounce packages coleslaw mix"], "instructions": ["Whisk first 4 ingredients in large bowl. Mix in green onions. Add coleslaw mix; toss."]}}