{"Jaffa cake tarts": {"ingredients": ["250g/9oz unsalted butter, softened", "200g/7oz icing sugar, sifted", "100g/3½oz beaten free-range eggs", "420g/15oz plain flour, sifted", "85g/3oz cocoa powder, sifted", "pinch salt", "125g/4½oz unsalted butter, softened", "125g/4½oz caster sugar", "125g/4½oz beaten free-range eggs", "125g/4½oz ground almonds", "25g/1oz plain flour, sifted", "115g/4oz Seville oranges ", "¼ unwaxed lemon", "200g/7oz jam sugar", "10g/⅓oz soft brown sugar", "200g/7oz caster sugar", "¼ unwaxed lemon, pared peel only", "seeds of ½ vanilla pod", "200ml/7fl oz orange-flavoured liqueur", "75ml/2½fl oz milk", "75ml/2½fl whipping cream", "30g/1oz beaten free-range egg yolks", "15g/½oz caster sugar", "150g/5½oz dark chocolate (66% coca solids), finely chopped", "15g/½oz leaf gelatine ", "300g/10½oz caster sugar ", "100g/3½oz cocoa powder, sifted ", "175ml/6fl oz whipping cream", "dried orange zest", "chocolate decoration", "gold leaf"], "instructions": ["To make the chocolate pâte sucrée, beat the butter in a mixing bowl until soft and smooth. Add the icing sugar and beat until smooth. Gradually incorporate the eggs and mix until fully emulsified. Mix in the flour, cocoa powder and salt until smooth. Turn the dough out onto a work surface, shape it into a block and wrap in cling film. Leave to rest in the fridge for 2–3 hours.", "Meanwhile, to make the almond cream, beat together the butter and sugar in a mixing bowl until smooth. Gradually beat in the eggs until combined. Fold in the ground almonds and flour and mix until smooth.", "To make the orange marmalade, use a peeler to remove the orange peel in long strips, then thinly slice it and place in a muslin bag. Seal. Roughly chop the oranges and lemon, put in a saucepan with the sugars, the muslin bag and 250ml/9fl oz of water. Simmer over a low heat, uncovered, for 2 hours, or until the fruit is tender. ", "Remove the muslin bag and set aside to drain. Line a colander with layers of muslin and set over a bowl. Strain the contents of the pan through the muslin and leave to drain for 30 minutes. Squeeze out the remaining liquid by twisting the cloth. Discard the pulp.", "Return the strained liquid and the peel from the muslin bag to a clean saucepan, bring to the boil and boil until it reaches 104°C, stirring continuously. To test the marmalade is setting, spoon a small amount onto a cold plate and leave to cool. If it sets, remove the pan from heat and spoon the marmalade into a sterilized jar. Leave to cool, then seal. ", "To make the orange syrup, put the sugar, lemon peel and vanilla in a saucepan with 225ml/8fl oz of water and bring to the boil. Cook for 2–3 minutes. Remove from the heat and allow to cool. Once cool, add the liqueur. ", "To make the chocolate mousse, put the milk and 75ml/2½fl oz of whipping cream in a saucepan and bring to the boil. Meanwhile, whisk together the egg yolks and sugar in a large mixing bowl for 2–3 minutes, or until light and pale. Pour half the boiled milk and cream into the egg mixture and mix well. Pour this back into the pan, mix and cook over a low heat, stirring continuously, until it is thick enough to coat the back of a spoon. ", "Put the chopped chocolate into a large bowl. Take the egg and cream mixture off the heat and pass through a fine sieve onto the chocolate. Use a spatula to mix until the chocolate has fully melted and the mixture has emulsified. Allow to cool. ", "Whisk the remaining 200ml/7fl oz of whipping cream in a large mixing bowl until soft peaks form. Carefully fold the whipped cream into the chocolate mixture and use immediately.", "To make the chocolate glaçage, soak the gelatine in a bowl of iced water for a few minutes, until soft. Squeeze to remove any excess water. Put the sugar in a saucepan with 225ml/8fl oz of water, bring to the boil and simmer on a low heat for 2–3 minutes. Add the cocoa powder and cream. Bring back to the boil and simmer for 4–5 minutes. Take the pan off the heat, add the soaked gelatine and stir until dissolved. Strain and allow to cool.", "To assemble, fill the mince pie tins with the chocolate mousse. Flatten the tops with a small stepped palette knife, cover and place in the freezer to set for at least 2 hours.", "Roll out the pastry to 3mm thickness and line the tartlet cases. Cover and rest in the fridge for 1 hour.", "Preheat the oven to 200C/180C Fan/Gas 6. Remove the tarts from the fridge and pipe 10g/⅓oz of marmalade into the base of each one. Pipe a bulb of almond cream on the top, cover and leave to rest in the fridge for 30 minutes.", "Bake the tarts for 15 minutes. Allow to cool, then remove them from their cases. If necessary, level off the tops using a serrated knife.", "Take the set mousses out of the mince pie moulds and place on a glazing rack. Glaze with the glaçage and place one on top of each tartlet. To serve, decorate with dried orange zest, a chocolate stick and gold leaf."]}, "Jerusalem artichoke broth": {"ingredients": ["1 large onion, halved and sliced", "675g/1½lb Jerusalem artichokes, peeled, halved and sliced", "2 tbsp extra virgin olive oil", "4 sprigs fresh thyme", "1 bay leaf", "1 litre/1¾ pints hot chicken or vegetable stock", "2 tbsp white wine vinegar", "salt and freshly ground black pepper", "2 tbsp roughly chopped parsley", "6 thick slices baguette (optional)", "150g/5oz single Gloucester, mature cheddar or gruyère cheese, coarsely grated (optional)"], "instructions": ["Place the onion, artichokes and oil into a pan and add the thyme and bay leaf, tied together with string. Cover and sweat over a low heat for about 15 minutes, stirring occasionally.", "Add the stock and vinegar, season well with salt and freshly ground black pepper and bring up to the boil. Simmer for ten minutes, then taste and adjust the seasoning. Discard the thyme and bay leaf and pour into serving bowls.", "To serve, sprinkle with parsley. If using the bread and cheese, preheat the grill to medium. Toast the baguette lightly on both sides under the grill, then, just before serving, top with grated cheese and slide back under the grill to melt. Float a slice of cheese on toast in each bowl of soup as you serve."]}, "Jalapeño and anchovy ketchup": {"ingredients": ["200g/7oz tomato purée", "7 anchovies, drained ", "5 tbsp olive oil ", "8 slices jalapeño pepper (from a jar), or to taste", "1 garlic clove, roughly chopped"], "instructions": ["Blend all of the ingredients and 2-3 tbsp cold water together in a food processor until smooth. ", "Transfer to to a sterile, airtight jar. This ketchup will keep in the fridge for up to 2 weeks. "]}, "James Martin's roast chicken with spring vegetable fricassée ": {"ingredients": ["1 onion, roughly chopped", "2 carrots, roughly chopped", "1.5kg/3lb 5oz whole chicken", "2 tbsp rapeseed oil", "75g/2¾oz butter", "150g/5oz asparagus, cut into 3cm/1¼in pieces", "100g/3½oz fresh peas", "1 shallot, finely sliced into rings", "1 tbsp chopped fresh marjoram", "salt and freshly ground black pepper"], "instructions": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Place the onions and carrots in a deep-sided roasting tin, then sit the chicken on top. Season the chicken all over with salt and freshly ground black pepper, then drizzle over the rapeseed oil. Pour 75ml/2½fl oz water into the tray. ", "Roast for 1-1¼ hours, or until the chicken is cooked through. (The chicken is cooked if the juices run clear when a skewer is inserted into the thickest part of the thigh meat. If the chicken is not cooked through, return to the oven for a further 10 minutes and check again.)", "Remove the chicken from the oven and set aside, covered, to rest for 10 minutes.", "Meanwhile, for the fricassée, bring half of the butter and 200ml/7fl oz water to the boil in a saucepan. Reduce the heat until the water is simmering, then add the asparagus, peas, shallot and marjoram. Simmer for 3-4 minutes, or until the vegetables are all tender.", "Drain the vegetables, if necessary, and return to the pan. Stir in the remaining butter and season, to taste, with salt and freshly ground black pepper.", "To serve, carve the meat and place it on serving plates. Spoon the fricassée alongside."]}, "Jasmine tea-smoked trout with spelt salad and wasabi dressing": {"ingredients": ["100g/3½oz raw spelt", "300ml/10fl oz chicken stock", "2 x 150-200g/5½-7oz trout fillets, skin on pin-boned", "200g/7oz jasmine tea", "1 fillet smoked eel, cut into very thin strips", "150g/5½oz edamame beans, beans removed from their pods", "150g/5½oz fresh peas, removed from their pods", "1 punnet pea shoots, stalks removed", "2 tbsp chopped fresh coriander", "100ml/3½fl oz sour cream", "¼ tsp wasabi"], "instructions": ["For the spelt place the stock and spelt into a saucepan and cook according to the packet instructions. Drain and leave to cool.", "For the trout, put some tin toil in the bottom of a smoker and spread the jasmine tea on top of the foil. Put the fish on a rack over the tea. Cook for 4-8 minutes until the fish is cooked through.", "Mix together all the salad ingredients and the cooked spelt in a large bowl. Mix together the sour cream and wasabi to make the dressing.", "To serve, serve the salad in the centre of the plate and top with the smoked trout, pieces if smoked eel and a little dressing."]}, "Jalebi with pistachio ice cream ": {"ingredients": ["200g/7oz raw shelled pistachios", "150g/5½oz raw shelled green Iranian pistachio nuts (see tip)", "½ vanilla pod, halved and seeds scraped", "¼ tsp sea salt ", "¼ tsp ground cardamom", "600ml/20fl oz pistachio milk (as above)", "1 large avocado, stoned and chopped ", "200g/7oz raw shelled green Iranian pistachio nuts (see tip), half chopped", "100ml/3½fl oz organic maple syrup  ", "100g/3½oz white urid dal, rinsed", "125g/4½oz plain flour", "1/3 tsp baking powder", "2 pinches saffron ", "500g/1lb2oz caster sugar", "large pinch ground green cardamom ", "oil, for deep-frying", "2 tbsp golden syrup, to serve (optional)"], "instructions": ["For the pistachio milk, place the nuts in a large bowl and cover with 800ml/1½ pints of hot water. Leave overnight at room temperature. ", "Drain the nuts, rinse and transfer to a blender or food processor. Cover with 800ml/1½ pints of hot water again and add the vanilla seeds, salt and cardamom. Blitz until a smooth paste is formed. ", "Pour the paste into a muslin-lined sieve and squeeze through all the milk into a bowl below. Place the milk in the fridge to chill, you will use some for the ice cream below.", "For the pistachio ice cream, combine the milk, avocado, whole pistachios and maple syrup in a blender or food processor. Blend until smooth.", "Pour the mixture into a freezerproof plastic container or individual moulds and top with the chopped pistachios. Freeze overnight.", "When ready to serve, remove from the freezer and leave to thaw for 10–15 minutes, or until soft enough to scoop.", "For the jalebi, soak the urid dal in hot water for 2 hours, or until well softened. Drain and place in a food processor or blender and blitz to a smooth paste. ", "Place the flour, baking powder and 1 pinch saffron in a mixing bowl. Add enough water to make a thick batter (about the same consistency of a drop scone batter). Add the blended dal to the mixture and adjust with flour or water to achieve the same consistency as before. Place the batter in a squeezy bottle. ", "Place 250ml/9fl oz water and the sugar in a saucepan and bring to the boil. As soon as it boils, add the cardamom and remaining saffron and simmer for 3 minutes. Remove from the heat.", "Heat the oil to 165C in a large, deep saucepan or a deep-fat fryer. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Squeeze coils of batter into the hot oil (CAUTION: the oil may spit so take care to protect yourself from splashes. Wear oven gloves.). When the batter turns crispy and golden brown, remove using a slotted spoon and drain on kitchen paper. ", "Place the jalebi in serving bowls and spoon over the cardamom syrup. Serve immediately with scoops of the ice cream and a little golden syrup, if desired. "]}, "James Martin's chargrilled T-bone steak ": {"ingredients": ["275ml/9½fl oz malt vinegar", "225g/8oz soft brown sugar", "1.5kg/3lb 5oz ripe tomatoes, very roughly chopped", "200g/7oz onions, roughly chopped", "4 red chillies, chopped", "2 garlic cloves, finely chopped", "1 tbsp finely chopped fresh root ginger", "1 tsp ground coriander", "sea salt and freshly ground black pepper", "4 T-bone steaks, at room temperature", "2 tbsp olive oil", "4 banana shallots, skin on, cut in half lengthways", "4 fresh figs, cut in half lengthways", "1 tbsp balsamic vinegar", "½ lemon, juice only", "3 tbsp extra virgin olive oil", "1 round lettuce, separated into leaves", "salt and freshly ground black pepper"], "instructions": ["To make the chutney, place the vinegar and sugar in a large saucepan, bring to the boil and cook for 3–4 minutes until the sugar has melted. Add all the other ingredients, bring to the boil and cook for about 20–30 minutes, stirring frequently. If the tomatoes are very juicy, you might need to cook for a little longer until the mixture starts to thicken. Leave the chutney with a chunky texture and do not cook for too long so that the ingredients start to break down into a purée. ", "Leave the chutney to cool and then place into sterilised jars to store for 2–3 weeks in the fridge (the flavour will improve over time).", "To make the steaks, heat a griddle pan until searing hot. Rub the steaks with a little olive oil then season with salt and black pepper. Place onto the griddle and sear for 2 minutes then turn the steaks 90 degrees and sear the same side for a further 2 minutes. Turn the steaks over and repeat, searing and turning. Remove the steaks from the griddle and set them aside, to rest, on a plate.", "Meanwhile, rub the shallots with the rest of the olive oil and place cut-side down on the griddle and cook for 3–4 minutes. Add the figs, face down, and cook for another minute until they are all tender and charred.", "Whisk the balsamic vinegar, lemon juice and extra virgin olive oil together in a small bowl and season with salt and pepper. Just before serving, toss the lettuce, shallots and figs together in a bowl with the lemon dressing. ", "Serve the steaks with the salad alongside and a spoonful of chutney."]}, "Jerk seasoning": {"ingredients": ["1 bunch fresh thyme, leaves only", "2 cinnamon sticks, roughly crushed", "2 tbsp chopped fresh coriander", "1 tsp coriander seeds, crushed", "2 tbsp black peppercorns, crushed", "1 tsp freshly grated nutmeg", "3 tsp allspice, crushed", "6 garlic cloves", "4 Scotch Bonnet chillies, seeds removed", "2 tsp chopped fresh ginger", "2 limes, zest of 1 lime, juice of 2", "140ml/¼ pint olive oil"], "instructions": ["Place all of the ingredients in a blender or food processor and blend to make a smooth paste. ", "Use the paste as a seasoning for chicken, pork or fish. It will keep for two weeks if covered and refrigerated."]}, "John Dory alla carlina": {"ingredients": ["1 onion, chopped", "1 bulb fennel, sliced", "100g/3½oz celery, sliced", "100g/3½oz carrots, sliced", "25g/1oz button mushrooms, washed and sliced", "1 sprig thyme", "2¼ litres/4 pints water", "1kg/2lb 4oz flatfish bones (such as brill, sole, plaice) or fillet (ask your fishmonger for bones)", "6 tbsp olive oil", "4 garlic cloves, finely chopped", "1kg/2lb 4oz well-flavoured tomatoes, peeled or 2 x 400g tins chopped tomatoes", "salt and freshly ground black pepper", "4 John Dory fillets ", "50g/1¾oz plain flour", "2 tbsp olive oil, plus extra to serve", "1 lemon, halved", "1 tsp Worcestershire sauce", "2 small gherkins, finely chopped", "2 tbsp capers, 1 tbsp finely chopped and 1 tbsp whole", "2 tomatoes, peeled, de-seeded and finely chopped", "3 tbsp tomato sauce (see above)", "250ml/9fl oz fish stock (see above)", "small handful flatleaf parsley, chopped"], "instructions": ["For the fish stock, put all the ingredients except the fish bones into a large pan, bring to the boil, then turn down the heat and simmer gently for 20 minutes. ", "Add the fish bones (or fish fillet) and bring back up to a simmer, skimming off any scum as it rises to the surface. Simmer for a further 20 minutes. Strain through a sieve into a clean pan and simmer a little longer, if necessary, until reduced to about 1.2 litres/2 pints. If not using immediately, cool and refrigerate or freeze for later use.", "For the tomato sauce, heat the olive oil and garlic in a saucepan. As soon as the garlic starts to sizzle, add the tomatoes and simmer for 15-20 minutes, breaking them up as they cook. Cook until the sauce has reduced and thickened, then season with salt and pepper. The sauce is ready to use. If not using immediately, leave to cool, then refrigerate for up to a week or freeze for later use.", "Season the John Dory fillets with some salt and pepper and lightly dust with flour. Heat the olive oil in a frying pan, add the fillets skin-side down and fry for 2-3 minutes until lightly browned. Season with a squeeze of lemon juice, turn the fish over and cook for a further minute. Remove from the pan and keep warm.", "Add the Worcestershire sauce, gherkins, whole and chopped capers, tomatoes, tomato sauce and fish stock to the pan, bring to the boil then reduce a little to create the sauce. Add the fish carefully back to the pan for a minute to warm through in the sauce.", "Serve immediately, drizzled with a little more olive oil and sprinkled with fresh parsley."]}, "Jumbo couscous salad": {"ingredients": ["300ml/10fl oz vegetable stock", "2 tsp olive oil", "100g/3½oz giant couscous", "200g/7oz broccoli", "100g/3½oz peas", "100g/3½oz broad beans, podded", "100g/3½oz salad leaves", "4 spring onions, halved length ways", "2–4 tbsp mint (or any soft herbs, such as tarragon)", "100ml/3½fl oz plain yoghurt", "pinch saffron", "½ tsp runny honey", "pinch caster sugar", "1 tbsp mint (or any soft herbs, such as tarragon)", "sea salt and freshly ground black pepper"], "instructions": ["Preheat a barbecue or grill to it's highest setting.", "Pour the vegetable stock into a saucepan and bring to the boil.", "Heat 1 teaspoon oil in a frying pan over a medium heat and toast the couscous for a couple of minutes. Tip into a large bowl and add the hot vegetable stock. Cover with cling film and allow to stand for 5–10 minutes.", "Bring a large saucepan of salted water to the boil and blanch the broccoli, peas and broad beans for a couple of minutes and refresh in ice-cold water. ", "Remove the broccoli from the water, drain and toss in a bowl with the spring onions and 1 teaspoon oil. Place onto the barbeque or under the grill and char on all sides. Remove from the grill and set aside until ready to serve.", "To make the dressing, place all the ingredients in a medium glass bowl and mix well. ", "Scatter the leaves onto a serving platter and dress with the couscous, broccoli, peas, broad beans, spring onions and herbs. Top with the dressing and serve."]}, "Jumbo prawns with tomatoes and garlic ": {"ingredients": ["1 tbsp mild olive oil", "2 garlic cloves, very thinly sliced", "1 long red chilli, deseeded and finely chopped (or use ½ tsp dried chilli flakes)", "150g/5½oz cherry tomatoes, halved", "½ lemon, juice only", "250g/9oz jumbo king prawns, cooked, peeled and deveined", "3 heaped tbsp roughly chopped flat leaf parsley", "ground black pepper", "160g/6oz green beans, steamed, to serve"], "instructions": ["Heat the oil in a small frying pan over a low heat. Add the garlic and chilli and cook very gently for five minutes or until the garlic is very soft but not coloured, stirring occasionally.", "Add the tomatoes and lemon juice and cook for two minutes or until beginning to soften. Stir in the prawns and cook for 2-3 minutes, stirring, until the tomatoes are well softened and the prawns are hot through.", "Remove the pan from the heat, stir in the parsley, season with lots of pepper and serve with the beans."]}, "James' sticky toffee pudding": {"ingredients": ["55g/2oz butter, plus extra for greasing", "170g/6oz demerara sugar", "1 tbsp  golden syrup", "2 free-range eggs", "2 tbsp black treacle", "200g/7oz self-raising flour, plus extra for flouring", "200g/7oz pitted dates", "290ml/10fl oz boiling water", "1 tsp  bicarbonate of soda", "½ tsp vanilla extract", "110ml/4fl oz double cream", "55g/2oz butter, diced", "55g/2oz dark muscovado sugar", "2 tbsp black treacle", "1 tbsp  golden syrup", "vanilla ice cream, to serve"], "instructions": ["Preheat the oven to 200C/400F/Gas 6. Grease and flour 6 individual pudding moulds.", "Cream the butter and sugar together in a food processor until pale and fluffy. Add the golden syrup, treacle and eggs, a little at a time, and blend until smooth.  Add the flour and blend, at a low speed, until well combined. Transfer to a bowl.", "Meanwhile, blend the dates and boiling water in a food processor to a smooth purée. Stir in the bicarbonate of soda and vanilla. ", "Pour the date mixture into the pudding batter and stir until well combined.", "Pour the mixture into the moulds and bake for 20-25 minutes, or until the top is springy and golden-brown.", "To make the sauce, heat all of the ingredients in a pan, stirring occasionally, until boiling. ", "To serve, remove the puddings from the moulds and place onto each of 6 serving plates. Pour over the sauce and serve with a scoop of vanilla ice cream."]}, "Jungle chicken curry with rice": {"ingredients": ["5 kaffir lime leaves (frozen, fresh or dried)", "½ chicken stock cube, dissolved in 300ml/10½fl oz just-boiled water ", "275g/9¾oz long-grain or basmati rice", "2 tbsp sunflower oil", "2 chicken breasts, boned, skinned, cut into small pieces", "1 large red pepper, cored, deseeded and cut into 2cm/¾in chunks", "200g/7oz fine green beans, trimmed, halved lengthways", "200g/7oz baby sweetcorn, trimmed, halved diagonally", "2 tbsp Thai red curry paste", "1 tbsp Thai fish sauce (nam pla)", "2 tsp cornflour", "50g/1¾oz fresh spinach leaves", "large handful fresh basil leaves (optional)"], "instructions": ["Stir the lime leaves in to the stock and set aside to infuse. ", "Meanwhile, half-fill a large saucepan with water and bring to the boil. Add the rice, stir well and return to the boil, then cook according to the packet instructions. ", "Heat the oil in a large non-stick frying pan or wok over a high heat. Add the chicken, red pepper, green beans and baby sweetcorn and stir-fry for 2-3 minutes. ", "Add the curry paste and cook for a further 1-2 minutes. ", "Add the stock, lime leaves and fish sauce, bring the mixture to the boil. Reduce the heat and simmer for 2-3 minutes, or until the vegetables are just tender. ", "In a small bowl, whisk the cornflour with 1 tbsp cold water to form a smooth paste. Whisk into the curry and continue to simmer for 4-5 minutes, or until the curry sauce has thickened slightly. ", "Stir in the spinach and continue to simmer until just wilted. Stir in the basil leaves just before serving. Discard the lime leaves.", "To serve, drain the rice and spoon it onto serving plates. Top each portion with a ladleful of the curry."]}, "Jerk chicken thighs": {"ingredients": ["2 cloves garlic, roughly chopped", "2cm/1 inch piece fresh root ginger, roughly chopped", "1 yellow scotch bonnet chilli, chopped or 1 tsp dried chilli flakes", "1 tbsp chopped fresh thyme leaves", "1 tsp coriander seeds or ½ tsp ground coriander", "2 cloves, or a pinch of ground cloves", "½ tsp ground mixed spice ", "1 tsp curry powder", "salt and freshly ground black pepper", "2 tbsp vegetable oil", "2 boneless chicken thighs", "25g/1oz butter", "lemon wedge, to serve", "200g/7oz long grain rice", "1 red pepper, de-seeded and chopped"], "instructions": ["For the jerk chicken, put all the chicken ingredients except the chicken thighs and butter in a food processor and pulse to a rough paste. Rub the paste all over the chicken thighs.", "Heat the butter in a frying pan until frothing, then fry the chicken thighs for 7-8 minutes on both sides, or until golden-brown and cooked through. (The juices will run clear when the chicken is pierced in the thickest part with a skewer.)", "For the rice, put the rice in a saucepan and cover with double the amount of boiling water. Boil for 7-8 minutes, then add the peppers. Cook for a further 2-3 minutes, or until all the liquid is absorbed and the rice is tender. Fluff up the rice with a fork.", "To serve, spoon the rice and peppers onto a serving plate and place the fried chicken thighs on the side. Garnish with the lemon wedge and serve."]}, "James Martin’s ultimate macaroni cheese": {"ingredients": ["300g/10½oz dried macaroni", "40g/1¾oz butter", "40g/1¾oz plain flour", "500ml/18fl oz milk", "100g/3½oz blue cheese, preferably mild gorgonzola, grated or finely diced", "150g/5½oz cheddar, grated", "100g/3½oz Caerphilly, grated ", "½ tsp freshly grated nutmeg, or to taste", "90g/3oz pancetta, chopped", "100g/3½oz mozzarella, chopped", "75g/3oz fresh breadcrumbs", "25g/1oz freshly grated Parmesan", "large handful fresh basil leaves, roughly chopped, to serve", "1 tbsp wholegrain mustard", "1 tbsp white wine vinegar", "3 tbsp olive oil", "1 head Romaine lettuce, cut into chunks", "sea salt and freshly ground black pepper"], "instructions": ["For the macaroni cheese, preheat the grill to its highest setting.", "Cook the macaroni in a large saucepan of salted, boiling water according to the packet instructions.", "Meanwhile, in a separate saucepan, heat the butter until melted, then whisk in the flour until smooth and cook for 1-2 minutes, or until pale golden-brown. ", "Whisk in the milk a little at a time, waiting until the mixture has thickened after each addition before adding any more and whisking continually. After all of the milk has been added to the mixture, you should have a smooth sauce with the consistency of double cream.", "Add all of the blue cheese, 100g/3½oz of the cheddar and all of the Caerphilly to the sauce and heat gently, stirring all the time, until it has melted. Season, to taste, with salt, freshly ground black pepper and nutmeg.", "Drain the cooked pasta and tip it into the pan containing the cheese sauce. Stir well to coat the pasta. Set aside.", "Dry-fry the chopped pancetta in a frying pan over a high heat until golden-brown and crisp. Stir it into the macaroni cheese mixture.", "Transfer the macaroni cheese to a large ovenproof dish and top with the chopped mozzarella, breadcrumbs, and Parmesan. Grill for 2-3 minutes, or until the topping is golden-brown and bubbling.", "Meanwhile, for the salad, in a bowl, whisk together the mustard, vinegar and olive oil, then season, to taste, with salt and freshly ground black pepper. Add the lettuce and mix to coat it in the dressing. ", "Serve the macaroni cheese with the salad alongside, sprinkled with the chopped basil."]}, "Jack Monroe's flapjacks": {"ingredients": ["4 tbsp oil, butter or margarine, plus extra for greasing", "200g/7oz golden syrup, honey or maple syrup", "300g/10½oz porridge oats", "1 tsp ground cinnamon or mixed spice", "70g/2½oz sunflower seeds (or other seeds)", "30g/1oz pumpkin seeds (or other seeds)", "200g/7oz dried apricots (or other dried fruit), roughly chopped"], "instructions": ["Preheat the oven to 210C/190C Fan/Gas 6½. Lightly grease a deep 20cm/8in square cake tin.", "If using butter or margarine, melt it in a pan. Add the syrup to the melted butter or oil. Mix in all the remaining ingredients. ", "Spoon into the baking tin and flatten with a spoon or spatula.", "Bake in the centre of the oven for 15-20 minutes, or until golden and starting to firm at the edges. Remove from the oven and allow to cool.", "Cut into 10 squares."]}, "Jollof rice": {"ingredients": ["400ml/14fl oz passata", "3 tbsp tomato purée", "2 fresh red Scotch bonnet chillies, seeds removed", "2 onions, chopped", "2 red peppers, seeds removed and roughly chopped", "8 garlic cloves, peeled", "3 tbsp fresh rosemary leaves", "1 tbsp fresh thyme leaves", "2 tsp ground coriander", "1½ tsp sweet smoked paprika", "50ml/2fl oz olive oil", "150g/5½oz cherry tomatoes, halved", "800ml/1½ pints chicken stock or vegetable stock", "2 bay leaves", "500g/1lb 2oz long-grain rice, rinsed ", "2 tbsp sunflower oil", "2 ripe plantains, peeled and thickly sliced", "small handful of coriander leaves, roughly chopped", "sea salt and freshly ground black pepper", "green salad, to serve"], "instructions": ["Put the passata, tomato purée, chillies, onions, peppers, garlic, rosemary, thyme, ground coriander and paprika in a blender or food processor and blend until smooth.", "Heat the olive oil in a large saucepan over a medium heat. Add the cherry tomatoes and the blended tomato sauce. Bring to the boil, then reduce the heat slightly and simmer for 5 minutes, stirring occasionally.", "Add the stock, bay leaves, rice, 1½ teaspoons salt and a large pinch of black pepper. Stir to combine and bring to the boil. Reduce the heat and simmer for 10–12 minutes, stirring frequently to prevent the rice from sticking, until the rice is cooked through. Turn off the heat, cover with the lid and leave to steam for 15 minutes without removing the lid.", "Meanwhile, heat the sunflower oil in a frying pan over a medium heat. Fry the plantain for a few minutes on each side until golden and tender.", "Spoon the jollof rice onto warmed plates and add the plantain on the side. Garnish with the chopped coriander and serve with a green salad alongside. "]}, "Jackfruit and bean chilli": {"ingredients": ["1 tbsp coconut oil", "2 onions, finely chopped", "3 celery sticks, finely chopped", "250g/9oz mushrooms, roughly chopped", "5 garlic cloves, finely chopped", "2 tsp chilli powder, or to taste", "2 x 400g tins jackfruit in brine, drained and rinsed", "500g/1lb 2oz tomato passata", "400g tin plum tomatoes, squashed", "½ tbsp tomato purée", "1 tsp balsamic vinegar", "1 tsp tomato ketchup", "1 tsp caster sugar", "400g tin butter beans, drained and rinsed", "400g tin kidney beans, drained and rinsed", "400g tin black-eyed beans, drained and rinsed", "400g tin borlotti beans, drained and rinsed", "salt and freshly ground black pepper"], "instructions": ["Melt the coconut oil in a very large saucepan over a medium heat. Add the onions and celery and fry for 10 minutes, or until soft. Mix in the mushrooms, garlic and chilli powder and cook for a further 10 minutes. ", "Stir in the jackfruit, passata, chopped tomatoes and tomato purée. Simmer for a few minutes, until thickened.", "Meanwhile, mix the balsamic vinegar, ketchup and sugar in a small bowl or jug, then stir into the sauce. Add the beans and season.", "Put a lid on the saucepan and slowly simmer the chilli on a low heat for 30–40 minutes. Serve."]}, "Jerk pork with sweet potato mash": {"ingredients": ["2 tsp jerk seasoning", "1½ tsp runny honey", "100ml/3½fl oz pineapple juice (from 227g tin pineapple rings)", "300g/10½oz pork tenderloin", "1 tsp olive oil", "1 x 350g/12oz sweet potato, peeled and cut into 3cm/1¼in pieces", "2 tinned pineapple rings (about 100g/3½oz), drained and finely chopped", "3 spring onions, thinly sliced", "2 tbsp roughly chopped fresh coriander leaf", "½ lime, juice only", "1 tsp olive oil", "½ red chilli, deseeded and finely diced", "pinch salt"], "instructions": ["Mix the jerk seasoning, honey and pineapple juice in a shallow bowl large enough to hold the pork. Add the pork loin and place in the fridge, covered, for at least 30 minutes or overnight, turning the pork over a couple of times.", "Preheat the oven to 200C/180C Fan/Gas 6 and line a baking tray with kitchen foil.", "Remove the meat from the marinade, reserving the liquid, and pat it dry with kitchen paper. Heat the oil in a frying pan over a high heat. Brown the meat on one side, turn over and brown on the other side.", "Place the meat in the baking tray, pour over the marinade and roast for 20–25 minutes, turning the pork over after 15 minutes. Cut into the thickest part of the steak to check that it is juicy but cooked through.", "Meanwhile, bring a saucepan of lightly salted water to the boil and simmer the sweet potato for 15 minutes until tender. Drain, mash and season with salt and pepper.", "To make the salsa, mix the pineapple, spring onion, coriander, a squeeze of lime juice, olive oil, chilli and salt together in a bowl and set aside for at least 10 minutes.", "Turn the meat over in its reduced marinade and leave to rest for 5 minutes. Cut the pork into 2cm/¾in-thick slices and serve with the mash and salsa."]}, "Jammy biscuits": {"ingredients": ["250g/9oz plain flour", "200g/7oz butter, cut into small cubes", "100g/3½oz icing sugar", "pinch of salt", "2 free-range egg yolks", "4 tbsp raspberry jam", "4 tbsp apricot jam"], "instructions": ["Preheat the oven to 170C/325F/Gas 3.", "Place the flour, butter, icing sugar and salt into a bowl. Using your fingertips, rub the ingredients together until the mixture resembles breadcrumbs. ", "Add the egg yolks and mix until a dough forms. Turn out onto a lightly floured work surface and roll out to a thickness of about 0.5cm/¼in. Cut out shapes using a 4cm/1½in cutter. ", "Divide the sables in half. Using a 2cm/1in fluted cutter, make a hole in the middle of half of the sable biscuits and discard the dough. Place all the sables on a baking tray.", "Bake the sables for 10-12 minutes, or until light golden-brown and crisp. Remove and transfer to a wire rack to cool. ", "Using a teaspoon, place a small dollop of raspberry jam on a whole sable. Place a sable (with a hole) over the whole sable biscuit. Repeat until half the sables are done with raspberry jam, then repeat the process, using apricot jam, for the remaining sables. "]}, "Jamaican jerk chicken": {"ingredients": ["1 tbsp English mustard ", "1 tbsp red wine vinegar ", "2 limes, zest and juice", "3 tbsp brown sugar", "2 - 3 Habenero (scotch bonnet) chillies, deseeded ", "5 garlic cloves, peeled", "5 spring onions", "few sprigs fresh thyme", "1 tbsp jerk seasoning", "100ml/3½fl oz lager", "½  tsp sea salt", "1 large chicken (about 1.8kg/4lb), spatchcocked", "groundnut oil, for rubbing"], "instructions": ["For the marinade, place all the ingredients in a food processor and blitz together until smooth. Coat the chicken, cover and leave to marinate in the fridge for at least two hours, but preferably overnight.", "Preheat the oven to 200C/180C Fan/Gas 6. Wipe off the excess marinade and rub with oil. Griddle or barbecue the chicken, breast side down, until the skin starts to char and goes golden brown. Be very careful not to let it burn as it will very easily. ", "Place the chicken onto a baking tray and roast for 35 minutes,  in the oven or until the juices run clear when the thickest part of the leg, between the drumstick and the thigh, is pierced with a skewer and the chicken is cooked. ", "Remove from the oven and leave to rest for 10 minutes, then carve the chicken into 10 pieces. "]}, "Jerk chicken, rice and pea cakes and slaw": {"ingredients": ["1 onion, finely chopped", "1 spring onion, finely chopped", "½ Scotch bonnet chilli, seeds removed, finely chopped", "2.5cm/1in piece of root ginger, grated", "1 tsp ground cinnamon", "1 tsp ground allspice", "2 tsp mixed herbs", "1 tsp salt", "1 tsp black pepper", "3 tbsp all-purpose seasoning", "1 tsp nutmeg", "2 garlic cloves, crushed", "2 tbsp chopped dried thyme leaves", "2 limes, juice only", "1 whole chicken, spatchcocked", "dash olive oil", "50g/1¾oz butter", "4 spring onions, finely chopped", "1 garlic clove, peeled but left whole", "¼ scotch bonnet chilli, finely diced", "2 sprigs fresh thyme", "250g/9oz risotto rice", "600ml/1 pint chicken stock", "200g/7oz fresh peas", "50g/1¾oz parmesan, grated", "2 tbsp olive oil", "2 medium free-range eggs, yolks only", "1 tsp Dijon mustard", "2 tbsp white wine vinegar", "300ml/10½fl oz sunflower oil", "1 celeriac, peeled and thinly sliced", "2 large carrots, peeled and thinly sliced", "1 lemon, juice only", "1 tbsp Dijion mustard", "2 tbsp chopped fresh chives"], "instructions": ["For the jerk chicken, preheat the oven to 200C/400F/Gas 6.", "Place all the ingredients for the jerk spice mix in a blender and blend until you have a rough paste.", "Spread the mixture all over the chicken and leave to marinade for at least an hour.", "Heat a large griddle pan, drizzle a little oil over the chicken and place skin-side down on the griddle. Cook for five minutes, turn over and place in the oven for 40-45 minutes, or until cooked through.", "For the rice and pea cakes, heat a large pan and add the butter. Add the onion, cook for a couple of minutes and then add the garlic, chilli and thyme and cook for a further minute.", "Add the rice and stir to coat the rice. Gradually add the stock a little at a time until all the stock has gone and you have a creamy risotto. Finish by adding the fresh peas and parmesan.", "Allow to go cold and then set aside in the fridge.", "To make the rice and pea cakes, heat a large frying pan and add the oil. Once hot take a tablespoon of cold risotto and shape into a small cake the size of a fish cake and fry for a couple of minutes each side.  ", "For the slaw, add the egg yolks to a small food processor and add the mustard and vinegar. Start the motor on the processor and gradually add the oil a little at a time to make mayonnaise.", "Place the sliced celeriac and carrot in a large glass bowl and add the mayonnaise, lemon juice, mustard and chives. ", "To serve carve the chicken into portions and place on a plate with the rice and pea cakes and slaw."]}, "Jumble biscuits": {"ingredients": ["1 tsp caraway seeds ", "375g/13oz plain flour, plus extra for dusting ", "½ tsp ground aniseed ", "½ tsp ground mace ", "60g/2¼oz unsalted butter, cubed ", "150g/5½oz caster sugar ", "1 large or 2 small unwaxed lemons, finely grated zest only ", "3 free-range eggs, lightly beaten ", "1 free-range egg, lightly beaten ", "caster sugar, for sprinkling "], "instructions": ["Line two large baking trays with baking parchment. ", "Place the caraway seeds in a spice grinder or a pestle and mortar and grind to a powder. Sieve the caraway, flour, aniseed and mace together into a bowl. ", "Rub the butter into the flour until it resembles fine breadcrumbs, then stir in the sugar and lemon zest. Add the eggs and bring the mixture together to form a soft dough. ", "Divide the dough into four balls weighing 65g/2½ and four balls weighing 85g/3oz (you might have a little leftover). Place the dough balls on one of the prepared trays, cover with cling film and chill in the fridge for 30 minutes. ", "Preheat the oven to 180C/160C Fan/Gas 4. ", "Knead the four smaller pieces of dough on a lightly floured surface and roll using your fingertips into a 30cm/12in rope. Knot into double knots and place on one of the lined trays. ", "Shape the remaining four larger pieces of dough into long ropes and cut away a quarter of each rope. Lay out (as pictured) into Celtic knots, using the reserved dough to make the rings that sit on top. Place them directly onto the other lined tray. (The double knots will take an extra 5–10 minutes longer to bake, so don’t mix shapes on the baking trays.) ", "Brush with beaten egg and sprinkle with caster sugar. Bake the Celtic knots for 15–20 minutes, until golden-brown and the double knots for 20–25 minutes. Remove from the oven and leave to cool on a wire rack."]}, "Jacket potato with tuna and sun-dried tomatoes": {"ingredients": ["2 large, floury potatoes", "1 tsp olive oil", "220g/8oz tuna in olive oil, from a jar or tin (drained weight)", "50g/1¾oz sun-dried tomatoes (in oil), drained and roughly chopped", "2 tsp capers", "½ lemon, juice only", "40g/1½oz rocket leaves", "flaky sea salt and freshly ground black pepper"], "instructions": ["Preheat the oven to 200C/180C Fan/Gas 6. ", "Prick the potatoes all over with a fork then rub them with olive oil and sprinkle with flaky salt. Place on a baking tray and bake for 1 hour–1½ hours, depending on size. The potatoes are ready when the skin is crisp and the centre is soft (test by gently squeezing or piercing with a skewer). ", "Drain the tuna, reserving the oil. Using the back of a fork, mash the tuna in a bowl. Add the sun-dried tomatoes, capers, lemon juice and rocket. Add 1 tablespoon of the olive oil from the tuna and some black pepper. Mix until evenly combined, then taste and add more pepper or lemon juice if you like. ", "Cut the hot jacket potatoes in half and top with the tuna mixture."]}, "James Martin's lobster thermidor": {"ingredients": ["1.5kg/3lb 5oz whole cooked lobster, cut in half lengthways, meat removed, shells cleaned and reserved", "50g/1¾oz butter", "2 shallots, finely chopped", "125ml/4fl oz white wine", "500ml/18fl oz fish stock", "250ml/9fl oz double cream", "1 tsp Dijon mustard", "100g/3½oz chanterelle mushrooms, cleaned", "2 tbsp roughly chopped flatleaf parsley", "squeeze lemon juice", "25g/1oz grated Parmesan", "2 free-range egg yolks", "25g/1oz fresh breadcrumbs", "4 King Edward potatoes, peeled and cut into matchsticks", "vegetable oil, for deep frying", "sea salt and freshly ground black pepper"], "instructions": ["Preheat the grill to its highest setting. Place the lobster shells onto a large baking tray and set aside.", "Heat half of the butter in a frying pan over a medium heat until foaming. Fry the shallots for 3-4 minutes, until softened.", "Pour in the wine and bring the mixture to the boil. Simmer until the volume of liquid has reduced by half, then add the stock and continue to simmer until reduced slightly. Add the double cream and mustard and simmer again for 3-4 minutes, until slightly thickened.", "Meanwhile, heat the remaining butter in a separate frying pan over a medium heat. Add the mushrooms and fry for 2-3 minutes, until just softened. Transfer to a bowl and season well with salt and pepper.", "When the sauce has reduced, add the mushrooms and lobster meat and stir through. Add the parsley, lemon juice and half of the Parmesan and season again.", "Whisk in the egg yolks and continue to cook the mixture  over a low heat for 1-2 minutes, until just thickened.", "Divide the lobster meat and sauce between the lobster shells, then sprinkle over the breadcrumbs and remaining Parmesan.", "Meanwhile, heat the vegetable oil in a deep-fat fryer to 190C. Alternatively, heat the oil in a heavy-based, deep-sided pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous; do no leave unattended.)", "Carefully lower the chipped potatoes into the hot oil and fry for 4-6 minutes, or until tender and golden-brown. Remove and drain on kitchen paper.", "Meanwhile, grill the lobster thermidor for 3-4 minutes, or until the topping is crisp and golden-brown.", "Serve the lobster halves on plates with a pile of matchstick fries alongside."]}, "Jerusalem artichokes and leeks with Romana dressing": {"ingredients": ["400g/14oz Jerusalem artichokes, peeled and cut into 15mm thick slices", "2 tbsp olive oil", "3 leeks, trimmed and cut in half lengthways", "salt and freshly ground black pepper", "50g/1¾oz butter", "10 fresh sage leaves", "3 slices prosciutto, shredded", "2 tbsp pine nuts", "50ml/2fl oz good-quality chicken stock", "4 spring onions, trimmed and chopped", "2 tbsp grated Parmesan"], "instructions": ["To make the Jerusalem artichokes and leeks, preheat the oven to 190C/170C Fan/Gas 5. ", "Toss the Jerusalem artichokes in the oil and season well with salt and pepper. Place on a baking tray lined with baking paper and roast for about 20–30 minutes or until just tender.", "Preheat the grill  to high and cook the leeks for about 4–5 minutes on each side or until charred and softened. Leave to cool slightly and then cut the lengths into 3cm/1¼in pieces.", "To make the Romana dressing, heat the butter in a small frying pan. Add the sage and prosciutto and cook for a few minutes without browning the butter. Add the pine nuts and chicken stock and whisk to emulsify, cooking gently for another 2 minutes. Add the spring onions and Parmesan and whisk well to combine.", "Arrange the artichokes and leeks on a serving dish and pour over the dressing. Serve immediately. "]}, "Jamaican rum truffles ": {"ingredients": ["250ml/9fl oz whipping cream", "100g/3½oz milk chocolate, finely chopped", "200g/7oz dark chocolate, finely chopped ", "25g/1oz unsalted butter, diced", "2-3 tbsp dark rum", "5 tbsp cocoa powder, for dusting"], "instructions": ["Heat the cream in a small pan, removing it from the heat just before it comes to the boil. ", "Meanwhile, put the milk chocolate and dark chocolate in a large bowl and, once the cream comes off the heat, pour it over the chocolate. Stir well until melted and smooth. ", "Add the butter and enough rum to taste and mix well. Leave to cool and then cover the chocolate mixture with cling film and transfer to the fridge for at least four hours, or overnight – the chocolate will be set firm.", "Line a large tray with parchment paper. Sift half of the cocoa powder onto each of two large plates. One will be to dust your hands and the other to coat the truffles.", "Use a teaspoon or melon baller to scoop up walnut-sized pieces (about 15g/½oz) of the chocolate mixture. Press the palms of your hands into one of the cocoa powder plates to lightly coat and roll the truffle pieces quickly into a ball. Don’t roll the chocolate in your hands for too long or it will begin to melt. ", "Roll the truffle around in the cocoa powder on the other plate to lightly coat and place on the tray. Repeat until all of the mixture is used up to give about 40 truffles in total, pressing your hands into more cocoa powder when necessary to avoid sticking. It is best to wash your hands a few times throughout the process, but be sure to rinse them in cold water before drying so that they are nice and cold to avoid melting the truffles.", "Cover and chill in the fridge for at least 30 minutes before serving. "]}, "Jam sponge pudding": {"ingredients": ["100g/3½oz strawberry or raspberry jam", "350g/12oz butter, softened, plus extra for greasing", "100g/3½oz golden syrup", "125g/4½oz caster sugar", "6 free-range eggs, lightly beaten", "350g/12oz self-raising flour", "85g/3oz strawberry or raspberry jam"], "instructions": ["Generously butter the inside of two 1.2 litre/2 pint pudding basins.", "Spoon the jam into the base of the pudding basin and set aside.", "Beat the butter, golden syrup and sugar together in a mixer until light and fluffy.", "Beat in half the eggs followed by half the flour and when well combined, add the remaining eggs and flour. The mixture should be at a dropping consistency. Add a splash of milk if the mixture is too thick.", "Spoon the mixture into the pudding basins, only filling them three quarters full, then smooth the surface with the back of a spoon.", "Loosely cover with cling film, allowing room for the cling film to inflate as the mixture rises, and cook in the microwave for five minutes.The pudding is done when a skewer inserted into the centre of the pudding comes out clean. ", "Leave to stand for five minutes then run a blunt knife around the edge of the pudding to loosen the sides, carefully invert onto a deep plate and remove the basin.", "To serve, spoon the extra jam over the pudding, cut into generous wedges and serve with custard."]}, "Jollof rice with chicken ": {"ingredients": ["300g/10½oz basmati rice", "1 tbsp vegetable oil", "8 boneless, skinless chicken thighs, cut in half", "1 onion, roughly chopped", "3 garlic cloves, grated", "5cm/2 in piece fresh root ginger, peeled and finely grated", "1 red chilli, deseeded and finely chopped", "1 tsp smoked paprika", "2 tbsp tomato purèe", "700ml/1¼ pint tomato passata", "300ml/10fl oz chicken stock, from a cube", "2 red peppers, deseeded and roughly chopped", "2 tbsp roughly chopped fresh coriander", "freshly ground black pepper"], "instructions": ["Tip the basmati rice into a large bowl and cover with cold water. Set aside.", "Heat the oil in a large lidded sautè pan, add the chicken thighs and fry on each side for 1–2 minutes, or until just golden brown. Push the chicken to one side, add the onion and cook for 3–4 minutes, or until just softened but not coloured.", "Stir the chicken back into the onions, then add the garlic, ginger, chilli and smoked paprika and cook for 1 minute. Add the tomato purèe and mix well.", "Drain the rice and stir it into the chicken mixture. Add the tomato passata and half the stock. Stir well and bring to a simmer. Cover with a lid and cook gently over a medium-low heat for 15 minutes, or until the liquid has nearly been absorbed.", "Stir the rice well, then add the remaining stock and stir once more. Scatter the peppers over the top of the rice, return the lid to the pan and cook for another 5 minutes, or until all the liquid has been absorbed and the rice and peppers are tender. (If the rice is not quite done, cook for a further 5 minutes.) Season with pepper, stir through in the coriander and serve."]}, "Jam roly-poly": {"ingredients": ["softened butter, for greasing", "200g/7oz self-raising flour, plus extra for dusting", "100g/3½oz shredded suet", "1 tbsp caster sugar", "good pinch salt", "150ml/5fl oz semi-skimmed milk or water", "6–7 tbsp raspberry or strawberry jam"], "instructions": ["Preheat the oven to 200C/180C Fan/Gas 6. Butter a large sheet of baking paper and set aside. ", "Stir the flour, suet, sugar and salt in a large bowl until fully combined. Slowly stir in the milk to form a soft, spongy dough.", "Tip the dough out onto a floured surface and knead for a few minutes. Roll the dough out to a 22cm x 32cm/8½in x 13in rectangle. ", "Spread the jam onto the dough, leaving a 1.5cm/½in border. Gently roll the dough up from the short end and transfer to the greaseproof paper, seam-side down. Wrap the roly poly in the baking paper, making a long pleat in the paper to allow the pudding to expand as it cooks. Twist the ends of the paper like a Christmas cracker and tie tightly with kitchen string, to seal the pudding inside. Repeat the process with a large piece of kitchen foil. ", "Place the pudding onto a roasting rack set on a deep-sided roasting tin. Pour boiling water halfway up the roasting tin and cook in the oven for 30–35 minutes.", "Remove the pudding from the oven, unwrap the kitchen foil, then snip the string and unwrap the paper.", "The pudding should be well risen and lightly browned in places. Don’t worry if the jam has made its way through to the outside of the pudding a little – it will taste all the more delicious. ", "Put on a board or serving plate and cut into thick slices. Serve with lots of hot custard or cream."]}, "James Martin's Yorkshire pudding": {"ingredients": ["225g/8oz plain flour", "salt and freshly ground black pepper", "8 free-range eggs", "600ml/1 pint milk", "55g/2oz dripping"], "instructions": ["Place the flour and a little salt and freshly ground black pepper into a bowl.  Add the eggs, mixing in with a whisk, then gradually pour in the milk, mixing slowly to prevent lumps forming.", "Cover the bowl with clingfilm and chill in the fridge overnight.", "Preheat the oven to 220C/425F/Gas 7.  ", "Put a little of the dripping in the holes of three non-stick Yorkshire pudding tins. Place the tins in the oven until smoking hot. ", "Remove from the oven and quickly fill the moulds with the batter. Return to the oven and cook for 20-25 minutes.", "Turn the oven down to 190C/375F/Gas 5 and cook for a further 10 minutes to set the bottom of the puddings.  ", "Remove from the oven and serve."]}, "Jerk barbecue-style ribs with coleslaw": {"ingredients": ["500g/1lb 2oz pork ribs ", "1 tsp sea salt flakes", "1 tsp freshly ground black pepper ", "1 tsp allspice ", "1 tsp dried thyme ", "1 tsp garlic powder ", "1 tsp dried red chilli flakes ", "250g/9oz jerk barbecue sauce ", "25ml/1fl oz white rum ", "⅓ white cabbage, thinly sliced ", "⅓ red cabbage, thinly sliced ", "1 spring onion, thinly sliced ", "1 carrot, grated ", "1 tsp sea salt flakes ", "1 tsp freshly ground black pepper ", "1 tbsp runny honey ", "4 tbsp mayonnaise  "], "instructions": ["To make the ribs, season the pork with the salt, pepper, allspice, thyme, garlic powder and chilli flakes in a large bowl, rubbing to cover the meat completely. Pour over the jerk sauce and white rum and mix together. Cover and leave to marinate in the fridge for at least 1 hour. ", "Preheat the oven to 200C/180C Fan/Gas 6. Put the ribs in a roasting tin and roast for 45 minutes, or until cooked through. ", "To make the coleslaw, put the cabbages, spring onion and carrot in a bowl. Add the salt, pepper, honey and mayonnaise and mix together.", "Serve the ribs with the coleslaw on the side. "]}, "Jackfruit curry with lemon rice": {"ingredients": ["500g/1lb 2oz raw jackfruit (available in Asian supermarkets) or use 2 x 500g/1lb 2oz tins jackfruit, drained", "1½ tsp ground turmeric", "2 tbsp mustard oil", "½ tsp cumin seeds", "½ tsp panch phoran", "2 bay leaves", "2 dried red chillies", "3 onions, finely chopped", "2 tomatoes, finely chopped", "1 green chilli, chopped", "1 tsp red chilli powder", "½ tsp ground cumin", "1 tsp ground coriander", "1 tsp salt", "1 large potato, peeled, diced into 2.5cm/1in cubes and boiled (optional)", "½ tsp garam masala", "400g/14oz basmati rice", "3 tbsp vegetable or corn oil", "1 tbsp mustard seeds", "1 tbsp chana dal", "1 tsp white urid dal (optional)", "20 fresh curry leaves", "1 tsp ground turmeric", "1 tsp salt", "½ tsp sugar", "3 lemons, juice only"], "instructions": ["To make the jackfruit curry, peel the jackfruit, remove the seeds and cut into 2.5cm/1in cubes. Place the jackfruit in a saucepan with enough water to cover, add 1 teaspoon of turmeric and some salt and bring to the boil. Cook for 30–40 minutes, or until tender. Drain and set aside.", "Heat the mustard oil in a frying pan until hot and starting to smoke. Add the cumin seeds, panch phoron, bay leaves and dried red chillies and cook for around 30 seconds, or until crackling and popping. As soon as the chillies turn dark red, add the onions. Cook over a low heat for 12–15 minutes until the onions are translucent.", "Add the tomatoes, green chilli, remaining turmeric, chilli powder, cumin, coriander and 1 teaspoon of salt to the pan. Stir well and add the jackfruit and potato, if using. Cook over a low heat, covered, for 5–7 minutes and then add the garam masala. Cook for another minute and remove from the heat.", "Meanwhile, to make the lemon rice, wash the rice thoroughly in plenty of cold water. Leave to soak in more clean, cold water and then drain. Bring 1 litre/1¾ pints water to the boil in a saucepan and add the rice. Cook, uncovered, for 8–10 minutes, or until the grains are tender, then drain and set aside.", "Heat the oil in a large frying pan. Add the mustard seeds, chana dal and urid dal, if using, and cook until crackling. When the dal start to turn golden, add the curry leaves and turmeric and stir for 30 seconds. Splash a few tablespoons of water into the pan to stop the turmeric burning. Add the salt, sugar and lemon juice and stir to mix. Add the mixture to the cooked rice and toss gently to mix evenly. ", "Serve the lemon rice with the jackfruit curry. "]}, "Jumbo cheese and ham straws": {"ingredients": ["375g/13oz ready-rolled puff pastry", "3 slices Parma ham, cut into strips", "100g/3½oz gorgonzola, crumbled", "1 tbsp celery seeds", "1 free-range egg, beaten"], "instructions": ["Preheat the oven to 200C/400F/Gas 6.", "On a lightly floured work surface, roll out the puff pastry to a thin sheet. ", "Lay the strips of Parma ham onto one half of the pastry, then sprinkle over the gorgonzola. ", "Fold the pastry over the ham and gorgonzola, then roll out again to a thin sheet.", "Trim the edges of the filled pastry, brush all over with the beaten egg and sprinkle over the celery seeds. ", "Cut the filled pastry into 1cm/½in strips. ", "Twist the strips and transfer each to a baking tray. Press the ends of the pastry twists down to secure them to the tray and prevent them from unravelling. ", "Bake in the oven for 20-25 minutes, or until golden-brown. Set aside to cool slightly, then serve."]}, "Jerk chicken and flatbreads": {"ingredients": ["8 boneless chicken thighs, skin on (if possible)", "5 Scotch bonnet chillies, seeds removed ", "1 bunch spring onions, thinly sliced", "50g/1¾oz fresh coriander, roughly chopped", "1 lime, juice only", "2 tbsp palm sugar or soft light brown sugar", "1 tbsp soy sauce", "1 tbsp ground allspice", "5 garlic cloves, roughly chopped", "1 tbsp dark rum", "10–12 sprigs fresh thyme, leaves only", "½ tbsp ground cinnamon", "2cm/¾in fresh root ginger, roughly chopped", "splash fresh orange juice", "3 tbsp vegetable oil, or enough to make a smooth paste", "salt and freshly ground black pepper", "50g/1¾oz butter, softened, cut into pieces", "180ml/6fl oz whole milk", "300g/10½oz plain flour, plus extra for dusting", "vegetable oil, for frying"], "instructions": ["Put the jerk paste ingredients in a food processor and blend until smooth, using enough oil and orange juice to create a thick paste. Smother the chicken in the paste, cover and leave in the fridge for at least 2 hours, or preferably overnight.", "Preheat the oven to 180C/160C Fan/Gas 4.", "To make the flatbreads, beat the butter and milk together in a bowl. Slowly mix in the flour and ½ teaspoon salt until you have a dough consistency.", "Knead the dough on a lightly floured work surface until smooth. Wrap in cling film and chill in the fridge for 30 minutes.", "Meanwhile, place an ovenproof griddle pan over a high heat and cook the chicken on both sides until browned. Transfer the pan to the oven and bake for 40 minutes.  (You could also cook this on a hot barbecue. Just make sure the chicken is fully cooked before serving.)", "Place the rested dough on a lightly floured work surface and divide into quarters. Roll each quarter out to 3mm thick.", "Using a heavy-based frying pan or skillet, heat a little oil over a medium heat and add a flatbread. Cook for 1–2 minutes on each sides, or until you reach your desired level of crispness. Serve the chicken with the warm flatbreads."]}, "Jerusalem artichoke and black truffle risotto": {"ingredients": ["1kg/2lb 4oz Jerusalem artichokes, peeled and chopped into 1in/2cm pieces", "25g/1oz butter", "salt and freshly ground black pepper", "vegetable oil, for deep-frying", "4 Jerusalem artichokes, peeled and thinly sliced", "salt", "2 onions, cut into wedges", "1 garlic bulb", "2 tbsp olive oil", "20g/¾oz unsalted butter ", "250g/9oz arborio rice", "60ml/2fl oz dry white wine ", "500ml/18fl oz chicken stock", "1 black truffle ", "200ml/7fl oz artichoke purée, from recipe above", "150g/5½oz Parmesan (or alternative vegetarian hard cheese), finely grated ", "50g/2oz panko breadcrumbs", "salt and freshly ground black pepper", "2 baby red radicchio, halved", "2 baby yellow radicchio, halved", "1 head frisee, central yellow leaves removed", "2 tbsp olive oil", "3 tbsp walnut oil", "1 lemon, juice only", "50g/1¾oz walnut halves, toasted"], "instructions": ["For the caramelised artichokes and purée, bring a large pan of salted water to the boil and cook the artichokes for 10–15 minutes until cooked through. Drain and set aside. ", "Heat the butter in a frying pan and caramelise lightly, then add the artichokes and cook until golden-brown. ", "Place half the cooked Jerusalem artichokes in a blender and blitz until smooth. Season with salt and pepper and set aside. Keep the rest of the caramelised Jerusalem artichokes warm to serve", "To make the Jerusalem artichoke crisps, fill a deep-fat fryer or a large, deep, heavy-bottomed pan two-thirds full with the oil. Heat to 180C (a cube of bread should turn brown in one minute when dropped in.) CAUTION: Hot oil can be dangerous. Do not leave unattended. Fry the Jerusalem artichoke slices until crisp and golden-brown. Drain on kitchen paper and season with salt. Set aside.", "To make the risotto, preheat the oven to 200C/180C Fan/Gas 6. Place the onions in a roasting tin and drizzle with olive oil, wrap the garlic bulb in foil and place on the tray and roast for 30–40 minutes, until caramelised. Remove the roasted garlic from the skins and roughly chop the roasted onions. ", "Heat one tablespoon of the oil with the butter in a heavy bottomed saucepan, add the caramelised garlic and onions and cook for 2 minutes, then add the rice and mix well. Pour in the wine and allow to evaporate, then add the chicken stock and season with salt and pepper. Cook over a medium-low heat, stirring occasionally, for about 15 minutes, or until the rice is cooked. Finely grate a little black truffle into the cooked risotto and stir through. ", "Preheat a grill to high and place 2 tablespoons of the artichoke purée into the bottom of two ramekins, then spoon the risotto mixture on top. Top with the Parmesan and breadcrumbs and place under the grill until melted and bubbling. Top with more grated black truffle and the Jerusalem artichoke crisps and set aside. ", "To make the salad, place the leaves in a large bowl and drizzle with the olive oil . Heat a large griddle pan over a high heat and griddle the leaves for 2–3 minutes on each side until golden-brown. ", "Mix the walnut oil and lemon juice together and season with salt and pepper. Place the cooked leaves back in the large bowl, dress with the walnut vinaigrette and add the toasted walnut halves. ", "Serve the grilled risottos with the salad and caramelised artichokes on the side. "]}, "Jerk chicken with rice, peas and fried plantain": {"ingredients": ["25g/1oz butter", "2 spring onions, finely chopped", "1 garlic clove, peeled and crushed", "100ml/3½fl oz light coconut milk", "100g/3½oz basmati rice", "½ x 410g/14oz can kidney beans (do not drain)", "1 sprig fresh thyme", "½tsp salt", "310ml/11fl oz boiling water", "1 green bird's-eye chilli (or ½ Scotch bonnet pepper)", "2 tbsp mild jerk seasoning", "1 tbsp soy sauce", "2-3 tbsp tomato ketchup (or barbecue sauce)", "1 tbsp clear honey", "2 boneless chicken breasts, skin on", "2 tbsp vegetable oil", "30g/1½oz butter", "1-2 tbsp vegetable oil", "1 large ripe plantain, skin removed, cut on the diagonal into slices 2cm/¾in thick", "½ small red onion, peeled and finely chopped", "½-1 red chilli, finely chopped", "½ small ripe pineapple, peeled and finely chopped", "½ lime, juice only", "½-1 tbsp sugar", "2.5cm/1in piece fresh ginger, grated (optional)", "1 tbsp chopped fresh coriander", "1 tbsp chopped fresh mint"], "instructions": ["For the rice and peas, heat the butter in a saucepan and gently fry the spring onions and garlic. Don't allow them to brown.", "Add the coconut milk and bring to the boil.", "Stir in the rice, the kidney beans (along with the liquid in the tin), the thyme, salt and boiling water. Add the chilli, then stir, cover with a lid and bring back to the boil. ", "Once it has come to the boil, reduce the heat and simmer for 20-25 minutes, or until all the liquid is absorbed and the rice is tender. Fluff lightly with a fork to separate the grains, cover and leave to stand.", "For the jerk chicken, preheat the oven to 200C/400F/Gas 6. Place the jerk seasoning, soy sauce, tomato ketchup (or barbecue sauce) and honey into a bowl and mix to a paste.", "Use a sharp knife to make four or five deep cuts at an angle across the skin-side of the chicken breasts. ", "Brush half the jerk paste over the chicken with a pastry brush. ", "Brush a baking sheet with half the vegetable oil. Place the chicken breasts onto the baking sheet and drizzle with the remaining oil. Transfer to the oven and roast for 25 minutes. Brush with the remaining jerk paste during cooking.", "For the last five minutes of cooking, place the baking tray at the top of the oven, where the temperature is hottest, to brown the chicken. Check the chicken is cooked through - there should be no pink when you cut into it.", "For the plantain, heat the butter and oil in a pan over a medium heat, add the plantain and cook for 4-5 minutes on each side until golden-brown. Remove from the pan and drain on kitchen paper.", "For the salsa, place the onion, chilli, pineapple, lime juice, sugar and ginger, if using, into a pan and heat gently for 2-3 minutes. Remove from the heat, cool, then stir in the coriander and mint.", "To serve, place the chicken onto serving plates with some rice and peas, a few slices of plantain and a spoonful of salsa. Serve with Irish stout punch"]}, "Jamaican curried snapper with coconut and lime served with clap-hand roti": {"ingredients": ["1 tsp coriander seeds", "1 tsp cumin seeds", "1 tsp black mustard seeds", "1 tsp black peppercorns ", "½tsp cayenne pepper", "½tsp ground turmeric ", "3 tbsp sunflower oil", "40g/1½oz butter ", "1 large onion, finely chopped", "2 garlic cloves, crushed ", "5cm/2in piece fresh root ginger, peeled and finely grated", "1 tsp light brown soft sugar", "1 x 200g/7oz can chopped tomatoes ", "1 lime, juice only", "1 x 400ml/14fl oz can of coconut milk", "2 bay leaves", "4 x 225g/8oz pieces red snapper fillet", "salt and freshly ground black pepper ", "350g/12 oz basmati rice", "2 tbsp sunflower oil", "4 cloves", "4 green cardamom pods, cracked", "5cm/2in piece cinnamon stick", "bay leaf", "600ml/1 pint boiling water", "½ tsp salt", "225g/8oz plain flour ", "1 tsp baking powder", "1 tsp salt ", "40g/1½oz chilled butter", "vegetable oil or ghee for cooking"], "instructions": ["For the curried snapper, grind the whole spices into a powder using a pestle and mortar or mini food blender and mix with the cayenne pepper and turmeric.", "Heat the oil and butter in large shallow pan. Add the onion and fry gently until soft and just beginning to brown.", "Add the garlic, ginger, sugar and spice mix and cook for another 2-3 minutes.", "Add the tomatoes, lime juice, coconut milk, bay leaves and some salt and freshly ground black pepper and simmer gently for 10 minutes, stirring now and then, until slightly thickened.", "Add the snapper fillets, skin-side down, and spoon some of the sauce over them. Simmer uncovered for 10 minutes, carefully turning the fish over halfway through. Remove the bay leaves before serving.", "For the pilau, wash the rice in several changes of cold water until the water runs relatively clear. Cover with more cold water and leave to soak for seven minutes, then drain well.", "Heat the sunflower oil in a 20cm(8in) heavy-bottomed pan, add the cloves, cardamom pods, cinnamon stick and bay leaf and cook gently over a low heat for 2-3 minutes until they start to smell aromatic.", "Stir in the rice, add the boiling water and salt and quickly bring to the boil. Stir once, cover with a tight fitting lid and cook over a low heat for 12 minutes. ", "Uncover and fluff up the grains with a fork.", "For the roti, sift the flour, baking powder and salt into the bowl of a food processor. Add the butter and blend until the mixture looks like fine breadcrumbs.", "Transfer to a bowl and stir in five tablespoons of cold water to make a stiff, but soft, dough. Cover and leave in a warm place for 30 minutes.", "When ready, knead the dough on a lightly floured surface until smooth, then form into four balls. Flatten slightly and roll out into 23cm (9 inch) rounds about 5mm (0.2in) thick.", "Brush with the oil or ghee, fold in half, then in quarters, roll back into balls, and then roll out again.", "Heat a dry, heavy-based frying pan or flat griddle over a medium heat. ", "Brush each roti in turn with a little more oil or ghee, add a roti to the pan and cook for 3-4 minutes, turning frequently and brushing with oil each time you do.", "Remove from the pan, place in your palm and clap your hands together 3-4 times, taking care not to burn yourself (you may need to wear oven gloves for this).", "Wrap the roti in a tea towel and keep warm while you cook the rest.", "Serve the curried snapper with the pilau and roti."]}, "Jerk pork chops with rice and peas": {"ingredients": ["bunch spring onions, roughly chopped", "1–2 scotch bonnet chillies, depending on how hot you want it, seeds removed", "6 garlic cloves", "5cm/2in piece fresh root ginger, chopped", "large sprig thyme, leaves only", "2 tbsp red wine vinegar", "2 tbsp vegetable oil", "2 tbsp soft dark brown sugar", "1 tbsp allspice berries, crushed", "1 tsp ground cinnamon", "1 tsp ground smoked paprika", "freshly grated nutmeg", "1 tsp freshly ground black pepper ", "4 large pork chops (preferably a fatty, on-the-bone cut)", "1 tsp salt", "1 tbsp vegetable or coconut oil", "1 onion, finely chopped", "1 garlic clove, finely chopped", "1 sprig thyme", "400g/14oz long grain rice", "100ml/3½fl oz coconut cream", "200g/7oz frozen gungo peas "], "instructions": ["To make the marinade, put all the marinade ingredients into a food processor or blender, except the pork and salt, and blend until you have a fairly liquid paste. Put the pork chops in a bowl and season with the salt, then pour over the marinade. Cover and leave for at least a couple of hours, preferably overnight. If you are leaving the meat overnight, transfer it to the fridge.", "When you are ready to cook the chops, either heat your grill to medium-high or prepare a barbecue. Grill the chops on each side for 3–5 minutes on each side, depending on their thickness, then leave to rest for a few minutes.", "For the rice and peas, heat the oil in a large saucepan or casserole. Add the onion, and fry until soft and translucent. Add the garlic, thyme and rice and stir until the rice looks glossy. ", "Add 700ml/1¼ pint of water and the coconut cream, along with a generous amount of seasoning. Bring to the boil, cover, and reduce the heat to a low simmer. Cook for 10 minutes, then stir in the gungo peas. ", "Cook for a further 5 minutes, then remove from the heat and leave covered for another 10 minutes. Fluff up, and serve with the pork."]}, "Jack Monroe's veggie lasagne": {"ingredients": ["1 onion, roughly chopped (or handful frozen chopped onions)", "6 garlic cloves, finely chopped", "drizzle oil", "150g/5½oz dried green or red lentils, rinsed well under running water", "100ml/3½fl oz red wine or brewed black tea", "400g tin chopped tomatoes", "1 tsp dried herbs", "400g/14oz mushrooms, roughly chopped", "1 tbsp gravy granules", "100g/3½oz spinach, kale or other green vegetables, roughly chopped", "1 packet dried lasagne sheets (around 12 standard sheets), egg-free if required", "salt and freshly ground black pepper", "1 tbsp oil (or butter) ", "1 tbsp flour (plain or self-raising)", "½ tsp mustard (wholegrain, French, English)", "200ml/7fl oz milk (vegan, if required)", "1 tbsp breadcrumbs", "Cheddar cheese, for grating (optional)"], "instructions": ["Sweat the onion and garlic in a large saucepan or frying pan over a medium heat with a drizzle of oil and a pinch of salt until translucent. ", "Stir in the lentils, wine or tea, chopped tomatoes and herbs, then bring to a simmer.", "When the lentils have softened slightly, add the mushrooms, gravy granules and green vegetables. ", "To make the white sauce, warm the oil or melt the butter in a saucepan over a low heat. Add the flour and mustard, stirring well to form a paste. Add a splash of milk and stir vigorously with a wooden spoon or a whisk. Gradually add splashes of milk until all the liquid has been incorporated. Simmer for 10 minutes to thicken.", "Preheat the oven to 200C/180C Fan/Gas 6. ", "Spread a third of the mushroom sauce in the bottom of a deep baking dish. Cover with lasagne sheets. Spread over a layer of white sauce. Repeat the layering of ragù, pasta and sauce twice more until the ragù is used up. Finish with a layer of lasagne and white sauce on top. Sprinkle over the breadcrumbs and cheese, if using.", "Bake for 40 minutes until golden-brown and crisp around the edges. "]}, "Jollof Quorn pilau with salted cucumber ": {"ingredients": ["30g/1oz ground ginger ", "30g/1oz garlic granules", "45g/1½oz chilli flakes ", "20g/¾oz dried thyme ", "20g/¾oz ground cinnamon ", "15g/½oz ground nutmeg", "20g/¾oz ground coriander ", "1 tbsp salt ", "1 tbsp ground black pepper ", "500g/1lb 2oz basmati rice ", "5 tbsp olive oil ", "1 onion, diced ", "2 tsp salt ", "300g/10½oz Quorn pieces ", "4 tbsp jollof spice mix (see above)", "1 large cucumber, cut in half lengthways and thinly sliced on an angle ", "1 red onion, thinly sliced ", "20g/¾oz rock salt   "], "instructions": ["Start by making the jollof spice mix. Put all the spices into a large jar. We only need a little for this recipe – the rest can be covered and put away from another occasion. ", "For the pilau, soak the rice in a large bowl of cold water. ", "For the salted cucumber, put the cucumber, onion and salt into a bowl. Give it a stir and set aside. ", "To make the pilau, you need a large saucepan with a lid – the dish will be made in one pot. Put the pan on a high heat and add the oil. As soon as the oil is hot, add the onion and salt, and cook until the onion is soft. ", "Now add the Quorn and fry it with the onions for a few minutes. Add 4 tablespoons of the jollof spice mix and stir well. If the spices start to stick to the base of the pan, add a small splash of water. Cook the spices for at least 10 minutes on a low heat. ", "Drain the rice in a sieve, making sure you remove all the water. Add the rice to the pan of onions and Quorn, and stir it in so it gets coated with all the delicious spices. ", "Boil a full kettle of water and have it at the ready. Pour boiling water on to the rice and keep going until the water is a couple of centimetres above the rice. I like to be accurate and even have a rice ruler to make sure. ", "Boil on a high heat, making sure to stir all the time. As soon as all the water has been absorbed, pop a lid on the pan and leave the rice to steam for 15 minutes on the lowest hob setting. When the rice is ready, fluff it up, using a fork. ", "Drain the cucumber in a colander and rinse with a little water to get rid of any excess salt. The cucumber and onion should be soft. Serve alongside the rice. "]}, "Jerk chicken": {"ingredients": ["6 chicken breasts, or chicken thighs, bones removed", "225g/8oz onions, quartered", "1-1½ Scotch bonnet chillies according to taste, halved and seeded", "50g/2oz root ginger, peeled and chopped roughly  ", "½ tsp ground allspice", "small bunch fresh thyme, leaves only", "1 tsp freshly ground black pepper", "120ml/4fl oz white wine vinegar", "120ml/4fl oz dark soy sauce ", "rice and peas", "1 pineapple, peeled, cored and cut in wedges", "4 limes, 3 cut in wedges, 1 juice only"], "instructions": ["Put all the ingredients for the Jerk Sauce in a food processor and whiz until smooth.", "Place the chicken in a large shallow dish, pour over the sauce, cover and leave to marinate in the fridge overnight.", "On a hot griddle cook the chicken for 25-30 minutes, basting now and then with the leftover sauce. As it cooks, the thick sauce will go quite black in places, but don't worry, as it falls off it will leave behind a really well flavoured, crisp skin, with lovely moist tender meat underneath.", "Brush the pineapple lightly with oil and char grill until golden brown on all sides. Squeeze over the juice of one lime.", "Serve the jerk chicken with the rice and peas, pineapple and wedges of lime on the side. "]}, "Jerk spiced shoulder of goat": {"ingredients": ["1 shoulder of goat", "200g/7oz ready-made jerk seasoning  ", "oil, for frying", "100g/3½oz corn nuts (toasted corn)", "1.3 litres/2¼ pints stout", "100ml/3½fl oz coconut oil ", "1 litre/1¾ pint full-fat milk ", "250ml/9fl oz coconut milk", "500g/1lb 2oz polenta ", "250g/9oz unsalted butter ", "1 whole pineapple", "2 red chillies, sliced", "200ml/7fl oz white wine vinegar ", "100g/3½oz caster sugar", "salt and freshly ground black pepper ", "2 tbsp coriander cress, to serve", "200g/7oz Scotch bonnet jam or any chilli jam, to serve"], "instructions": ["Preheat the oven to 200C/180C Fan/Gas 6.", "Rub the goat with salt and the jerk seasoning. Wrap in kitchen foil and put directly on the oven shelf, with a baking tray underneath. Cook for 4½ hours. ", "Blend the corn nuts in a blender to crumbs. ", "Pour the stout into a pan and simmer until reduced to a sticky sauce.", "Meanwhile, heat the coconut oil in a saucepan. Pour in the milks and bring to almost boiling point. Pour in the polenta gradually, whisking constantly, until it is all incorporated and there are no lumps. Cook until it is thickened and cooked through – check the instructions on the packet for timings. ", "Transfer the polenta to food processor, blend and add the butter. You can also pass it through a sieve into a clean pan to ensure it is super smooth.", "Once the goat has been in the oven for 4.5 hours, take out and brush with the reduced stout. Turn the oven up to 240C/220C Fan/Gas 9 and put the goat back in for roughly 10–15 minutes.", "Place the pineapple on a baking tray and use a blowtorch to blacken all over. Once cool enough to handle, peel and dice the pineapple and place in a bowl. Add the sliced chilli. (Alternatively, peel and core the pineapple, cut  into wedges, and blacken on a preheated griddle pan, then cut into chunks.)", "Heat 300ml/10fl oz water, the vinegar and sugar in a pan until the sugar has dissolved. Pour over the pineapple.", "To serve, carve the goat and serve the polenta with the pineapple salsa. Garnish with the coriander cress, crushed corn nuts and chilli jam."]}, "James Martin's apple charlotte": {"ingredients": ["175g/6oz butter", "120g/4½oz caster sugar", "1kg/2¼lb cooking apples, peeled, cored and chopped", "4 tbsp smooth apricot jam", "12 slices white bread, crusts removed and discarded", "custard, to serve"], "instructions": ["Preheat the oven to 180C/160C Fan/Gas 4.", "In a large pan, melt 25g/1oz of the butter. Add the sugar and apples, then put the lid on and cook over a gentle heat for about 10 minutes, stirring occasionally.", "Remove the lid and cook for a further 5-10 minutes until the apples are broken down, but still with a few chunks for texture. Add the apricot jam and allow to cool.", "Meanwhile, melt the remaining butter in a saucepan. Cut the slices of bread in half, and then in half again into strips, saving one piece for the base of the pudding basin and one for the lid. Dip each piece of bread into the melted butter and line a large pudding basin.", "Once the pudding basin is fully lined, spoon in the apple purée and top with another round of bread that has been dipped in melted butter. Place in the oven for 30 minutes, or until golden brown on top.", "Remove from the oven and allow to cool slightly. Carefully turn out and serve immediately with custard."]}, "Jamaican chicken curry": {"ingredients": ["300g/10½oz chicken thighs, boneless", "1 tsp sea salt flakes ", "1 tsp freshly ground black pepper", "3 tbsp curry powder ", "4 tbsp vegetable oil", "1 brown onion, chopped", "4 garlic cloves, finely chopped", "2 spring onions, chopped ", "1 Scotch bonnet or other chilli, split in half", "1 large Maris Piper or other floury potato, peeled and chopped", "1 carrot, sliced", "225g/8oz long-grain rice, rinsed", "200ml/7fl oz coconut milk ", "¼ tsp sea salt flakes", "½ tsp coconut oil ", "½ tsp butter "], "instructions": ["To make the curry chicken, season the chicken with the salt, pepper and a tablespoon of curry powder in a large bowl, rubbing to cover the meat completely. Cover and marinate in the fridge for a few hours.", "Heat the oil in a saucepan over a medium heat and add the onion and garlic. Cook for 5–7 minutes, or until soft. Add the remaining curry powder and a little water, stir and cook for 3 minutes, or until browned. ", "Add the marinated chicken and brown for a few minutes, then add 500ml/18fl oz water and cook for a few more minutes. Add the spring onions, chilli, potato and carrot and cook for 20 minutes, or until the chicken is cooked through and the vegetables are tender. Take out the chilli before serving. ", "To make the coconut rice, place the rice in a small saucepan, add 250ml/9fl oz water and the coconut milk and place over a medium heat. Add the salt, coconut oil and butter. Reduce the heat to medium–low and cook for 20 minutes, or until the rice is tender. Drain if needed. ", "Serve the chicken curry with the coconut rice."]}, "James Martin's beef bourguignon": {"ingredients": ["2 tbsp plain flour", "salt and freshly ground black pepper", "1 kg/2lb 4oz blade of beef, cut into large cubes", "2 tbsp olive oil", "150g/5½oz pancetta, cut into small chunks", "2 shallots, finely chopped", "1 garlic clove, crushed", "50ml/2fl oz brandy", "500ml/18fl oz Burgundy red wine, or other red wine", "250ml/9fl oz beef stock", "1 bouquet garni made up of 2 bay leaves, 2 sprigs thyme, 2 sprigs flatleaf parsley", "25g/1oz butter", "150g/5½oz peeled baby shallots (or frozen button onions)", "200g/7oz chestnut mushrooms", "1kg/2lb 4oz floury potatoes, peeled and cut into chunks", "110g/4oz butter", "110ml/4fl oz full-fat milk", "1 tbsp olive oil", "25g/1oz butter", "100g/3½oz small pearl onions, peeled (or frozen button onions)", "100g/3½oz pancetta, cut into lardons", "150g/5½oz button mushrooms, stalks removed left whole", "½ bunch flatleaf parsley, finely chopped"], "instructions": ["For the beef bourguignon, sprinkle the flour onto a plate and season with salt and freshly ground black pepper. Dredge the beef in the seasoned flour and set aside.", "Heat one tablespoon of the oil in a large, lidded frying pan and fry the pancetta for 1-2 minutes, or until golden-brown. Add the beef and fry for a further 4-5 minutes, or until browned on each side. Add the shallots and garlic and fry for 4-5 minutes, or until just softened.", "Add the brandy and slowly tilt the pan towards the gas flame, or light it with a match. Let the flames flare up and then die down. (Caution: keep your face and hair away from the flames. Do not leave unattended.)", "Add the red wine and beef stock and bring to a simmer. Add the bouquet garni, then cover and cook on a low heat for two hours, or until the beef is tender and the sauce has thickened.", "Heat the butter and remaining oil in a frying pan and fry the baby shallots or onions for 4-5 minutes, or until just golden-brown.", "Add the browned onions and the chestnut mushrooms to the beef mixture and cook for a further 20 minutes. Season, to taste, with salt and freshly ground black pepper.", "Meanwhile, for the mash, cook the potatoes in a pan of boiling salted water for 12-15 minutes, or until the potatoes are tender.", "Drain and return to the pan, then place over the heat for one minute to drive off any excess moisture.", "Mash the potatoes well, then add the butter and milk and beat with a wooden spoon until smooth. Season, to taste, with salt and freshly ground black pepper.", "For the garnish, heat the olive oil and butter in a small frying pan. Add the onions and fry until brown. Add the pancetta and fry until browned and crisp. Tip in the mushrooms and continue frying until the mushrooms are softened and golden-brown. Finish with the chopped parsley and set aside until ready to serve.", "To serve, divide the mash equally among the serving plates and spoon the beef bourguignon alongside, with the garnish on top."]}, "Jerk pork tacos with corn and pineapple salsa": {"ingredients": ["8 tsp allspice berries, toasted", "1 cinnamon stick, broken into shards and toasted", "2 tsp coriander seeds, toasted", "4 tsp thyme leaves", "8 spring onions, roughly chopped", "½–1 Scotch bonnet chilli, seeds removed", "5 garlic cloves", "2 tsp grated nutmeg", "½ thumb-sized piece fresh root ginger, peeled and roughly chopped", "6 tbsp demerara sugar", "2 limes, juice only", "1 tsp soy sauce", "4 tsp vegetable oil", "salt and freshly ground black pepper", "jerk marinade (see above), 2 tbsp reserved", "4 tbsp tomato purée", "1.5kg-2kg/3lb 5oz-4lb 8oz pork shoulder, skinless and boneless, slashed a few times with a sharp knife", "2 oranges, juice only", "2 tbsp very dark maple syrup", "salt and freshly ground black pepper", "1 red onion, thinly sliced", "¼ Scotch bonnet chilli, seeds removed and finely diced", "2 radishes, thinly sliced", "3 limes, juice only", "pinch salt", "1 free-range egg yolk", "1 tsp Dijon mustard", "2 garlic cloves, grated", "115ml/3¾fl oz olive oil", "1 heaped tbsp jerk marinade (see above)", "1 lemon, juice only", "salt and freshly ground black pepper", "2 corncobs", "1 tbsp rapeseed oil", "2 spring onions, trimmed", "½ red pepper, finely diced", "100g/3½oz pineapple, chopped", "pinch cayenne pepper", "½ tbsp olive oil", "1 tsp lime juice", "1 tsp finely chopped fresh coriander leaves", "1 tsp finely snipped fresh chives", "1 tsp finely chopped fresh flatleaf parsley leaves", "sea salt flakes and freshly ground black pepper", "4x12cm/4½in corn tortillas, preferably blue", "micro coriander sprigs", "toasted peanuts, roughly chopped", "lime wedges"], "instructions": ["To make the marinade, place all the ingredients into a food processor and blend until it forms a fairly smooth paste. Season with salt and pepper. ", "To make the jerk pork, mix all but 2 heaped tablespoons of the jerk marinade and the tomato purée in a small bowl. Massage into the pork and, if possible, leave to marinate in the fridge overnight. Set aside the remaining 2 tablespoons of the marinade.", "When ready to cook the pork, preheat the oven to 150C/130C Fan/Gas 2. Place the pork in a deep baking dish, pour in the orange juice and cover with kitchen foil, ensuring that it is sealed at the edges of the dish but tents over and does not touch the pork. Roast for 5–7 hours, until the meat is falling apart. Check now and again to make sure the dish has not dried out and top up with orange juice if needed.", "Increase the oven to 200C/180C Fan/Gas Mark 6. Remove the foil, brush the pork with the maple syrup and continue to cook for another 30 minutes, until crispy and sticky. Remove any fatty bits of meat, then use a fork to pull the pork apart. Mix in another tablespoon of the jerk marinade and season with salt and pepper. Reserve the remaining marinade.", "To make the pickled onion, place all the ingredients in a bowl, mix well and leave to infuse. ", "To make the jerk aïoli, mix the egg yolk, mustard and garlic together in a bowl. Very gradually whisk in the oil, making sure each drop is fully incorporated before adding more. Add the jerk marinade and lemon juice and season with salt and pepper. Cover and keep in the fridge until ready to serve. ", "To make the salsa, heat a griddle pan until very hot. Rub the corncobs with the rapeseed oil and sprinkle with a little salt and pepper. Place the corn on the griddle pan and cook for 7 minutes, turning regularly to ensure that the charring is even. Place the corncobs in a bowl and cover for 5 minutes to allow the corn to tenderise.", "Meanwhile, place the spring onions on the hot griddle pan and cook for 3 minutes, or until charred, turning half way through. Finely chop the charred spring onion and add to a serving bowl, along with the red pepper and pineapple.", "Stand the corncobs on their ends and, using a knife, carefully slice down the ear to carve the kernels away. Add the kernels to the pepper mixture. Separate any connected kernels then add the cayenne pepper, olive oil and lime juice and mix well. Scatter over the herbs and season with salt and pepper. ", "To serve, heat the tortillas in a hot dry frying pan until warm and darkened spots appear on both sides. Add some of the jerk pork (any leftover pork can be used in another recipe) to each tortilla. Add the salsa, drizzle generously with the aïoli and top with the pickled onion, micro coriander sprigs and toasted peanuts. Serve with lime wedges."]}, "Jerusalem artichoke soup with white truffle oil": {"ingredients": ["30g/1oz unsalted butter", "70g/2½oz onions, sliced", "250ml/9fl oz chicken stock", "400g/14oz Jerusalem artichokes, peeled and cut into small pieces", "1 bouquet garni", "50g/1¾oz butter ", "few drops truffle oil ", "1 tbsp chopped fresh chives ", "salt and freshly ground black pepper"], "instructions": ["Melt the butter in a saucepan, add the onions and a pinch of salt and cook gently until soft, without colouring. Add 250ml/9fl oz water, the chicken stock, artichokes and bouquet garni and bring to the boil. Cook for about 30 minutes. Once the artichokes are soft, remove the bouquet garni. Transfer to a blender and blend to a fine purée, then pass through a fine sieve if needed.", "Whisk the butter into the soup, add a few drops of truffle oil, then season with salt and pepper.", "Serve with a sprinkling of fresh chives."]}, "Jansson’s temptation": {"ingredients": ["60g/2¼oz butter, plus extra for greasing", "2 large onions, approx. 400g/14oz, thinly sliced", "2 tsp sea salt flakes, plus ½ tsp (or 1 tsp fine sea salt, plus ¼ tsp)", "1.25kg/2lb 12oz potatoes, peeled and cut into narrow strips like French fries", "black pepper", "2 x 125g tins Swedish ansjovis (sprats), drained, see recipe tip  ", "300ml/½ pint full-fat milk ", "300ml/½ pint double cream", "2–3 tbsp breadcrumbs (optional)"], "instructions": ["Preheat the oven to 200C/180C Fan/Gas 6. Butter an ovenproof dish with a capacity of about 2.5 litres/4½ pints (mine measures 34 x 20 x 6cm/13½ x 8 x 2½in).", "Melt 3 tablespoons of the butter in a large frying pan (I use a non-stick one of 28cm/11in diameter). Add the onions, sprinkle with the ½ teaspoon of sea salt flakes (or ¼ teaspoon of fine sea salt) and stir for a few minutes over medium–high heat. Once they start to lose their raw look, turn the heat down to low and cook very gently for 15–20 minutes. Keep an eye on them, and stir regularly: they should be soft and pale gold. If they are beginning to catch, you can sprinkle a little water into the pan, or add more butter. Once they’re ready, use a bendy spatula to scrape them and their buttery juices into a bowl.", "Put a third of the potatoes into the buttered dish. Season with 1 teaspoon of sea salt flakes (or ½ teaspoon of fine sea salt) and a good grinding of pepper. Spread half the soft onions over the potatoes, followed by one tin of sprats. And now layer up again: the second third of potatoes, salt and pepper as before, followed by the remaining onions and the second tin of sprats. Top with the final third of potatoes.", "Mix together the milk and cream in a jug and pour it over the potatoes – it won’t cover them completely. Push down any that are poking up, just so that they’re lightly covered with the creamy milk, but don’t worry if they pop up again. Sprinkle over the breadcrumbs, if using, and dot over the remaining tablespoon of butter, then bake for 1 hour, but check at 45 minutes: push a fork in, and if it meets with no resistance, the potatoes are cooked. They’ll certainly be golden on top, but it’s essential they’re soft underneath.", "The gratin will stand for a while until needed, and tastes just as good, if not better, warm rather than hot."]}, "Jerk beef burgers": {"ingredients": ["2 spring onions, thinly sliced ", "1 brown onion, chopped", "8 garlic cloves, chopped", "1 tsp sea salt flakes", "1 tsp freshly ground black pepper", "5 pimento seeds or 1 tsp allspice ", "2–3 Scotch bonnet chillies, or 1 tsp dried red chilli flakes", "handful fresh thyme leaves", "1 tsp freshly grated nutmeg", "2 tbsp brown sugar ", "1 tsp browning or dark soy sauce ", "25ml/1fl oz apple cider vinegar or white wine vinegar", "750g/1lb 10oz lean beef mince", "125g/4½oz dried breadcrumbs", "6 square cheese slices", "sea salt flakes and freshly ground black pepper", "1 tbsp vegetable oil", "1 red onion, cut into rings", "6 large lettuce leaves ", "2 tomatoes, thickly sliced ", "6 brioche buns, split", "jerk barbecue sauce "], "instructions": ["To make the jerk marinade, put all the ingredients in a blender with 100ml/3½fl oz water. Blend well, then cover and place in the fridge if not using straightaway.", "To make the burgers, put the beef mince in a bowl and add half the jerk marinade (keep the rest in the fridge to use later). Season with salt and pepper. Add the breadcrumbs and mix to combine. Mould into six burger patties. Cover and leave to set in the fridge for 30 minutes. ", "Cook the burgers on a hot grill or griddle pan for 10 minutes on each side, or until cooked to your liking, adding a cheese slice on top of each burger 2 minutes before the end of the cooking time.", "To serve, heat the oil in a frying pan and fry the red onion rings in the oil until softened. Place a lettuce leaf and tomato slices on the base of each burger bun, add a cheese-topped burger, some red onion and a squeeze of jerk barbecue sauce. Top with the burger bun lid and serve. "]}, "Jam roly poly ": {"ingredients": ["250g/9oz self-raising flour, plus extra for dusting ", "50g/1¾oz unsalted butter, cold and cubed, plus extra for greasing ", "1 tbsp caster sugar ", "1 tsp vanilla bean paste ", "50g/1¾oz vegetarian suet ", "150ml/5fl oz cold full-fat milk (you may need less) ", "100g/3½oz fresh raspberries ", "1 orange, zest only ", "1 tsp caster sugar ", "50g/1¾oz caster sugar, for dusting ", "hot custard ", "fresh mixed berries"], "instructions": ["Preheat the oven to 180C/160C Fan/Gas 4. Place a deep baking tray in the bottom of the oven, fill half way with boiling water and close the oven. ", "Make a 30x40cm/12x16in sheet of foil and a piece of greaseproof paper the same size and put the paper on top of the foil. Grease the paper and set both aside. ", "Pour the flour into a bowl along with the butter, sugar and vanilla bean paste. Rub the butter in using the tips of your fingers until the mixture resembles breadcrumbs. You could do this using a food processor. ", "Add the suet and mix in well. Make a well in the centre and add 125ml/4fl oz of the milk to it. Using a cutlery knife, bring the dough together, then get your hands in to bring it into a ball. If the dough is looking dry, add the remaining milk. Dust a clean surface with some flour, and roll the dough into a 25cm/10in square. ", "To make the jam filling, crush the raspberries with the orange zest and mix well with the sugar. Spread the fruit onto the dough square, leaving a 1cm/½in border exposed. ", "Now roll like you would a Swiss roll. Pinch the ends to seal it really well. Pick it up and put into the centre of the paper, seam-side down. Bring the two paper edges to the top and roll to seal, leaving lots of space for the roly poly to grow. Seal the ends by rolling them up, then put the roly poly on a baking tray and place in the oven on a rack above the tray of water to steam and bake for 1 hour, topping up the water if needed. ", "As soon as it is baked, take out and leave to cool for 10 minutes in the paper foil parcel. Unwrap, pop onto a serving dish and sprinkle sugar over generously. Cut into slices while still warm and serve with hot custard and fresh berries."]}, "James Martin's coq au vin": {"ingredients": ["25g/1oz butter", "150g/5½oz shallots, peeled but left whole", "5 garlic cloves, crushed ", "150g/5½oz streaky bacon, cut thickly ", "sprig of fresh thyme or a good pinch of dried", "350g/12½oz button mushrooms", "500ml/16½fl oz good red wine", "500ml/16½fl oz chicken stock", "2 tbsp balsamic vinegar", "1 free range chicken, cut into 8 serving pieces, on the bone but skin removed (or 6 chicken thighs)", "small bunch flatleaf parsley, chopped", "salt and crushed black pepper"], "instructions": ["Heat a thick-bottomed casserole dish on the stove, add almost all the butter (reserving a knob of the butter) and the shallots. Cook until just browned; then stir in the garlic. Add the bacon and thyme and cook for 2-3 minutes.", "Add the mushrooms, turn up the heat and add the red wine, chicken stock and vinegar. Add the chicken pieces, bring the sauce to the boil and then simmer gently for about 25 minutes or until the chicken is tender and cooked through. For a thicker sauce, remove the chicken once it is cooked and keep warm. Cook the sauce over a high heat for a few minutes until the volume of liquid has reduced. Return the chicken back to the pan.", "Add the parsley, together with the reserved knob of butter. Season with salt and freshly ground black pepper and serve with a dressed green salad and olive oil mash or crusty bread."]}, "Jansson's frestelse (Jansson’s temptation)": {"ingredients": ["9-10 medium-sized potatoes ", "2 tbsp butter ", "1 onion, finely sliced ", "about 20 tinned sprat fillets  ", "salt and pepper ", "150ml/5fl oz single cream ", "150ml/5fl oz whole milk ", "1 tbsp dried breadcrumbs"], "instructions": ["Preheat the oven to around 200C/400F/Gas 6. ", "Peel the potatoes and chop them into small 0.5cm/¼in piece sticks - a bit thinner than French fries. ", "Melt the butter in a saucepan, add the onion and cook until soft. Take care not to burn the onion - it should be cooked, but not turning brown. ", "Add the potatoes and cook for a few minutes. ", "Layer half of the onion and potato mixture in the bottom of an ovenproof dish, then top with 10 sprat fillets evenly across. Season with salt and pepper. ", "Add another layer of onion and potato, then another 10 sprats on top. Pour the remaining sprat juice over the dish. ", "Pour two-thirds of the milk and cream over the dish, then sprinkle the breadcrumbs on top. Season again. ", "Bake for about 45 minutes, or until the potatoes are cooked. Halfway through the cooking time, add the rest of the milk and cream. If the dish is looking dry, you can add more milk - the aim is to get a creamy consistency. ", "Serve as part of a traditional Swedish smörgåsbord. "]}, "Jack Monroe's carrot cake overnight oats": {"ingredients": ["300g tin carrots, drained (180g drained weight)", "250ml/9fl oz milk, plus a little extra for serving (use a vegan milk alternative, if required)", "70g/2½oz porridge oats (gluten-free if required)", "70g/2½oz sultanas or mixed peel, or a mixture of the two (other dried fruit, such as cranberries or raisins also work well)", "½ tsp ground cinnamon", "2 tbsp sugar (caster, soft light or dark brown sugar)"], "instructions": ["Tip the carrots and milk into a blender and blitz until smooth.", "Stir in the remaining ingredients and pour into a large jar with a lid ", "Refrigerate for at least 8 hours, or overnight. Serve chilled. "]}, "Jamaican beef patties": {"ingredients": ["300g/10½oz plain flour, plus extra for dusting", "1½ tbsp Madras curry powder", "1½ tbsp ground turmeric", "pinch salt", "165g/5¾oz unsalted butter, chilled and diced", "1 large free-range egg, beaten", "2 tbsp rapeseed oil", "1 onion, finely diced", "4 large garlic cloves, crushed", "2 tsp Madras curry powder", "2½ tbsp snipped chives", "1½ tbsp chopped thyme leaves", "300g/10½oz lean beef mince", "125ml/4fl oz beef stock", "1 tsp molasses sugar (or dark brown sugar)", "1 tsp Scotch bonnet hot sauce or 1cm/½in piece Scotch bonnet chilli, finely chopped", "1 slice white or wholemeal bread, torn into tiny pieces", "salt and freshly ground black pepper", "2 tbsp rapeseed oil", "1 tbsp freshly squeezed orange juice", "2 tbsp lime juice", "1½ tsp honey", "1½ tsp caster sugar", "1½ tsp grated ginger", "salt and freshly ground black pepper", "8 heritage tomatoes, sliced ", "4 small oranges, peeled and sliced", "¼ red onion, finely sliced", "salt and freshly ground black pepper"], "instructions": ["For the pastry, sift together the flour, curry powder, turmeric and salt into the bowl of a food processor. Add the butter and pulse until the mixture looks like coarse sand. With the motor running, gradually add 4–6 tablespoons of ice cold water until the dough starts to come together. Add just enough water to bind the dough.", "Roll the dough into a ball and wrap in cling film. Leave to rest in the fridge for 30 minutes.  (You can also prepare the pastry for this recipe in advance, just bring it back to room temperature before rolling out).", "For the filling, heat the oil in a large saucepan, add the onion and a pinch of salt and cook for about 5–10 minutes until softened. Add the garlic, curry powder, chives and thyme (and if you are using fresh Scotch bonnet, add this now too). Leave to cook for another minute, until the aromas are released. Add the minced beef, breaking it up with a wooden spoon and allow it to brown all over for about 5 minutes.", "Add the stock, sugar and scotch bonnet hot sauce, bring to the boil and reduce the heat. Cover the pan with a lid and let the mixture simmer for about 10 minutes. Add the bread, return the lid to the pan and let the mixture continue to simmer for a further 10 minutes.  Remove the pan from the heat, season with salt and pepper and leave to cool.", "Preheat the oven to 220C/200 Fan/Gas 7. ", "Remove the pastry from the fridge and roll out with a flour-dusted rolling pin onto a large sheet of greaseproof paper to a thickness of about 3mm. Cut out six circles from the pastry, using a side plate as a guide for the sizing. ", "Divide the filling between the six circles, spooning the mixture on to one half of each pastry circle and leaving space around the edge to allow for sealing the pastry. Wet the edges of the pastry and fold the non-filled half of the pastry over the filled half and use a fork to press down all around the edges. ", "Place the patties on a baking tray, brush with the egg and bake for 20 minutes, or until the pastry is golden and cooked through. ", "For the ginger-citrus dressing, whisk together all the ingredients, ensuring they are well combined.  Season with salt and pepper.", "For the salad, arrange the tomato, orange and red onion on serving plates and pour over the dressing.  Sprinkle over a pinch of sea salt and pepper.  Leave to sit for 20 minutes at room temperature, to allow the flavours to develop.  ", "Serve the patties with the salad alongside."]}, "Jam doughnuts": {"ingredients": ["500g/1lb 2oz strong white flour", "50g/2oz caster sugar", "40g/1½oz unsalted butter", "2 free-range eggs", "2 x 7g sachets instant yeast", "10g/¼oz salt", "150ml/5fl oz warm milk", "130ml/4½fl oz water", "2 x jars strawberry jam"], "instructions": ["For the dough, place all ingredients into a large bowl holding back a quarter of the water.", "Stir with your hands until a dough is formed.", "Slowly add the remaining water and knead the dough in the bowl for four minutes.  (Alternatively, you could mix with a stand mixer fitted with a dough hook).", "Tip dough onto a lightly floured surface and knead well for 10 minutes, until the dough is smooth and elastic.", "Place the dough into a clean bowl, cover with a damp tea towel and leave to rise for an hour.", "Tip the dough out onto a very lightly floured surface, and knock it back by kneading it a few times.", "Divide the dough into 10 equal portions and shape each portion into a ball.", "Place all balls onto a floured baking tray and allow to rise for an hour.", "Preheat a deep fat fryer, filled with sunflower oil, to 180C/350F.", "Lower each doughnut into the fryer, cooking each side for about five minutes or until golden brown. Remove the doughnuts from the oil with a slotted spoon and immediately roll in caster sugar so that the hot fat makes the sugar stick to the sides.", "Set aside and leave to cool.", "When completely cool, using a small, sharp, knife make a cut into the side of the doughnut, reaching to the centre.  ", "Spoon some smooth or sieved strawberry jam into a piping bag, or piping syringe. ", "Pipe, or syringe, the jam generously inside."]}, "Jam fritters": {"ingredients": ["50g/2oz flour", "1 large free-range egg", "100ml/3½fl oz whole milk", "40ml/1½fl oz water", "8 slices bread, buttered", "3 tbsp raspberry jam, or to taste", "25g/1oz icing sugar ", "80g/3oz butter"], "instructions": ["Break the egg into the flour in a bowl and stir in the milk and water until a smooth batter is formed. Leave to stand for one hour.", "Spread the buttered slices of bread with raspberry jam, then sandwich two slices together, pressing down well. Repeat with the remaining slices of bread, then cut out squares or circles from the sandwiches using a pastry cutter.", "Melt the butter in a frying pan over a medium heat.", "Dip the sandwich shapes into the batter, then add to the pan to fry for 2-3 minutes each side, or until golden-brown all over. (You may have to do this in batches.)", "To serve, place onto a large serving plate and sprinkle with icing sugar."]}, "Jerk chicken and salad wraps": {"ingredients": ["1 spring onion, finely chopped", "1 tbsp finely chopped fresh thyme", "1 tsp ground allspice or ground pimento", "1 tsp honey", "1 tsp soy sauce", "1 tsp vegetable oil", "½ tsp roughly chopped fresh garlic", "2 tsp roughly chopped scotch bonnets", "4 boneless chicken thighs, skin on", "4 ready-made rotis", "olive oil, for rubbing", "salt and freshly ground black pepper", "½ iceberg lettuce, shredded", "large handful rocket ", "1 x 198g tin sweetcorn, drained", "½ fresh coconut, flesh grated", "15 cherry tomatoes, halved ", "200g/7oz tin kidney beans, drained", "75g/2½oz red cabbage, shredded", "75g/2½oz white cabbage, shredded", "75g/2½oz carrots, peeled and grated", "1 tbsp finely chopped flatleaf parsley", "4-5 tbsp mango purée", "100ml/3½fl oz mayonnaise"], "instructions": ["For the jerk chicken, put the spring onion, thyme, allspice, honey, soy sauce, vegetable oil, garlic and chilli in a food processor and blend into a thick paste. Season with salt and pepper. ", "Put the chicken thighs in a large bowl and rub generously with the paste. Cover and leave to marinate in the fridge overnight. ", "Preheat a barbecue or griddle pan to high and rub the chicken thighs with a little olive oil. Cook the thighs for 10–15 minutes on each side, until  golden-brown, slightly charred and cooked through. Rest the chicken for 2–3 minutes and cut into slices.", "Meanwhile mix together the salad ingredients in a bowl. Put the coleslaw ingredients in another bowl and mix to combine. In a third bowl, mix together the mango purée and mayonnaise. ", "Heat the rotis in a hot frying pan or on the barbecue, until they colour and puff up on both sides. ", "Place the warm rotis on four plates. Put some  salad and coleslaw in the middle of each roti. Top with the jerk chicken, drizzle with the mango sauce, wrap and eat. "]}, "Jollof rice with fried plantains": {"ingredients": ["1 tbsp olive or vegetable oil", "2 large onions, sliced", "2 x 400g/14oz cans plum tomatoes", "1 red pepper, diced", "4 tbsp tomato purée", "¼ tsp cayenne pepper or chilli powder", "1 tsp curry powder", "1 bay leaf", "sprig fresh thyme", "1 stock cube", "225g/8oz long-grain or basmati rice", "salt and freshly ground black pepper", "2 plantains, cut into slices and deep fried", "green leaf salad"], "instructions": ["For the rice, heat the oil in a large pan and cook the onions over a gentle heat until translucent. ", "Stir in the canned tomatoes, red pepper and tomato purée, then season with salt, freshly ground black pepper and the cayenne or chilli. Add the curry powder, bay leaf and thyme, then pour in 550ml/19fl oz of water and crumble in the stock cube.", "Cover and bring to the boil, then reduce the heat and simmer for 20–30 minutes.", "Rinse the rice well to remove excess starch, then add it to the tomato mixture. ", "Bring to the boil, then reduce the heat to low. Cover and simmer for 25–30 minutes, or until the rice is cooked.", "Season to taste with salt and freshly ground black pepper and serve the joffol with fried plantains and a crisp green salad."]}, "John Dory, mousseron mushrooms, broad beans and wild strawberries": {"ingredients": ["2 punnets wild strawberries ", "1-2 tbsp olive oil ", "1 puntarella (Italian chicory), finely chopped ", "salt and pepper ", "1.5kg/3lb 5oz small broad beans, podded ", "knob of butter, for frying", "drizzle olive oil, for frying ", "1 shallot, finely chopped ", "300g/10½oz mousseron mushrooms, cleaned ", "salt and pepper ", "4 John Dory fillets (about 200g/7oz each) ", "1 egg yolk, beaten ", "200g/7oz dried white breadcrumbs", "knob of butter, for frying", "drizzle olive oil, for frying", "1 sprig thyme ", "1 garlic clove, squashed and left whole", "salt and pepper ", "Lemon balm cress, lambs lettuce cress, bergamot cress, apple blossom cress, to garnish"], "instructions": ["For the dressing, reserve around 12 of the most beautiful strawberries and mash the others with a little olive oil. Add the chopped puntarella and mix.", "For the vegetables, blanch the beans in a small saucepan of boiling water for 2 minutes and then drain. When cool enough to handle, pop the beans out of their leathery skins by squeezing gently. Discard the skins.", "For the fish, brush the skinless side of each fillet with beaten egg. Cover the same side with breadcrumbs. ", "Heat some oil and butter in a large frying pan with the garlic and thyme (you may need to use two pans). Fry the fish with the breaded side down. Cook for 6 minutes over a low heat. Season the fish with salt and pepper. ", "Meanwhile, heat some butter and oil in a large saucepan. Gently fry the shallots for 2 minutes then add the mousseron mushrooms and broad beans. Cook for 4 minutes over a medium heat. Season with salt and pepper. ", "To serve, divide the vegetables between serving plates, gently lay the fish on top, and add the dressing to the side. Garnish with the reserved strawberries and the cresses."]}, "Jansson’s parsnip temptation": {"ingredients": ["1 x 30g tin anchovies in oil", "50g/1¾oz roasted garlic (see tip)", "2 medium parsnips, thinly sliced on mandoline ", "2 medium potatoes, thinly sliced on mandoline", "1 medium white onion, thinly sliced on mandoline", "500ml/18fl oz double cream "], "instructions": ["Preheat the oven to 150C/130C Fan/Gas 2.", "Tip the anchovies and garlic onto a board. Using the back of a knife, crush the two together to form a rough paste.  ", "In an ovenproof baking dish layer the vegetables – parsnips, potatoes, white onion and then a little of the anchovy and garlic paste. Repeat the layers until done. Pour over the cream.", "Bake for 45 minutes, or until the vegetables are tender and the top is golden-brown."]}, "Jaggery-caramelised walnuts": {"ingredients": ["100g/3½oz jaggery (available in Asian stores and some supermarkets), chopped or pounded into smallish pieces", "50g/2oz walnut halves, shells removed"], "instructions": ["Place the jaggery into a small pan and heat gently, stirring frequently, until melted and smooth.", "Add the walnut halves and stir to coat.", "Spread the walnut halves onto a sheet of baking paper or an oiled plate, working quickly before the jaggery starts to harden - if it does, return to the heat for a few seconds until melted again. Allow to cool completely, then break into pieces.", "When cold, store in an airtight container until needed. Serve as a snack or sprinkled over desserts and yoghurts."]}, "Japanese fried duck karaage on sushi rice": {"ingredients": ["2 x free-range duck legs, skin on, bone in", "1 tbsp fresh root ginger, grated", "2 garlic cloves, finely chopped", "4–6tbsp low sodium light soy sauce", "4–6tbsp Japanese Sake", "2tbsp caster sugar", "300g/10½oz sushi rice", "1 tbsp rice wine vinegar", "1 tbsp mirin", "1 tsp caster sugar", "100g/3½oz potato flour", "50g/1¾oz cornflour", "50g/1¾oz plain flour", "vegetable oil, for frying", "shiso leaves", "lime wedges", "black sesame seeds", "shichimi pepper flakes (togarashi shichimi)", "micro shisho leaves", "micro red amaranth"], "instructions": ["Preheat the oven to 200C/180C Fan/Gas 6 ", "To make the marinade, mix together the ginger, garlic, soy sauce and sake in a bowl.", "Score both sides of the duck in a criss-cross pattern, being careful not to cut through the meat. Add the duck to the marinade, cover and marinate in the fridge for at least 30 minutes.", "Drain any excess liquid from the duck, reserving the marinade.", "Heat at least 1cm/½ in of vegetable oil in a wok placed over a high heat. Fry the duck skin-side down for 5 minutes or until the skin is crisp.", "Place the duck flesh-side down into a roasting tin and finish in the oven for 30–35 minutes, or until well done, increasing the heat up to 220C/200C Fan/Gas 7 for the last 10 minutes. Allow to rest for 5 minutes.", "Wash the sushi rice well until the water runs clear. Fill a saucepan with 500ml/18fl oz water and bring to the boil. Place a bamboo steamer over the pan and add the rice. Put the on, turn the heat down to low and allow the rice steam cook for 15 minutes.", "Mix together the mirin, rice wine vinegar and sugar. Fluff up the rice with a fork, pour the dressing over and stir well. ", "Just before serving, coat the duck in the flour mix and shake off any excess. Coat in the flour once again.", "Preheat a deep-fat fryer to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Deep-fry the duck for 2 minutes or until golden brown.Drain the duck on a plate lined with a kitchen paper.", "To serve, line the plate with shiso leaves. Add a mound of steamed sushi rice. Place the duck legs on top and garnish with the black sesame seeds, shichimi pepper flakes and micro coriander leaves and lime wedges on the side. "]}, "Japanese marinated tuna with a ginger-spiced salad and ponzu dressing": {"ingredients": ["2 x 175g/6oz tuna steaks", "1 tbsp grated ginger", "2 tbsp dark soy sauce", "2 tbsp fish sauce", "2 tbsp mirin", "1 tbsp ground black pepper", "1 garlic clove, sliced", "1 lime, juice only", "vegetable oil, for frying", "50g/1¾oz bean sprouts", "1 carrot, julienned", "10 mangetout, thinly sliced", "50g/1¾oz mooli, thinly sliced", "2 tsp pickled ginger, finely chopped", "2 heads pak choi, halved", "1 tbsp sugar syrup (50/50 water and sugar dissolved)", "2 tsp dashi", "1 tbsp rice wine vinegar", "1 tbsp fish sauce", "½ lemon, juice only", "50ml/2fl oz dark soy sauce"], "instructions": ["Put the tuna steaks in a sealable bag, add all the marinade ingredients, except for the oil, and gently massage them into the tuna. Seal the bag, making sure there is no air trapped inside and place in the fridge to marinate for 6–8 hours. ", "To make the salad, bring a large pan of salted water to the boil and blanch the beansprouts for 2 minutes then refresh in cold water, drain and set aside. ", "Mix the remaining salad ingredients together in a bowl, add the beansprouts and set aside. ", "To make the dressing, mix the sugar syrup, dashi, rice wine vinegar, fish sauce, a tablespoon of lemon juice and the soy sauce together in a bowl. ", "Remove the tuna from the fridge at least 30 minutes before cooking. ", "Heat a griddle pan over a high heat and rub with a little vegetable oil. Remove the tuna from the bag and pat dry, then cook the tuna for 2 minutes on each side. Remove from the pan and thinly slice. ", "Blanch the pak choi in boiling water for 2 minutes and refresh under cold water. Drain and place on the griddle pan next to the tuna for 2 minutes each side. ", "Divide the salad between the plates and top each one with some of the tuna and the pak choi. Spoon the dressing over and serve. "]}, "Jerk chicken with pomegranate rice": {"ingredients": ["4 part-boned chicken breasts, skin on (substitute boneless chicken breasts if part-boned are not available)", "½ large onion, roughly chopped", "2 scotch bonnet chillies, roughly chopped", "40g/1½oz ginger, peeled and chopped roughly ", "125ml/4½fl oz malt vinegar", "½ tsp ground cloves", "½ tsp ground cinnamon", "¼ tsp ground nutmeg", "½ tsp cracked black pepper", "3 garlic cloves, roughly chopped", "2 tsp fresh thyme leaves ", "3 tbsp dark soy sauce ", "200g/7oz basmati rice", "1 pomegranate, seeds only", "1 small bunch chervil leaves", "4 tbsp chives, roughly chopped", "50g/2oz frisée lettuce, roughly chopped", "1 lime, zest and juice", "2 tbsp extra virgin olive oil", "salt and freshly ground black pepper", "2 limes, cut into wedges"], "instructions": ["For the jerk chicken, using a sharp knife, make deep cuts into the chicken flesh and place into a bowl.", "Place the remaining jerk chicken ingredients into a food processor and blend to a purée. Pour the marinade over the chicken and turn to coat all the pieces. Place into the fridge for at least four hours, but preferably overnight.", "Preheat the oven to 200C/400F/Gas 6.", "Heat a griddle pan until very hot. Add the chicken pieces and sear for 2-3 minutes on each side, then place onto a baking tray.", "Spoon the remaining marinade over the chicken and transfer to the oven to cook for 20-25 minutes, or until the chicken is completely cooked through.  Remove from the oven and leave to rest for 2-3 minutes before serving. ", "For the rice, place the rice into a saucepan with 400ml/14fl oz of cold water. Cover with a lid and place over a high heat. Bring to the boil, then reduce the heat and simmer very gently until all of the water has been absorbed and the rice is tender (about 10-15 minutes). Turn off the heat and leave to steam for 5-6 minutes.", "Place the rice into a bowl and add all the remaining rice ingredients and mix well to combine. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon a little of the rice onto each plate and top with a piece of jerk chicken. Garnish with a couple of wedges of lime."]}, "Jam shortbreads": {"ingredients": ["85g/3oz icing sugar", "170g/6oz plain flour", "55g/2oz cornflour", "30g/1oz ground almonds", "225g/8oz butter, and extra for greasing", "almond essence", "icing sugar for dusting", "raspberry or strawberry jam"], "instructions": ["Pre-heat the oven to 180C/350F/Gas 4. ", "Sift the icing sugar, flour and cornflour together into a bowl. Add the ground almonds. ", "Cut the butter into cubes and add it to the dry ingredients. Using your fingers, a mixer or food processor, rub or mix the butter in until there are no visible lumps of butter. Add the almond essence. ", "Turn the mixture out onto a lightly floured surface and knead a few times, just to form a smooth dough.", "Butter a muffin tin. Roll the dough into small balls and place them in the muffin cups, flattening the tops slightly with  your fingers. The dough should come about one-third of the way up the side of the pan. 6. Bake the shortbreads until they are a light gold colour, about 8-12 minutes. Remove them from the oven and,  using your selected tool, make a small indentation in the top of each biscuit.  ", "Let the shortbreads cool for a few minutes, then turn the mould over and tap it over the bench so that the shortbreads fall out. Be gentle, as they are fragile while  they are still warm.", "When all the shortbreads are baked and cooled, dust the tops with some icing sugar. Using a teaspoon, fill the indentation with jam or your chosen filling."]}, "Jerusalem artichoke soup with pheasant and crispy shallot": {"ingredients": ["1 tbsp olive oil", "3 Jerusalem artichokes, peeled and sliced", "½ shallot, peeled and sliced", "30ml/1fl oz white wine", "100ml/3½fl oz vegetable stock", "55ml/2fl oz double cream", "1 tbsp olive oil", "2 pheasant thighs", "2 tbsp olive oil", "½ shallot, peeled and finely sliced"], "instructions": ["Heat the oil in a medium saucepan. Add the artichokes and shallot and sauté for a few minutes, to soften.", "Add the white wine and heat for a further two minutes.", "Pour in the vegetable stock, bring to the boil and then reduce the heat and simmer gently for 10-15 minutes.", "Add the cream and then, using a hand blender, blend until smooth.", "Meanwhile, for the pheasant garnish, heat one tablespoon of olive oil in a separate pan. Add the pheasant thighs and cook for 4-5 minutes on each side, until crisp and thoroughly cooked.", "In a separate pan, add the sliced shallot and sauté for 3-4 minutes until golden and crisp.", "To serve, ladle the soup into a bowl. Place the pheasant thighs in the middle and scatter the crispy shallots on top."]}, "Jerk lamb with chilli butternut squash and apple salad": {"ingredients": ["2 tsp ground allspice", "½ tsp salt", "2 garlic cloves, crushed", "1 scotch bonnet chilli, seeds removed, finely chopped", "2 tsp chopped fresh thyme leaves", "2 tsp freshly ground black pepper", "½ tsp ground cinnamon", "¼ tsp cayenne pepper", "2 tbsp vegetable oil", "2 lamb fillets, fully trimmed", "4 tbsp vegetable oil", "2 spring onions, finely sliced", "½ tsp ground allspice", "2 green chillies, seeds removed, finely chopped", "1 sprig fresh thyme, leaves picked", "400g/14oz butternut squash, peeled, cut into 1cm/½in cubes", "1 tbsp caster sugar", "2 limes, juice only", "½ mango, peeled, finely chopped", "4 tbsp chopped fresh coriander", "4 tbsp fresh chopped fresh mint", "salt and freshly ground black pepper", "1 crisp apple, core removed, very finely sliced", "vegetable oil, for shallow frying", "salt", "1 tbsp English mustard", "1 tbsp white wine vinegar", "3 tbsp extra virgin olive oil", "1 frisée lettuce head, inner yellow leaves only, torn into small pieces", "1 pomegranate, seeds only", "2 tbsp coriander cress", "2 tbsp red amaranth cress"], "instructions": ["For the jerk lamb, blend all of the ingredients, except the lamb, in a food processor to a purée.", "Spread the mixture over the lamb until completely covered and set aside to marinate in the fridge for at least four hours. Remove the lamb from the fridge and allow to come to room temperature.", "Preheat the oven to 200C/400F/Gas 6.", "Heat an ovenproof frying pan until hot, add the lamb and fry on both sides until browned.", "Roast in the oven for 10-12 minutes (for medium), then remove and set aside to rest for 10 minutes.", "For the chilli butternut squash, heat the oil in a lidded frying pan and fry the spring onions, allspice, chillies and thyme for 1-2 minutes, or until the onion has just softened.", "Add the butternut squash and fry for 4-5 minutes, or until pale golden-brown.", "Cover the pan with a lid and continue to cook for 3-4 minutes, or until just softened.", "Add the sugar, lime juice and mango and cook for another 2-3 minutes, or until tender and slightly sticky.", "Stir in the coriander and mint and season with salt and freshly ground black pepper.", "For the apple salad, heat 1cm/½in of vegetable oil in a deep, heavy-based saucepan and heat until a small cube of bread sizzles and turns golden-brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "For the apple salad, fry the apple slices in the vegetable oil for 1-2 minutes, or until crisp. Remove with a slotted spoon, drain on kitchen paper and season with a little salt. (You may need to cook the apple slices in batches.)", "Whisk the mustard, vinegar and olive oil together in a bowl and season with salt and freshly ground black pepper.", "Mix the frisée leaves, pomegranate seeds and apple slices together in a bowl. Add some of the dressing and stir until well combined.", "To serve, spoon the butternut squash into the centre of the plate. Carve the lamb into thick slices and place a few slices across the pumpkin. Pile a little salad on top of the lamb and finish with a scattering of coriander and amaranth cress."]}, "Jump in the pan chicken": {"ingredients": ["3x140g/5oz chicken breasts, skinless", "2 tbsp plain flour", "sea salt and freshly ground black pepper", "2 tbsp olive oil", "1 tbsp butter", "1 garlic clove, crushed", "4 bay leaves", "125ml/4fl oz dry white wine", "2 tbsp capers, well-rinsed", "1 tbsp lemon juice", "2 tbsp flatleaf parsley"], "instructions": ["Place a frying pan on the heat and add the oil and butter.", "Place the chicken breasts between two sheets of cling film and bash flat.", "Season the flour with the sea salt and black pepper.", "Tear the chicken into pieces, then toss in the seasoned flour. Fry the chicken until cooked through. Remove from the heat.", "Add the garlic, bay leaves, capers and seasoning to the frying pan. Add the wine and return to the heat.", "Add the lemon juice and parsley leaves.", "Plate up the chicken, drizzle over the sauce and serve with rocket leaves and bread."]}, "Jamaican fruit salad (Matrimony de luxe)": {"ingredients": ["1 ripe mango, peeled, stone removed, flesh chopped", "2 kiwi fruit, peeled, cut into quarters, cores removed, flesh finely sliced", "2 ripe passionfruit, pulp and seeds", "1 large piece preserved stem ginger (from a jar), finely chopped", "1½ tbsp ginger syrup (from the jar of preserved stem ginger)", "½ lime, juice only", "double cream or ice cream, to serve"], "instructions": ["Mix the chopped mango, sliced kiwi and passion fruit pulp and seeds together in a large serving bowl.", "Sprinkle over the chopped stem ginger and mix well.", "Drizzle over the ginger syrup and squeeze over the lime juice. Mix carefully until the fruit is coated in the ginger and lime juice.", "To serve, spoon the matrimony de luxe into four shallow serving bowls. Drizzle over double cream or add a scoop of ice cream."]}, "Japanese seafood hotpot with miso vegetables ": {"ingredients": ["2 tbsp soy sauce ", "2 tbsp mirin", "2 tbsp lemon juice ", "1 tbsp Bonito flakes (available online)", "1 thumb-sized piece dried kelp (kombu) (available online)", "100g/3½oz raw prawns, shelled", "2 scallops", "150g/5½oz salmon fillet, skinned and cut into bite-sized pieces", "150g/5½oz halibut fillet, skinned and cut into bite-sized pieces", "150g/5½oz sea bass fillet, skinned and cut into bite-sized pieces", "150g/5½oz red mullet fillet, skinned and cut into bite-sized pieces ", "handful shiitake mushrooms ", "handful dried Wood Ear mushrooms ", "200g/7oz oyster mushrooms ", "1 Chinese cabbage, thinly sliced", "2 carrots, thinly sliced", "200g/7oz purple sprouting broccoli ", "bunch spring onions, thinly sliced", "40g/1½oz dried dulse seaweed (available online), rehydrated in water and drained, to garnish", "3 tbsp white miso paste ", "2–3 tbsp runny honey", "3 tbsp mirin", "3 tbsp sunflower oil", "1 lemon, juice only", "1 aubergine, diced  ", "1 head broccoli, broken into small florets ", "1 tbsp sesame seeds, to garnish"], "instructions": ["Make the dipping sauce by mixing together all the ingredients in a bowl. Cover and leave to steep for 24 hours.", "To make the miso vegetables, preheat the oven to 200C/180C Fan/Gas 6.", "Mix together the miso paste, honey, mirin, oil and lemon juice.", "Toss the aubergine and broccoli with the miso dressing in a large roasting tin. Roast for 30 minutes, then scatter over the sesame seeds.", "Meanwhile, to make the seafood hotpot, bring 400ml/14fl oz water to the boil and add the dried kelp. Set aside for an hour. ", "Put the seafood and vegetables in a serving dish. Strain the stock and pour it back into the pan. Bring back to the boil, drop in the seafood and vegetables, then remove from the heat and set aside for 15 minutes, or until the seafood is cooked through. Garnish with the seaweed.", "Serve the hotpot with the miso vegetables and dipping sauce. "]}, "John Dory with orange, fennel and caper salad": {"ingredients": ["400g/14oz new potatoes, cut into 2.5cm/1in slices, parboiled", "2 tbsp olive oil", "200g/7oz flour", "salt and freshly ground black pepper", "4 fillets John Dory", "50g/1¾oz butter", "½ lemon, juice only", "2 fennel bulbs, thinly sliced, (set aside in a bowl of ice cold water)", "2 oranges, peeled, segmented, juice reserved", "2 tsp baby capers, drained", "1 bunch chopped fresh dill", "3 tbsp olive oil", "1 tbsp white wine vinegar", "8 salted anchovies, cut in half lengthways", "4 tsp caper berries"], "instructions": ["Place the parboiled potatoes into a bowl with the olive oil and season, to taste, with salt and freshly ground black pepper. Stir until well combined.", "Heat a griddle pan over a medium heat until hot. Add the potatoes in batches and cook for four minutes on each side or until tender and golden-brown on both sides. Remove from the pan and keep warm. Repeat the process with the remaining batches of potatoes.", "Sprinkle the flour onto a plate. Season with salt and freshly ground black pepper. Dust the John Dory in the seasoned flour.", "Heat half the butter in a frying pan over a medium heat until foaming and fry the John Dory for three minutes on each side or until the fish is just cooked through (do this in batches if necessary). Add the remaining butter and the lemon juice to the pan and cook for another minute, basting the fish with the lemon and butter mixture.", "For the fennel and caper salad, drain the fennel thoroughly and place into a large bowl with the orange segments. Add the capers and one-third of the dill. Stir until well combined.", "To make the dressing, place the reserved juice from the oranges into a small bowl and add the oil, white wine vinegar and the remaining dill. Whisk until well combined. Drizzle the dressing over the fennel and orange salad and mix well.", "To serve, place one John Dory fillet onto each of four serving plates. Spoon the potatoes and orange and fennel salad alongside and garnish with the anchovy fillets and caper berries."]}, "John Dory with asaparagus, chilli and orange salad": {"ingredients": ["2 red onions, thinly sliced using a mandoline", "16 asparagus spears, woody parts removed, thinly sliced using a mandoline", "4 red chillies, halved, seeds removed, thinly sliced ", "1 orange", "4 x John Dory, about 500g/1lb 2oz each, gutted, filleted and skinned", "sea salt and freshly ground black pepper", "4 tbsp verjuice (available online)", "4 tbsp olive oil ", "1 tbsp Dijon mustard ", "1 tbsp honey ", "2 tbsp chopped coriander leaves", "2 tbsp chopped mint leaves"], "instructions": ["Preheat the grill to high.", "Put the red onion, asparagus and chillies in a large bowl. Finely grate the zest of the orange and add to the salad. Cut away the peel and pith (white part) from the orange and cut out the segments from between the membranes; add to the salad and toss to combine. ", "Season the fish all over with salt and pepper, then lay on the grill tray. Place under the grill for 3 minutes, then turn the fillets over and cook the other side for 3 minutes. ", "Meanwhile, for the dressing, whisk the ingredients together in a bowl and season with salt and pepper. Just before serving add half of the dressing to the asparagus salad and toss lightly. Taste and add more seasoning if required. ", "To serve, divide most of the salad between warmed plates. Place a grilled fish fillet on top, arrange the remaining salad on the fish and drizzle over the reserved dressing. Serve immediately. "]}, "January King cabbage with mussels and cockles": {"ingredients": ["200g/7oz soft herbs, such as chervil, basil and parsley", "200g/7oz mussels", "200g/7oz cockles", "1 tsp olive oil", "1 garlic clove, chopped\t\t", "100ml/3½fl oz white wine", "1 tbsp chopped fresh parsley", "30g/1oz unsalted butter, softened", "small handful watercress, blanched, refreshed and chopped", "small pinch curry powder", "2g finely chopped fresh fennel", "squeeze lemon juice", "pinch sea salt", "50g/1¾oz crème fraîche  ", "1 lime, juice only", "1 tbsp chopped fresh chives", "1 tbsp chopped fresh chervil", "½ January King cabbage ", "50g/1¾oz chicken fat", "squeeze lemon juice"], "instructions": ["Preheat the oven to 80C/80C Fan/Gas ¼. Lay the herbs in a single layer on a baking sheet and cook for 1 hour or until dry. Once dried, blend to a fine powder, and place in a flour duster.", "To cook the shellfish, wash the mussels and remove any beards. Wash the cockles. Discard any open shellfish that do not close when given a sharp tap.", "In a hot pan add the olive oil and cook the garlic for 1 minute. Add the rest of the ingredients and the cockles and mussels. Cover with a lid.", "Cook for 2 minutes, or until the cockles and mussels have opened. Discard any that do not open.", "Pour through a colander lined with a muslin cloth into a clean pan. Keep the liquid to make the sauce. Pick out the shellfish. Chop 10g of the largest mussels for the mussel butter. Set aside the remaining shellfish.", "For the mussel butter, mix all the ingredients in a bowl with the 10g of chopped mussels.", "For the mussel sauce, in a saucepan, heat the shellfish cooking liquid until reduced to 50ml. Add the crème fraîche and lime juice. Add almost all the mussel butter, keeping back a tablespoon for the cabbage. Blend the sauce with a stick blender. Stir in the chives and chervil.", "For the cabbage, preheat the oven to 200C/180C Fan/Gas 6. Cut the cabbage into 8 wedges. Heat the chicken fat in an ovenproof, non-stick frying pan until hot. Fry the cabbage until coloured. Roast in the oven for 5–7 minutes.", "Remove from the oven and baste with a spoonful of mussel butter, until golden. Season with lemon juice and salt.", "To serve, place the cabbage in the middle of the plate. Reheat the shellfish in a little sauce, and spoon them over the cabbage. Pour over the remaining sauce and dust with the green powder."]}, "Jerk Kiev with yam forestiere": {"ingredients": ["4 x 200g/7oz skinless chicken breasts with the wing bone retained", "1 tbsp olive oil", "2 tbsp jerk seasoning paste", "3 garlic cloves, crushed to a paste", "200g/7oz butter, softened", "2 shallots, finely diced", "2 tbsp finely chopped English parsley ", "½ lime, juice only", "salt and freshly ground black pepper", "vegetable oil, for deep frying", "4 free-range eggs, beaten", "110ml/4fl oz milk", "110g/4oz plain flour", "500g/1lb 2oz Japanese breadcrumbs", "500g/1lb 2oz yellow or white yams, peeled and cut into 1cm/½in chunks", "4 tbsp olive oil", "4 rashers smoked streaky bacon, roughly chopped ", "110g/4oz assorted wild mushrooms ", "salt and freshly ground black pepper"], "instructions": ["For the Kiev, make an incision in the top of each of the chicken breasts, then wiggle the knife around to create a pocket. Set aside.", "Heat the oil in a frying pan, add the jerk paste and garlic and cook for one minute or until fragrant. ", "Place the butter into a bowl, add the cooked jerk paste and garlic, along with the shallots, parsley and lime juice. Beat together until well combined. Season with salt and freshly ground black pepper, to taste.", "Place the mixture into a piping bag and pipe it into the pockets created in the chicken breasts.", "Place the chicken onto a plate, cover and place in the fridge for 30 minutes until the butter inside the chicken has just set.", "Heat the vegetable oil in a deep heavy-bottomed saucepan or deep fat fryer, to 190C/375F or until a breadcrumb sizzles and turns golden-brown when dropped in it (CAUTION: hot oil can be dangerous - do not leave unattended). Preheat the oven to 200C/390F/Gas 6.", "Beat the eggs and milk together in a small bowl; tip the flour onto one plate and the breadcrumbs onto another plate.", "Dip each chicken breast in the flour, then the egg mixture and finally in the breadcrumbs to coat entirely. ", "Place each breast in the deep fat fryer and cook for two minutes until golden-brown.", "Carefully remove the chicken from the fryer using a slotted spoon and drain on kitchen paper. Place onto a roasting tray and roast in the oven for 5-8 minutes, or until cooked through.", "For the yam forestière, bring a pan of salted water to the boil, add the chopped yams and simmer for 2-3 minutes, or until just tender.", "Drain the yams and set aside.", "Heat a frying pan, add the olive oil and yams and fry for 3-4 minutes, or until golden-brown on all sides.", "Heat a second frying pan until hot, add the bacon. Add the mushrooms and fry for 2-3 minutes, or until cooked through.", "Add the yams to the bacon and mushrooms and mix well to combine. Season with salt and freshly ground black pepper, to taste.", "To serve, spoon the yam mixture into the centre of each of four serving plates. Cut the Kiev in half on the diagonal and arrange on top. Serve."]}, "John Dory with courgette shoestring fries": {"ingredients": ["1 litre/1¾ pint vegetable oil, for deep-frying", "6 large courgettes", "500ml/18fl oz cold milk", "500g/1lb 2oz plain flour, seasoned with salt and pepper", "large pinch of fine salt", "extra virgin olive oil, for frying", "4 x John Dory fillets", "1 garlic clove, thinly sliced", "1 large handful of mixed herbs (mint, dill, basil and sage), finely chopped", "50ml/2fl oz fish stock", "70ml/2½fl oz lemon juice", "70ml/2½fl oz orange juice", "1 small handful of pink and green peppercorns", "1 small orange, cut into slices (optional)", "flaky sea salt and ground black pepper"], "instructions": ["For the zucchini shoestring fries, add the oil to a deep-fat fryer and heat to 190C (CAUTION: hot oil can be dangerous. Do not over-fill the pan or leave unattended).", "Meanwhile, slice the courgettes lengthways using a mandoline to create 4mm thick strips.", "Carefully dredge the courgette strings in the milk and shake around in the seasoned flour to lightly coat. ", "Lower the cougette fries into the deep-fat fryer and cook for 3 minutes or until light golden-brown. Remove using a slotted spoon and leave to drain on kitchen paper. Sprinkle with fine salt and keep warm until ready to serve.", "Meanwhile for the John Dory, drizzle a generous glug of olive oil into a large shallow pan with a lid. Carefully add the John Dory fillets skin-side down with the garlic and a pinch of salt and pepper. Scatter the chopped herbs over the fish and place the pan over a medium heat. When the pan starts to sizzle, add the stock, lemon juice and orange juice and cover with a lid. After no more than 4 minutes, remove the fillets and place on warm plates.", "Turn the heat up to high, add the peppercorns and boil the juices until the volume of liquid starts to reduce (about 2 minutes). Take off the heat and pour the reduced juices onto the John Dory fillets. Garnish each fillet with a slice of orange, if using, and serve with the courgette fries alongside.", "To serve, put the John Dory onto a serving plate and the fries on the side."]}, "Japanese tofu, aubergine and lotus root stew": {"ingredients": ["1 fresh lotus root (medium size, about 400g/14oz)", "500ml/18fl oz vegetable oil, plus a little extra for cooking ", "flaked sea salt", "shichimi togarashi (Japanese seven-spice seasoning) ", "4 tbsp rice flour (or cornflour if none available)", "2 pieces firm tofu, about 375g/13oz, cut into 2.5cm/1in squares", "2 tbsp sesame oil", "1 medium onion, finely chopped", "2 medium leeks, trimmed, washed and sliced into 1cm/½in diagonal slices", "2 Japanese aubergine, cut into 2cm/¾in discs (alternatively you can use a normal aubergine cut into 2cm/¾in discs)", "4 garlic cloves, finely grated", "2 tbsp finely grated ginger ", "150g/5½oz brown shimeji mushrooms, trimmed ", "2 tbsp heaped miso paste ", "4 tbsp mirin", "5 tbsp soy sauce"], "instructions": ["Bring a large pan of water to the boil. Peel the lotus root, cut off a third and set it aside. Add the rest of the lotus root to the pan. Turn the heat down and cook the root for 30 minutes at a very gentle simmer. Make sure you cook the root immediately after peeling as it will darken quickly. If preparing it in advance, put the lotus root in water with a little vinegar. Canned lotus root does not need preparing in this way and can be added straight to the stew.", "Finely slice the remaining third of the root on a mandolin or, using a very sharp knife, thinly to use it to make crisps.", "For the lotus root crisps, heat a wok or deep-fat fryer with 500ml/18fl oz of vegetable oil to about 180C/350F (CAUTION: hot oil can be dangerous. Do not leave unattended.) Cook the thinly sliced lotus root in two or three batches for about five minutes, or until golden-brown. Remove with a slotted spoon and drain on a plate lined with kitchen paper. Season with salt and shichimi togarashi and set aside. ", "Carefully pour the hot oil out of the wok you used for the crisps, reserving about five tablespoons in the bottom.", "Sprinkle the rice flour onto a plate and coat the tofu evenly. Heat the oil in the wok and fry the tofu in a couple of batches on a medium heat, turning until lightly golden-brown, slightly crispy and a little puffy - this will take about eight minutes.  Drain on a plate lined with kitchen paper to absorb the excess oil, and keep warm.", "Clean the wok and add the sesame oil and two tablespoons of fresh vegetable oil. Fry the onion for a few minutes, add the leeks and cook until soft and just slightly golden-brown. Add the sliced aubergine and cook for further six minutes, or until soft.", "Add the grated garlic and the grated ginger.  Fry again for a further couple of minutes stirring continuously, so that the garlic doesn't burn.", "Cut the cooked lotus root into 5mm slices and add it to the onion and aubergine mixture. Tip in the shimeji mushrooms, add two heaped tablespoons of miso paste and fry for a minute.  Add the mirin, soy sauce and 300ml/10fl oz of boiling water.", "Bring back to the boil, and carefully fold in the tofu.  Place into serving bowls and top with the lotus root crisps."]}, "Jam roly-poly for a crowd": {"ingredients": ["1.375/3lb 3oz self-raising flour ", "200g/7oz caster sugar", "550g/1lb 4oz shredded suet ", "about 700ml/1¼ pint water", "375g/13oz strawberry jam", "50ml/2fl oz whole milk"], "instructions": ["Preheat the oven to 200C/400F/Gas mark 6.", "Place the flour, sugar and suet into a bowl and mix thoroughly.", "Make a well in the centre of the mixture then gradually add enough water to make a soft dough. Knead lightly until smooth then divide into five portions of equal weight. ", "Turn each portion of dough onto a floured surface and roll out to an oblong about 1cm/½in thick. Spread about one fifth of the jam on the pastry leaving a 1cm/½in border.", "Roll up from the long side into a pinwheel, seal the ends well with a little water and place onto a greased baking sheet with the seal downwards. Brush with a little of the milk.", "Repeat with the remaining dough and jam, using another greased baking tray if necessary. Bake in the oven for 35-40 minutes, or until golden brown."]}, "Jersey Royal and Double Gloucester tortilla": {"ingredients": ["dash oil, for cooking", "1 onion, sliced ", "100g/3½oz crème fraîche, plus extra to serve", "salt and pepper", "2 tbsp chopped chives", "4 free-range duck eggs, whisked", "200g/7oz Jersey Royals, washed and scrubbed (not peeled), pre-cooked and halved", "1 bunch spring onions, sliced", "70g/2½oz Double Gloucester, grated", "30ml/1fl oz first press rapeseed oil ", "chive flowers"], "instructions": ["Heat a dash of oil in a frying pan and fry the onion until softened. ", "Whisk the crème fraîche and chives together in a bowl. Season with salt and black pepper and set aside.", "Put the duck eggs, potatoes, spring onions, cooked onions and cheese in a mixing bowl and season with salt and pepper. ", "Add the rapeseed oil to a non-stick frying pan, heat and then pour in the tortilla mixture.", "With a heatproof spatula, stir the egg mix until you see the egg starting to set, then leave to fully set on the presentation side and lightly colour - draw the sides in around the tortilla to make it as round as possible ", "Once the tortilla has set, use a cake stand to help turn the tortilla over: put the stand on top of the firm egg mixture, then turn at the same time so that the pan is upside down and the cake stand is upright. Lift the pan off and you should have a lovely looking tortilla. Slide the tortilla back into the pan and finish cooking for 2-4 minutes until cooked to your liking.", "To serve, cut the tortilla into portions and then serve with a spoon of the crème fraîche and chive flowers on top."]}, "Jerusalem artichoke soup served with a game burger and Jerusalem crisps": {"ingredients": ["2 tbsp vegetable oil", "1 large onion, chopped", "salt and pepper", "10-12 Jerusalem artichokes, peeled and placed in acidulated water", "750ml/1¼ pint chicken stock", "150ml/5½fl oz whipping cream", "½ lemon, juice only", "50ml/2fl oz olive oil, plus extra to serve", "1 onion, finely chopped", "200g/7oz game livers", "200g/7oz pork fat", "200g/7oz pork throat or belly", "200g/7oz mixed game – such as pheasant, mallard and grouse", "50g/1¾oz dried apricots ", "1-2 free-range eggs ", "200ml/7fl oz cream", "200g/7oz breadcrumbs", "vegetable oil, for deep frying", "4 Jerusalem artichokes, sliced lengthways on a mandolin, skin on ", "50g/1¾oz plain flour", "2 tbsp fresh chives, sliced into 2mm pieces, to garnish "], "instructions": ["For the Jerusalem artichoke soup, heat the vegetable oil in a large pan and gently fry the onion and a pinch of salt for 5-6 minutes, or until soft. ", "Meanwhile, cut the artichokes into roughly 2cm/1in cubes. Add them to the onions and fry for a further 3-4 minutes. Pour in the chicken stock and cream and cook over a medium heat until the vegetables are soft. Add the lemon juice and cook for five more minutes.", "Transfer the cooked vegetables to food processor and blend to a smooth soup. If it is too thick, add a little more stock or water. Taste to check the seasoning and add salt and pepper as required. Keep warm until ready to serve.", "For the game burger, heat a dash of the olive oil in a frying pan. Once hot, add the onion and gently fry until soft and translucent. Set aside to cool.", "Put the livers, pork fat, throat (or belly), game and apricots through a mincer, or very finely chop them (alternatively, ask your butcher to do this for you). Add one egg, the cream and breadcrumbs and mix together. If the mixture doesn’t bind together add the other egg. Season with salt and pepper or, to test the seasoning of the burger, roll a small amount into a mini burger, fry and taste.", "When satisfied with the seasoning, mould the meat into burgers and fry in a large frying pan with the olive oil for 2-3 minutes on each side.", "For the Jerusalem crisps, fill a deep-fat fryer with vegetable oil and preheat to 180C/350F. (CAUTION: hot can be dangerous. Do not leave unattended.)", "Dry the slices of artichokes with a clean tea towel and dust with flour. Fry for two minutes, or until crisp and golden-brown. ", "Serve the Jerusalem artichoke soup with the game burger in the centre of each of the bowls, garnished with the artichoke crisps, chives and a swirl of olive oil. "]}, "Jhatpat Pulao": {"ingredients": ["Chicken Â½ kg", "Rice Â½ kg", "Onion 1 sliced", "Green cardamom 4", "Bay leaf 2", "Mixed whole spices 1 tbsp", "Fennel seeds ground 1 tbsp", "Coriander seeds ground 1 tbsp", "Green chilies 4", "Yogurt 1 cup", "Ginger garlic 1 tbsp", "Mace grinded Â¼ tsp", "Nutmeg grinded Â¼ tsp", "Cardamom ground Â½ tsp", "Kewra water 1 tbsp", "Salt 1 tsp + 1 tsp", "Yellow color pinch", "White cumin seeds 1 tsp"], "instructions": ["Heat ½ cup oil in rice cooker, add onion sliced, fry till light golden, add whole spices, cumin seeds, bay leaf, ginger garlic paste, 1 tsp salt and chicken, fry well, add yogurt, keep frying, add grinded fennel seeds, coriander seeds, cover and cook till chicken done", "Now add green chilies, rice, water, 1 tsp salt, cover and cook till rise nearly done", "Lastly add grinded mace, nutmeg, choti elaichi, kewra water and mix with yellow color and leave it on dum."]}, "Jalapeno Chicken Burger": {"ingredients": ["Ground chicken 300gm", "Finely chopped onion 1/2 cup", "Finely shredded cheddar cheese 1/2 cup", "Minced fresh cilantro 1/4 cup", "Garlic, minced 2 cloves", "Finely chopped jalapeno pepper 2 tsp", "Ground cumin 1 tsp", "Paprika 1 tsp", "Salt to taste", "Freshly ground pepper 1 tsp", "Burger buns 2", "Sliced onion for topping", "Lettuce leaves for topping", "Tomato for topping", "Mayonnaise for topping"], "instructions": ["<strongMethod:</strong<br /In a large bowl, combine the patty ingredients", "mix lightly but thoroughly", "Shape into 2 thick patties and cook them well, Serve on buns with toppings as desired."]}, "Jheenga Masala": {"ingredients": ["Prawns 300 g", "Onions 2", "Garlic Paste 2 tbsp", "Green Chilies 4-5", "Yogurt 250 g", "Cumin Seeds 1 tsp", "Crushed Red Chilies 2 tbsp", "Curry Leaves 8-10", "Tamarind Â½ cup", "Oil 4 tbsp", "Salt to taste", "Tomatoes 4", "Garlic Paste 1 tbsp"], "instructions": ["Fry prawns with salt and garlic paste and set aside"]}, "JALFREZI MACARONI RECIPE": {"ingredients": ["Chicken Boneless 300g", "Capsicum (cut in large cubes) Â 1 large", "Tomato (cut in large cubes) Â 3 pcs", "Onion (cut in large cubes) Â 1 large", "Cooking Oil Â Â 8 tbsp", "Yogurt (whipped) Â Â Â½ cup", "Tomato paste Â Â Â½ cup", "Salt Â 1 tbsp", "Ginger (sliced) Â 2 tbsp", "Green Chili (sliced) Â 3 pcs", "And Bake Parlor Macaroni, Bake Parlor Masala Mix Sachet (inside the pack)"], "instructions": ["Boil pasta in salted boiling water for 5-7 minutes or till tender", "Rinse under cold running water", "Drain", "Add 1 tbsp of oil to pasta, mix and set aside."]}, "Juicy Hamburger": {"ingredients": ["Ground beef 300 gm", "Onion (chopped) 1", "Chili sauce 2 tbsp", "Worcestershire sauce 2 tsp", "Mustard paste 2 tsp", "Red chili flakes 1 tsp", "Salt to taste", "Cheese slices 4", "Burger buns (toasted) 4", "Lettuce leaves (sliced) as required", "Tomato (sliced) 1", "Onion (sliced) 1", "Ketchup as required", "Oil as required"], "instructions": ["<strongMethod:</strong<br /In a bowl add onion, chili sauce, Worcestershire sauce, mustard paste, ground beef and salt", "Mix well and make patties out of it", "Then heat oil and fry from both sides", "Now assemble the buns by placing lettuce leaves, tomato, onion, cheese slice and patti", "Serve with ketchup."]}, "Japanese Beef And Rice Bowl Roast": {"ingredients": ["Onions 2", "Beef stock 1 cup", "Sliced beef (boiled) 300gm", "Vinegar 1/4 cup", "Soy sauce 2 tbsp", "Sugar 1 tbsp", "Grated ginger 1 tsp", "Salt to taste", "Cooked rice 2 cups", "Poached egg 1", "Sliced green onions as required", "Pickled ginger as required", "Japanese 7 spices blend 1tsp"], "instructions": ["<strongMethod:</strong<br /Sauté onions and beef in a pan then add Beef stock, soy sauce, and sugar in a medium saucepan and bring to a simmer over medium heat", "Cook, stirring occasionally, until onion is softened, and liquid has reduced down to an intensely flavored broth, about 5 minutes", "Stir in ginger and simmer for 1 minute longer", "Adjust seasoning with salt and sugar to taste", "Add rice in a bowl and top with beef and sauce mixture", "Garnish each bowl with a poached egg, sliced green onions, pickled ginger and Japanese spices", "Serve immediately."]}, "Jheengay Aur Aalu Ka Pulao": {"ingredients": ["Prawns Â½ kg", "Potatoes Â½ kg", "Rice Â½ kg", "Back Cumin Seeds 2 tsp", "Salt 1 tsp", "Ginger Garlic 2 tsp", "Bay Leaves 2", "Black Peppercorns 1 tsp", "Finely Chopped Ginger 2 tbsp", "Green Chilies Paste 2 tbsp", "Green Fenugreek 250 gms", "Fennel Seeds 1 tbsp", "Star Anise 1tbsp", "Onions 2", "Oil Â½ cup", "Water 2 cup"], "instructions": ["<strongMethod:</strong<br /• In a pan, heat oil add onion and fry.<br /• Add ginger garlic, black cumin seeds, bay leaves, black pepper corns, potatoes, prawns and fry.<br /• Now add water, green chili paste and let it simmer for 20 minutes.<br /• Add rice and cook.<br /• When dries water add green fenugreek, finely chopped ginger, star anise and let it simmer."]}, "Jahangiri Rice": {"ingredients": ["Boiled Rice 2 cups", "Oil Â¼ cup", "Onion chopped Â¼ cup", "Tomato chopped Â¼ cup", "Green chilies chopped 1 tbsp", "Ginger garlic paste 1 tbsp", "Chicken boneless julienned 1 cup", "Spinach boiled Â½ cup", "Salt as required", "Chicken powder 1 tsp", "Red chili crushed 1 tsp", "White pepper 1 tsp"], "instructions": ["<strongMETHOD:</strong<br /Heat oil in wok add onion sauté well", "Add ginger garlic paste cook well", "Add green chilies and tomato cook well", "Add chicken fry well", "Add salt, crushed red chili, chicken powder and white pepper with boiled spinach cook till oil separate", "Add boiled rice mix well and cook for 1 to 2 minute."]}, "Jheenga Fry": {"ingredients": ["Prawns 10-12", "Garlic paste 1 tbsp", "Green chili paste 1 tbsp", "Lemon juice 2tbsp", "Salt as required", "White pepper Â½ tsp", "Eggs 2", "Flour 1 tbsp", "Corn flour 2-3tbsp", "Baking powder 1 pinch", "Oil as required", "Salt as required", "Sesame seeds 1 tbsp"], "instructions": ["<strongMETHOD:</strong<br /In mixing bowl add prawns and all the spices mix it and leave for 1 hour in fridge", "For batter add egg, flour, corn flour, baking powder and salt in blender ,add oil from top and blend it once batter becomes thick take out in bowl and add sesame seeds in batter, now heat oil in a wok, dip shrimps in a batter and cook in hot oil", "Serve hot."]}, "Japanese Katsu Chicken": {"ingredients": ["Boneless Breast 2 flatten", "Salt 1 /2 tsp", "Red Chili Garlic Sauce 1 tbsp", "Soya Sauce 1 tbsp", "Black pepper crushed Â½ tsp", "Flour 2 tbps", "Egg 1", "Imported bread crumb as required", "Ingredients for sauce", "Mayyaonise 4 tbsp mix with 2 tbsp lemon juice"], "instructions": ["Flatten boneless breast marinate with salt, pepper, spread in flour."]}, "Josheelay Boti Kabab": {"ingredients": ["Boneless undercut Â½ kg", "Salt 1 tsp", "Raw papaya 2 tbsp", "Ginger garlic 2 tbsp", "Sambal oleak 2 tbsp", "Vinegar 1 tbsp", "Hung curd 4 tbsp", "Allspice Â½ tsp", "Lemon juice 1 tbsp", "Oil Â¼ cup", "boti tikka masala 2 tbsp"], "instructions": ["Marinate boties with all the ingredients for 1 hour, put on skewers and bbq over hot charcoal, serve with chatni."]}, "Jammy Soft-Boiled Eggs": {"ingredients": ["4–8 large eggs"], "instructions": ["Bring a large saucepan of water to a boil over medium-high heat. Using a slotted spoon, carefully lower eggs into water one at a time. Cook 6½ minutes, adjusting heat to maintain a gentle boil. Transfer eggs to a bowl of ice water and chill until just slightly warm, about 2 minutes.", "Gently crack eggs all over and peel, starting from the wider end, which contains the air pocket.", "Do Ahead: Eggs can be cooked and peeled 3 days ahead. Store airtight in the refrigerator."]}, "Jerk Turkey Shepherd’s Pie": {"ingredients": ["1 cup Diamond Crystal or ½ cup plus 4½ tsp. Morton kosher salt", "1 large onion, chopped", "6 garlic cloves", "A small handful of thyme sprigs", "3 bay leaves", "2 3\" cinnamon sticks", "1¼ cups jerk marinade (about 10 oz.; such as Walkerswood)", "1 12–14-lb. turkey, neck and giblets removed", "1¼ cups all-purpose flour", "¾ tsp. Diamond Crystal or ½ tsp. Morton kosher salt", "6 Tbsp. vegetable shortening, cut into pieces, chilled", "3 Tbsp. chilled unsalted butter, cut into pieces", "3 lb. Yukon Gold or russet potatoes, peeled", "Kosher salt", "1 cup half-and-half", "½ cup (1 stick) unsalted butter", "2 tsp. finely chopped thyme", "1½ tsp. finely grated lime zest", "Freshly ground black pepper", "2 Scotch bonnet chiles, pierced a few times with a paring knife", "1 tsp. ground cloves", "1¼ cups jerk seasoning (about 10 oz.; such as Walkerswood)", "1 cup (2 sticks) unsalted butter", "1–1½ cups low-sodium chicken broth or water", "All-purpose flour (for surface)", "½ tsp. smoked paprika", "Half-and-half (for brushing)", "Hibiscus Cranberry Sauce (for serving)"], "instructions": ["Bring salt and 4 cups water to a boil in a 16-qt. pot, stirring until salt is dissolved. Remove from heat and add onion, garlic, thyme, bay leaves, cinnamon sticks, and marinade to pot. Chill, uncovered, until cold, about 1 hour.", "Add 6 quarts cold water to pot and carefully lower in turkey. Place a heavy plate on top of turkey to keep it submerged. Cover and chill at least 12 hours and up to 1 day. (The turkey will be more moist and flavorful if you let it brine the full time.)", "Mix flour and salt in a large bowl with a fork to combine. Add shortening and butter and toss to evenly coat. Working quickly and aggressively and using a pastry blender or 2 forks, press into dry ingredients until pieces of butter and shortening are about the size of a dime (the idea is to smash the butter into the flour, creating some pieces that are flat and thin and some that are large and chunky). Drizzle 1 Tbsp. ice water over mixture and stir in with a fork. Knead dough gently in bowl until it comes together (it will still look a little dry).", "Turn dough out onto a work surface and knead 1 or 2 more times, pressing to incorporate shaggy edges. Press into a disk about 1\" thick and wrap in plastic. Chill at least 1 hour.", "Do ahead: Dough can be made 1 day ahead. Keep chilled, or freeze up to 1 month.", "Place potatoes in a large saucepan and pour in water to cover by at least 2\"; season generously with salt. Bring to a boil, reduce heat, and simmer until a paring knife easily slides through flesh, 25–35 minutes. Drain potatoes and let cool slightly.", "Meanwhile, bring half-and-half and butter to a simmer in a small saucepan over medium heat.", "Cut potatoes in half lengthwise. Pass potatoes through a ricer or food mill into a large bowl. (If you don’t have either, gently mash in bowl with a potato masher.) Pour in half-and-half mixture and mix well. Stir in thyme and lime zest; season with pepper. Set aside.", "Do ahead: Potatoes (without thyme, zest, and pepper) can be made 1 day ahead. Let cool; cover and chill.", "Line a large rimmed baking sheet with 3 layers of foil; set a wire rack inside. Remove turkey from brine and transfer to a plastic cutting board; discard brine. Pat turkey dry inside and out. Place, breast side up, on rack and tuck wings underneath. Let sit at room temperature 1 hour.", "Purée chiles, cloves, and 1 cup jerk seasoning in a blender. Transfer chile mixture to a small bowl; set aside.", "Melt butter in a small saucepan over medium heat. Add remaining ¼ cup jerk seasoning and whisk until smooth, about 1 minute. Remove from heat.", "Place a rack in middle of oven; preheat to 450°. Wearing disposable food-grade gloves to protect your hands from chiles, gently separate skin from breast meat starting at neck. Spread chile mixture over breast meat underneath skin, then smear remaining chile mixture all over outside of turkey. Tie legs together with kitchen twine and pour 1 cup broth into baking sheet.", "Roast turkey, rotating pan halfway through, until skin is mostly golden brown, about 30 minutes. Reduce oven temperature to 300° and continue to roast, brushing with jerk butter every 30 minutes and adding ½ cup broth to pan if liquid evaporates, until an instant-read thermometer inserted into the thickest part of breast registers 150°, 65–85 minutes longer. Skin should be deep golden brown and lacquered-looking. Transfer turkey to a cutting board; let rest 2 hours. Pour juices from pan into a heatproof measuring glass.", "Let dough sit at room temperature 5 minutes. Roll out on a lightly floured surface to a 10½\"–12\" round (1½\"–2\" wider than pan). Place dough in a 9\"-diameter pie pan or 10\" cast-iron skillet; lift up edges, allowing dough to slump down into skillet. Trim any overhang and crimp edges as desired. Chill until ready to use.", "Carve turkey and shred meat. Measure out 5 cups (a mix of light and dark meat is good); save remaining meat for other uses. Arrange meat evenly in dough. Pour just enough pan juices over turkey to moisten (be careful not to oversaturate or your crust may be soggy). Mound potatoes over meat. Using a wet butter knife or spoon, spread to edges, covering meat completely. Using a fork, create decorative ridges in potatoes and sprinkle with paprika. Brush dough with half-and-half. Bake pie until crust is golden brown, 35–45 minutes. Let cool 15 minutes. Serve with cranberry sauce."]}, "Jalapeño Cornbread with Dairy-Free Cilantro-Lime Honey Butter": {"ingredients": ["1 ¼ cup cornmeal", "1 cup all-purpose flour", "½ cup raw turbinado sugar", "1 Tbsp baking powder", "½ tsp baking soda", "½ tsp salt", "5 Tbsp Country Crock® Plant Butter with Avocado Oil - plus a little extra", "15 oz canned full fat coconut milk", "2 eggs", "¾ cup jalapeños, ribs and seeds removed", "½ cup cilantro, leaves and tender stems", "4 Tbsp Country Crock® Plant Butter with Avocado Oil", "1 Tbsp honey", "1 lime, zested then juiced"], "instructions": ["Make the cornbread:: Preheat your oven to 400°F. Grease a 12” cast iron skillet with the room temperature Country Crock® Plant Butter.", "In a large bowl, combine the dry ingredients. Then add the wet ingredients. Stir until just combined, then fold in the chopped jalapeños. Pour batter into the greased skillet.", "Bake 20 - 25 minutes until edges are beginning to brown and a toothpick or cake tester inserted into the center comes out clean. Let cool for at least 15 minutes before slicing.", "Make the dairy-free cilantro honey butter:: While the cornbread is baking, make the honey butter by mashing Country Crock® Plant Butter, honey, cilantro leaves, half of the lime zest, and half the lime juice together with the back of a wooden spoon until thoroughly combined.", "Serve your dish:: Garnish the cornbread with the remaining lime zest. Serve your warm cornbread with a generous slathering of the cilantro-lime honey butter, plus extra on the side."]}, "Jamaican Beef Patties": {"ingredients": ["3 cups (420 g) all-purpose flour", "2 tsp. kosher salt", "1 tsp. ground turmeric", "1 cup (2 sticks) unsalted butter, cut into 1\" pieces, frozen", "1 large egg, lightly beaten", "1 tsp. distilled white vinegar", "2 Tbsp. vegetable oil", "1 lb. ground beef chuck (20% fat)", "1 small onion, finely chopped", "1 medium Scotch bonnet or habanero chile, stemmed, finely chopped", "6 garlic cloves, finely chopped", "1 Tbsp. ground allspice", "1½ tsp. freshly ground black pepper", "½ tsp. smoked paprika", "2 cups homemade beef stock or low-sodium beef broth", "Kosher salt", "4 scallions, light green and whites parts finely chopped", "1 Tbsp. thyme, finely chopped", "All-purpose flour (for dusting)", "1 large egg", "A 5\"-diameter round pastry cutter"], "instructions": ["Pulse flour, salt, and turmeric in a food processor to combine. Add butter and pulse until mixture is crumbly and pieces of butter are evenly distributed.", "Whisk egg, vinegar, and ¾ cup ice-cold water in a small bowl to combine. Add to flour mixture and pulse until a smooth ball of dough forms. Wrap dough and chill until cold, about 1 hour.", "Heat oil in a large saucepan over medium until hot. Cook beef, breaking up into pieces, until nearly cooked through, about 5 minutes. Transfer to a plate using a slotted spoon, leaving fat behind. Add onion, chile, and garlic to pan and cook, stirring often, until vegetables are softened, about 3 minutes.", "Add allspice, pepper, and paprika. Stir to combine, reduce heat to low, and return beef to pan. Add stock and use a wooden spoon to scrape up any browned bits on bottom of pan. Bring to a simmer and cook, stirring occasionally, until about half of the liquid has evaporated, 5–8 minutes. Season with salt and remove from heat. Add scallions and thyme. Taste and adjust seasoning. Let cool slightly.", "Place a rack in lower third of oven; preheat to 375°. Lightly flour a rolling pin. Cut dough in half on a lightly floured work surface. Working with one half at a time, roll dough to ⅛\" thick. Cut dough with 5\" round pastry cutter. Place 2 Tbsp. meat filling on one-half of each round, leaving a ½\" border. Brush edges of dough with water. Fold dough over filling to make a half-moon shape. Press edges with the tines of a fork to seal. Repeat process with remaining dough and filling, rerolling scraps as needed. Transfer patties to a parchment-lined baking sheet.", "Whisk egg and 2 Tbsp. water in a small bowl to combine. Brush top of each patty with egg wash.", "Bake patties until golden brown and cooked through, 20–25 minutes. Let sit 5 minutes before serving.", "Do Ahead: Patties can be baked up to 5 days ahead. Cover and chill, or freeze up to 1 month. Reheat in a 375° oven."]}, "Jerk-Spiced Duck": {"ingredients": ["2 5–5½-lb. ducks", "Kosher salt", "2 Tbsp. allspice berries", "2 whole nutmegs", "16 habanero chiles, stems removed", "1 cup soy sauce", "½ cup spiced rum", "½ cup unseasoned rice vinegar", "4 tsp. sugar", "2 2\" pieces ginger, scrubbed, crushed", "Hoisin sauce, small flour tortillas, sliced Napa cabbage, sliced scallions, julienned peeled ginger, sliced serrano chiles, mint sprigs, cilantro sprigs, and lime wedges (for serving)", "A razor blade and a spice mill or mortar and pestle"], "instructions": ["Lightly score skin of both ducks using a clean razor blade, cutting most of the way through skin and fat but not into flesh below (a very sharp, thin knife will also work). Season ducks generously with salt and place each one in a large resealable plastic bag.", "Finely grind allspice in spice mill or with mortar and pestle and place in a blender. Finely grate nutmeg into blender. Add habanero chiles (we recommend keeping the seeds in as the ducks’ fat will keep it from absorbing too much heat), soy sauce, rum, vinegar, and sugar. Purée until smooth. Divide marinade between bags; add a piece of ginger to each. Seal bags, pressing out air, and work marinade around to coat ducks. Chill, breast side down, 12 hours.", "Preheat oven to 450°. Remove ducks from marinade and place, breast side up, on a wire rack set inside a foil-lined rimmed baking sheet (don’t worry about any marinade that may be inside ducks; it will add flavor as they cook). Roast ducks just until beginning to brown, 10–12 minutes. Reduce oven temperature to 250° and continue to roast until ducks are very dark brown, leg joints wiggle freely when flexed, and an instant-read thermometer inserted into the thickest part of breasts registers 195°, 4½–5 hours. Let rest 30 minutes before shredding.", "To serve, pile meat on hoisin-slicked tortillas and top with cabbage, scallions, ginger, serrano chiles, mint, and cilantro as desired; squeeze lime wedges over."]}, "Japanese Fruit Sandwiches": {"ingredients": ["1 cup chilled heavy cream", "1 Tbsp. plus 2 tsp. sugar", "A pinch of kosher salt", "8 slices Japanese milk bread", "1 kiwi, peeled, cut crosswise into 4 ½\"-thick rounds", "8 small strawberries, trimmed, halved lengthwise", "1 yellow peach or ¼ mango, cut into 1½\"x½\" strips"], "instructions": ["Using an electric mixer on medium-high speed, beat cream, sugar, and salt in a medium bowl until stiff peaks form, about 3 minutes. (You need it to be on the firm side. If cream is underwhipped, it will be more difficult to slice the sandwiches.)", "Neatly remove crusts from bread with a serrated knife. Arrange bread on a clean work surface. Evenly spread ¼ cup whipped cream on each slice of bread with an offset spatula or butter knife. Place 1 kiwi round on top of whipped cream in the center of 4 bread slices. Arrange strawberry slices in corners of bread slices, orienting them so that the pointed end is tucked right into the corner. Place 4 peach strips in the gaps between kiwi and strawberries.", "Place a second slice of bread, cream side down, over to close sandwich. Smooth outside edges of whipped cream, adding a little if necessary to fill gaps. Wrap each sandwich in plastic wrap and chill at least 3 hours and up to 8.", "Using serrated knife, cut each sandwich into 4 triangles and serve."]}, "Jalapeño-Honeydew Hot Sauce": {"ingredients": [".35 lbs. honeydew meat (about 1 cup)", ".35 lbs. of organic green seeded jalapeños (about 5 jalapeños)", "1 seeded habanero pepper", "¼ cup distilled white vinegar", "2 small or 1 large garlic clove(s)", "1 tsp. brown sugar", "¼ tsp. salt"], "instructions": ["Chop the honeydew, jalapeño, and habanero peppers finely. Add to the Vitamix Personal Cup Adaptor along with white vinegar, garlic, brown sugar, and salt.  Attach the Personal Cup Adaptor to the Vitamix Adaptor Base. Blend all ingredients in the Vitamix E310  Blender for one minute starting on level 1 and slowly progressing to level 4 until pureed. Allow the bubbles in the mixture to settle completely (this may take about an hour) before transferring into an airtight mason jar. Keep in a warm, dark place for 4–7 days, stirring daily until the sauce starts bubbling and begins to ferment.", "Once the hot sauce has fermented, pour it back into the Vitamix Personal Cup Adaptor and blend on level 1, increasing to level 2 for about 30 seconds until frothy. Strain through a sieve into a medium saucepan, and discard any remaining pulp. Bring to a boil and cook for 15–20 minutes or until the sauce reduces by half. Cool completely before serving.", "Drizzle over fruit salsa or your favorite taco, and enjoy!"]}, "Jammy Eggs with Paprika Aioli": {"ingredients": ["4 large eggs, room temperature", "2 jarred peperoncini in brine", "4 sprigs parsley", "¼ cup mayonnaise", "½ tsp. smoked or hot paprika", "Kosher salt"], "instructions": ["Bring a small saucepan of water to a boil.", "Using a spider or slotted spoon, carefully lower 4 eggs into boiling water. Set timer for 8 minutes. Fill a large bowl with ice water.", "While eggs are boiling, do the rest of your prep: Drain 2 peperoncini. Remove stems and finely chop. Transfer to a small bowl.", "Pick off leaves from 4 parsley sprigs and finely chop (discard stems). Add to bowl with peperoncini.", "Mix ¼ cup mayonnaise and ½ tsp. paprika in another small bowl.", "When timer goes off, remove eggs from boiling water with spider or slotted spoon and transfer to ice bath. Let cool 5 minutes.", "Peel eggs, slice in half lengthwise, then sprinkle yolks with salt. Transfer eggs to a plate.", "Top each egg with paprika mayo and peperoncini salsa."]}, "Jammy Egg Flatbreads": {"ingredients": ["4 large eggs", "¼ cup feta", "2 tablespoons fresh lemon juice", "2 tablespoons extra-virgin olive oil", "Kosher salt, freshly ground pepper", "Palmful of chopped tender herbs (such as tarragon and/or chives)", "2 warm flatbreads or slices of toast"], "instructions": ["Carefully lower eggs into a small saucepan of gently boiling water; cook 7 minutes. Transfer to a bowl of ice water and let sit until cool enough to handle; drain. Peel eggs; tear into large pieces.", "Coarsely mash feta in a small bowl with lemon juice and oil; season with salt and pepper. Gently fold in eggs.", "Spoon egg mixture over flatbreads and top with herbs."]}, "Jam Toaster Tarts": {"ingredients": ["1 tablespoon granulated sugar", "1½ teaspoons kosher salt", "3¼ cups all-purpose flour, plus more for surface", "¾ cup (1½ sticks) unsalted butter, cut into pieces", "3 large eggs", "½ cup homemade or store-bought jam (any flavor)", "Raw sugar (for sprinkling)"], "instructions": ["Pulse granulated sugar, salt, and 3¼ cups flour in a food processor just to combine. Add butter and pulse until largest pieces are pea-size. Whisk 2 eggs and 4 Tbsp. ice water in a small bowl to blend, then drizzle into flour mixture and pulse just until mixture begins to clump together.", "Turn out dough onto a work surface and knead, adding more ice water by the tablespoonful if needed, until dough comes together into a cohesive mass. Pat into a 6x4\" rectangle and wrap tightly in plastic; chill at least 1 hour.", "Preheat oven to 350°. Roll out dough on a lightly floured surface to an 18x14\" rectangle, about ¼\" thick. Trim away jagged edges to make a 16x12\" rectangle. Using a bench scraper or pastry wheel, cut dough into sixteen 4x3\" rectangles.", "Beat remaining egg in a small bowl with 1 Tbsp. water. Brush a ½\" strip of egg wash around edges of half of the rectangles. Dollop 1 Tbsp. jam in the center of each egg-washed rectangle. Top with remaining rectangles and gently press down around edges; crimp with a fork to seal. Brush tops of tarts with egg wash and sprinkle with raw sugar. Cut three slashes on a diagonal across the top of each tart. Transfer to a parchment-lined baking sheet and bake until crust is golden brown, 20–25 minutes. Transfer to a wire rack and let cool at least 1 hour before serving.", "Do Ahead: Dough can be made 1 day ahead. Keep chilled."]}, "Juicy Pan-Seared Pork Chops with Citrus Dressing": {"ingredients": ["4 ½-inch-thick bone-in pork chops (about 2 pounds), patted dry with paper towels", "Kosher salt, freshly ground pepper", "1 teaspoon sugar, divided", "2 tablespoons plus ¼ cup olive oil", "1 lemon, zest finely grated (about 1 teaspoon), plus 2 tablespoons fresh juice", "1 garlic clove, finely grated", "1 tablespoon Dijon mustard", "1 teaspoon dried oregano", "¼ teaspoon ground cumin", "½ bunch cilantro leaves with tender stems, chopped"], "instructions": ["Season pork chops generously on one side with salt and pepper. Turn and season other side generously, then sprinkle evenly with ½ tsp. sugar.", "Heat 2 Tbsp. oil in a large skillet over medium-high. Carefully add chops sugared side down and cook, gently shaking skillet occasionally but not disturbing pork, until underside is caramelized and chops are deeply browned all over, about 5 minutes. Turn chops and reduce heat to low. Cook just until second side is opaque, about 1 minute. Remove skillet from heat and let chops rest 10 minutes in skillet (the cooking will carry over and finish the chops while they rest).", "Meanwhile, whisk lemon zest and juice, garlic, mustard, oregano, cumin, and remaining ½ tsp. sugar in a medium bowl. Slowly whisk in remaining ¼ cup oil until emulsified. Fold in cilantro and season with salt and lots of pepper.", "Spoon half of dressing onto a platter. Transfer chops to platter, then whisk any juices that have accumulated in skillet into remaining dressing. Spoon dressing over top of pork. Swipe pork through dressing as you eat."]}, "Jalapeño-Cilantro Yogurt Sauce": {"ingredients": ["1 jalapeño, seeds removed, chopped", "1 cup plain whole-milk Greek yogurt", "½ cup cilantro leaves with tender stems", "2 tablespoons mint leaves", "1 tablespoon (or more) fresh lime juice", "¼ teaspoon ground cumin", "Kosher salt"], "instructions": ["Purée jalapeño, yogurt, cilantro, mint, lime juice, cumin, and a generous pinch of salt in a blender until very smooth. Taste and season with salt and more lime juice, if desired."]}, "Juicy Lucy Sliders": {"ingredients": ["8 slices melting cheese (such as American, Swiss, Muenster, cheddar, or pepper Jack), cut in half", "2 pounds ground beef chuck (20% fat)", "Kosher salt, freshly ground pepper", "Vegetable oil (for pan)", "16 potato slider rolls, toasted", "Ketchup, mayonnaise, shredded iceberg lettuce, sliced tomato, and dill pickle slices (for serving)"], "instructions": ["Tear halved slices of cheese into even smaller pieces so that you have 16 roughly equal portions. Divide beef into 16 balls (about ¼ cup each). With 1 ball in the palm of your hand, use your pointer finger of the opposite hand to create a small indentation in the center. Fill hole with 1 portion of cheese. Pinch meat around cheese so that it’s in the middle, then gently flatten patty to about ¾\" thick. Check to make sure that no cheese is peeking out (if you see any, fix it). Season both sides of patty with salt and pepper. Repeat with remaining beef and cheese.", "Heat a cast-iron griddle or large heavy skillet over medium until very hot, about 2 minutes. Lightly coat with oil. Working in batches (we recommend testing the first patty before cooking the whole batch because cooking time may vary depending on your stove and pan—cut it in half to see if cheese has melted), cook patties, undisturbed, until outer edges are brown, about 3 minutes. Turn and cook until browned and burger is medium-rare, 2–3 minutes.", "Serve sliders on rolls with ketchup, mayonnaise, lettuce, tomatoes, and pickles.", "Do Ahead: Patties can be formed 6 hours ahead; cover with plastic and chill."]}, "Jamón-Wrapped Spanish Tortilla with Piquillo Relish": {"ingredients": ["4 jarred piquillo peppers, finely chopped", "½ cup green olives, pitted, finely chopped", "1 teaspoon sherry vinegar", "2 cups olive oil, divided", "Kosher salt", "12 ounces fingerling potatoes (about 10)", "3 garlic cloves, thinly sliced", "1 large white onion, thinly sliced", "5 large eggs, room temperature, beaten to blend", "5 slices thin Serrano ham"], "instructions": ["Mix peppers, olives, vinegar, and ⅓ cup oil in a small bowl; season with salt. Let relish sit at room temperature 1 hour to let flavors meld.", "Meanwhile, heat potatoes and remaining 1⅔ cups oil in a small saucepan over medium until oil begins to bubble; reduce heat to medium-low and cook, turning potatoes occasionally, until tender but not browned, 25–30 minutes. Transfer potatoes to a rimmed baking sheet with a slotted spoon; let cool slightly. Flatten with your hands and place in a large bowl. Strain oil into a measuring glass.", "Heat 2 Tbsp. potato-cooking oil in a medium skillet over medium. Cook garlic, stirring occasionally, until golden, about 2 minutes. Add onion and cook, stirring occasionally, until soft and translucent, 8–10 minutes; season with salt. Transfer to bowl with potatoes. Add eggs and ⅓ cup potato-cooking oil and mix gently to combine; season with salt.", "Heat 1 tsp. potato-cooking oil in a small nonstick skillet over medium. Pour in egg mixture and cook, stirring often until beginning to set and occasionally pushing away from sides to shape and compact, until golden brown and set on bottom, about 5 minutes. Press down on tortilla with spatula to flatten. Set a plate face down over skillet and swiftly invert tortilla onto plate. Slide back into skillet, browned side up, and cook until golden brown on other side, about 2 minutes. Slide tortilla onto a clean plate; let cool.", "Just before serving, drape ham over tortilla and tuck ends under; spoon some relish on top."]}, "Jalapeño-Pickled Peppers": {"ingredients": ["2 cups unseasoned rice vinegar", "½ cup sugar", "3 tablespoons kosher salt", "4 Hungarian wax peppers", "6 Italian frying peppers", "4 jalapeños, sliced into rings"], "instructions": ["Whisk vinegar, sugar, salt, and 1½ cups water in a large glass jar until sugar dissolves. Prick Hungarian wax peppers and Italian frying peppers all over with a cake tester or the point of a sharp paring knife (this helps the brine penetrate the chiles faster). Add both peppers and jalapeños to jar and chill at least 12 hours before using.", "Do Ahead: Chiles can be pickled 2 weeks ahead. Keep chilled."]}, "Jerk Spice–Rubbed Chicken Legs": {"ingredients": ["1 4-inch piece cinnamon stick", "1 tablespoon plus 1 teaspoon allspice berries", "2 teaspoons black peppercorns", "2 teaspoons whole cloves", "2 tablespoons light brown sugar", "1 tablespoon plus 1 teaspoon dried thyme", "1 teaspoon cayenne pepper", "¼ cup olive oil", "4 chicken legs (thigh and drumstick)", "Kosher salt", "A spice mill or a mortar and pestle"], "instructions": ["Preheat oven to 425°. Whack cinnamon stick with the back side of a chef’s knife to break into small pieces. Toast cinnamon, allspice, peppercorns, and cloves in a dry small skillet over medium-high, tossing, until fragrant, about 2 minutes; let cool.", "Grind spices, brown sugar, thyme, and cayenne in spice mill or with mortar and pestle to a fine powder. Mix oil and 2 Tbsp. spice rub in a small bowl (save remaining rub for another use). Rub chicken legs with jerk spice mixture; season with salt. Place on a rimmed baking sheet and bake until golden brown and cooked through, 30–35 minutes.", "Do Ahead: Jerk spice can be made 3 months ahead. Store airtight at room temperature."]}, "Jumbo Lump Crab Cakes": {"ingredients": ["2 teaspoons paprika", "1 teaspoon dried oregano", "1 teaspoon kosher salt", "¾ teaspoon garlic powder", "½ teaspoon onion powder", "¼ teaspoon cayenne pepper", "¼ teaspoon freshly ground black pepper", "¼ teaspoon sugar", "1 large egg", "¼ cup mayonnaise", "1 tablespoon finely chopped parsley", "Kosher salt", "1 pound jumbo lump crabmeat, picked over", "3 tablespoons unsalted butter, divided", "1 small shallot, finely chopped", "1 tablespoon all-purpose flour", "¼ cup dry Sauvignon Blanc", "½ cup low-sodium chicken broth", "½ cup heavy cream", "¼ cup Pommery mustard or whole grain mustard", "2 tablespoons vegetable oil, divided", "3 tablespoons fine plain dry breadcrumbs", "Chopped parsley (for serving)", "A 3-inch ring mold or biscuit cutter"], "instructions": ["Mix paprika, oregano, salt, garlic powder, onion powder, cayenne, black pepper, and sugar in a small bowl to combine.", "Do Ahead: Spice mix can be made up to 1 month in advance. Store in an airtight container at room temperature.", "Whisk egg in a medium bowl just to blend. Discard all but 2 Tbsp. beaten egg. Mix mayonnaise, parsley, ½ tsp. blackening spice, and a pinch of salt into remaining egg. Fold in crabmeat just until coated, taking care not to break it up too much.", "Divide crab mixture into 4 equal portions and, working with 1 portion at a time, pack tightly into ring mold set on a parchment-lined baking sheet; smooth top. Carefully remove ring mold. Repeat with remaining crab mixture. Cover with plastic wrap and chill at least 1 hour (cakes will firm slightly when chilled).", "Do Ahead: Crab cakes can be formed 1 day ahead. Keep chilled.", "Preheat oven to 400°. Melt 1 Tbsp. butter in a small saucepan over medium. Cook shallot, stirring often, until softened, about 5 minutes. Whisk in flour and cook, whisking often, until just beginning to smell nutty, about 3 minutes. Whisk in wine, bring to a boil, and cook just until thick, about 1 minute. Whisk in broth, return mixture to a boil, and cook until thick enough to coat a spoon, about 5 minutes. Add cream, bring to a simmer, and cook, whisking occasionally, until mixture is again thick enough to coat a spoon, about 4 minutes. Whisk in mustard, cover sauce, and keep warm.", "Heat 1 Tbsp. oil and 1 Tbsp. butter in a large nonstick skillet over medium. Working with 2 crab cakes, sprinkle 1 tsp. breadcrumbs over each cake and carefully place, crumb side down, in skillet. Cook, occasionally swirling fat in pan around, until bottom sides of crab cakes are deep golden brown, about 5 minutes. Sprinkle 1 tsp. breadcrumbs over top sides of each crab cake, then very carefully turn over (you may need to use 2 spatulas as cakes will be very delicate). Cook until breadcrumbs are golden, about 2 minutes. Transfer to a plate. Wipe out skillet and repeat with remaining oil, butter, crab cakes, and breadcrumbs.", "After the second batch of crab cakes is done cooking, return crab cakes on plate to skillet and transfer to oven. Cook until warmed through, about 3 minutes.", "Serve crab cakes over mustard sauce topped with parsley."]}, "Jam-Filled Almond Cupcakes": {"ingredients": ["Nonstick vegetable oil spray", "3 cups almond flour or meal", "1½ teaspoons baking powder", "½ teaspoon kosher salt, divided", "6 large eggs", "1 cup granulated sugar", "4 teaspoons vanilla extract, divided", "1 cup (2 sticks) unsalted butter, room temperature", "2 cups powdered sugar", "¼ cup heavy cream", "¼ teaspoon almond extract", "½ cup fig (or your favorite) jam", "Toasted sliced almonds (for serving)"], "instructions": ["Place racks in upper and lower thirds of oven; preheat to 325°. Lightly coat edges of cups and tops of 3 standard 6-cup muffin pans with nonstick spray and line with paper liners. Sift almond flour through a fine-mesh sieve into a medium bowl; discard any large pieces. Whisk in baking powder and ¼ tsp. salt.", "Using a stand mixer fitted with a whisk attachment, whisk eggs and granulated sugar on medium-high speed until pale and fluffy, about 5 minutes. Reduce speed to low and whisk in almond-flour mixture and 2 tsp. vanilla until smooth, about 1 minute. Divide batter among muffin cups. Bake cupcakes, rotating pans top to bottom halfway through, until a tester inserted into the centers comes out clean, 15–20 minutes. Transfer cupcakes to a wire rack and let cool.", "Using an electric mixer on medium-high speed, beat butter until light and fluffy, about 3 minutes. Reduce speed to low and, with motor running, add powdered sugar in 2 additions, beating until fully incorporated after each, about 2 minutes. Add cream, almond extract, remaining 2 tsp. vanilla, and remaining ¼ tsp. salt and beat until light and creamy, about 1 minute.", "Using an apple corer, punch out about 1\" from the top of each cupcake to form a hole in the center; discard core (kidding—eat it!). Fill hole with a heaping teaspoonful of jam.", "Spread frosting over cupcakes and top each with a small handful of almonds.", "Do Ahead: Filled and frosted cupcakes can be made 1 day ahead. Store airtight at room temperature."]}, "Jalapeño-Cilantro Pickled Corn": {"ingredients": ["4 ears of corn (about 2½ pounds)", "½ small yellow or red onion, thinly sliced", "1 jalapeño, thinly sliced", "4 large sprigs cilantro", "1 cup distilled white vinegar", "2 tablespoons kosher salt", "2 teaspoons sugar", "One 1-qt. canning jar or two 1-pint jars with lids"], "instructions": ["Cook corn in a large pot of boiling water (unsalted) until bright yellow and just cooked through, about 2 minutes. Transfer to a colander set in an ice bath to cool. Drain; cut kernels from cobs. Place kernels in jar and add onion, jalapeño, and cilantro.", "Bring vinegar, salt, sugar, and 2 cups water to a boil in a small saucepan, stirring to dissolve salt and sugar. Pour hot brine into jar and cover. Let cool, then chill.", "Do Ahead: Corn can be made 2 months ahead. Keep chilled."]}, "Jicama, Radish, and Pickled Plum Salad": {"ingredients": ["3 red plums, each cut into 8 wedges", "1 teaspoon sugar", "1 teaspoon kosher salt", "1 1-inch piece ginger, peeled", "2 cardamom pods, lightly crushed", "¼ cup fresh orange juice", "2 tablespoons apple cider vinegar", "1 teaspoon juniper berries", "½ teaspoon gochugaru (coarse Korean red pepper powder) or ¼ teaspoon crushed red pepper flakes", "2 tablespoons fresh lime juice", "1 red plum, sliced into thin wedges", "¼ cup unseasoned rice vinegar", "¼ teaspoon kosher salt, plus more", "1 medium jicama, peeled, cut into matchsticks", "2 medium watermelon radishes, cut into matchsticks", "½ English hothouse cucumber, halved lengthwise, seeded, thinly sliced into half-moons, divided", "⅓ cup unsalted, roasted peanuts, coarsely chopped, divided", "¼ cup mint leaves, thinly sliced, divided", "1 teaspoon Aleppo pepper, plus more for serving", "1 teaspoon sumac, plus more", "Flaky sea salt", "Gochugaru can be found at Korean markets. Sumac can be found at Middle Eastern markets and specialty foods stores. Both can be found online."], "instructions": ["Toss plums, sugar, and salt in a medium saucepan. Cover and let sit, tossing occasionally, until plums have released their juices, at least 2 hours.", "Add ginger, cardamom, orange juice, vinegar, juniper berries, and gochugaru to plums. Bring to a boil, then reduce heat and simmer, stirring often, until plums break down and become jammy, 20–25 minutes. Stir in lime juice; let cool.", "Strain sour plum sauce through a fine-mesh sieve into a small bowl; discard solids. Set aside.", "Do Ahead: Plums can be macerated 12 hours ahead; chill. Sauce can be made 3 days ahead; cover and chill.", "Toss plum, vinegar, and ¼ tsp. kosher salt in a small bowl. Let sit, tossing occasionally, until plum is lightly pickled, 10–15 minutes; drain.", "Toss pickled plum, jicama, radishes, half of cucumber, half of peanuts, half of mint, 1 tsp. Aleppo pepper, and 1 tsp. sumac in a large bowl. Add 2 Tbsp. sour plum sauce and toss to coat; season with kosher salt. Top salad with remaining cucumber, peanuts, and mint. Taste and drizzle with more sauce as desired. Serve sprinkled with sea salt, plus more Aleppo and sumac."]}, "Joly’s Pisco Sour": {"ingredients": ["1 large egg white*", "2 ounces pisco", "1 ounce lime juice", "¾ ounce simple syrup", "Angostura bitters"], "instructions": ["Shake 1 large egg white*, pisco, lime juice, and simple syrup in a cocktail shaker until frothy, about 1 minute. Fill with ice; shake until outside is frosty, about 30 seconds. Strain into a coupe glass. Top with Angostura bitters.", "*Raw egg is not recommended for the elderly, people with weakened immune systems...or people who don’t like raw egg."]}, "Jerusalem Artichokes with Salsa Verde": {"ingredients": ["3 pounds Jerusalem artichokes (also called sunchokes), unpeeled, cut into 1½” pieces", "½ cup olive oil, divided", "Kosher salt and freshly ground black pepper", "4 anchovy fillets packed in oil, drained, finely chopped", "2 garlic cloves, finely grated", "½ cup chopped fresh flat-leaf parsley", "2 tablespoons drained capers, chopped", "1 tablespoon red wine vinegar", "¼ teaspoon crushed red pepper flakes"], "instructions": ["Preheat oven to 450°. Toss Jerusalem artichokes with ¼ cup oil on a baking sheet; season with salt and pepper. Roast, tossing halfway through, until soft, 25–30 minutes.", "Mix anchovies, garlic, parsley, capers, vinegar, red pepper flakes, and remaining ¼ cup oil in a small bowl; season with salt and pepper. Serve with Jerusalem artichokes."]}, "Johnnycake Bread": {"ingredients": ["¼ cup vegetable oil, plus more for pans", "1¼ cups all-purpose flour", "¾ cup cornmeal", "¼ cup granulated sugar", "1½ teaspoons baking powder", "¾ teaspoon kosher salt", "2 large eggs", "1 cup whole milk", "¼ cup mild-flavored (light) molasses", "1 tablespoon maple sugar or raw sugar"], "instructions": ["Heat oven to 325°. Lightly oil two 5x2½” loaf pans (or one 8½x4½” loaf pan). Whisk flour, cornmeal, granulated sugar, baking powder, and salt in a large bowl. Make a well in the center, add eggs, milk, molasses, and ¼ cup oil, and whisk in dry ingredients. Divide between pans. Sprinkle with maple sugar.", "Bake breads until golden and a tester inserted in the center comes out clean, 40–45 minutes for small loaves (50–55 minutes for large loaf). Transfer pans to a wire rack and let cool 10 minutes before turning out.", "DO AHEAD: Breads can be made 1 day ahead. Store wrapped tightly at room temperature."]}, "Japanese-Style Pickled Cucumbers with Seaweed and Sesame": {"ingredients": ["2 English hothouse or 8 Persian cucumbers, sliced crosswise 1/4\" thick", "1 tbsp kosher salt", "1/3 cup Pacific Arame seaweed", "3 tablespoons seasoned rice vinegar", "1 tbsp agave syrup (nectar)", "1 tsp Shaoxing or other rice wine or sake", "2 tablespoons toasted sesame seeds"], "instructions": ["Toss cucumbers and salt in a medium bowl; let stand 10 minutes. Drain, rinse under cold water, then squeeze well to remove as much excess moisture as possible.", "Meanwhile, place seaweed in a small bowl and add warm water to cover. Let soak until softened, about 5 minutes; drain and squeeze out excess moisture.", "Whisk vinegar, agave, and wine in a medium bowl. Add cucumbers, seaweed, and sesame seeds and toss to coat.", "DO AHEAD: Cucumbers can be salted and rinsed 5 days ahead. Cover and chill."]}, "Julia's Best Banana Bread": {"ingredients": ["Nonstick vegetable oil spray", "1¾ cups all-purpose flour", "1½ teaspoon baking soda", "¾ teaspoon kosher salt", "3 large eggs", "1½ cups sugar", "1 cup mashed ripe bananas (about 2 large)", "¾ cup vegetable oil"], "instructions": ["Preheat oven to 350°. Coat a 9x5x3” loaf pan with nonstick spray. Whisk flour, baking soda, and salt in a medium bowl. Whisk eggs, sugar, bananas, and oil in a large bowl until smooth. Add dry ingredients to banana mixture and stir just until combined. Scrape batter into prepared pan and smooth top.", "Bake until a tester inserted into the center of bread comes out clean, 60–70 minutes. Transfer to a wire rack; let bread cool in pan for 15 minutes. Run a knife around inside of pan to release the bread. Turn out onto rack and let cool completely.", "DO AHEAD: Banana bread can be made 3 days ahead. Store airtight at room temperature."]}, "Jose's Gin and Tonic": {"ingredients": ["3 juniper berries", "1 lime wheel", "1 lemon verbena leaf", "1 strip lemon zest (removed with a vegetable peeler)", "1½ ounces gin (preferably Hendrick's)", "3–4 ounces tonic water"], "instructions": ["Combine juniper berries, lime wheel, lemon verbena leaf, lemon zest, and 1 oversize ice cube in a stemless wineglass or goblet. Add gin and tonic water; stir to combine."]}, "Jeweled Rice": {"ingredients": ["1/4 cup unsalted, shelled raw natural pistachios", "1/4 cup slivered almonds", "2 cups basmati rice", "Kosher salt", "1 orange", "1/2 cup sugar", "2 medium carrots, peeled, cut into matchstick-size pieces", "1/4 cup dried barberries or 1/2 cup dried cranberries", "1/4 cup raisins", "1/4 teaspoon saffron threads", "2 tablespoons unsalted butter", "4 tablespoons olive oil, divided", "1 medium onion, finely chopped", "1/4 teaspoon ground cardamom", "1/4 teaspoon ground cumin", "1/4 teaspoon ground turmeric"], "instructions": ["Preheat oven to 350°. Spread pistachios on a rimmed baking sheet and toast until just beginning to brown, about 4 minutes. Transfer to a plate, let cool, then coarsely chop. Spread almonds on the same baking sheet and toast until golden brown, 5–8 minutes; let cool. Set nuts aside.", "Place rice in a fine-mesh sieve and rinse under cold water until water runs clear. Cook rice in a large pot of boiling salted water, stirring occasionally, until grains have lengthened but are still firm, 6–7 minutes; drain and rinse under cold water. Spread rice on another rimmed baking sheet; let cool.", "Meanwhile, using a vegetable peeler, remove zest from orange and thinly slice lengthwise (reserve flesh for another use). Bring sugar and 1 cup water to a boil in a medium saucepan, stirring to dissolve sugar. Add orange zest and carrots, reduce heat, and simmer, stirring occasionally, until carrots are tender, 15–20 minutes; drain and set aside (discard syrup).", "Combine barberries and raisins in a small bowl and cover with hot water; let soak 10 minutes. Drain and set aside. Place saffron in another small bowl and add 1/4 cup hot water; set aside.", "Heat butter and 1 tablespoon oil in a large skillet over medium heat. Add onion, season with salt, and cook, stirring often, until soft and beginning to brown, 8–10 minutes. Add cardamom, cumin, turmeric, and 1 tablespoon saffron mixture. Cook, stirring constantly, until fragrant, about 1 minute.", "Reduce heat to low, add barberries and raisins, and cook, stirring often, about 3 minutes. Stir in reserved nuts and orange zest and carrot mixture; season with salt. Set fruit and nut mixture aside.", "Heat remaining 3 tablespoons oil in a large wide heavy pot over medium heat. Add half of rice, spreading evenly; top with fruit and nut mixture, then remaining rice, spreading evenly. Using the end of a wooden spoon, poke 5–6 holes in rice all the way through to bottom of pot (to help release steam and help rice cook evenly).", "Drizzle remaining saffron mixture over rice. Place a clean kitchen towel over pot, cover with a tight-fitting lid, and secure loose edges of towel on top of lid, using a rubber band or masking tape.", "Cook until pot begins to steam, 5–8 minutes. Reduce heat to very low and cook, without stirring, until rice is tender and bottom layer of rice is browned and crisp, 30–40 minutes.", "Scoop rice into a wide serving bowl, breaking bottom crust into pieces.", "DO AHEAD: Fruit and nut mixture can be made 2 days ahead. Cover fruit and nut mixture and remaining saffron mixture separately and chill."]}, "Jenga Ribs": {"ingredients": ["1 tablespoon plus 1 teaspoon garlic powder", "1 tablespoon kosher salt", "1 tablespoon (packed) light brown sugar", "1 tablespoon paprika", "2 teaspoons chili powder", "2 teaspoons freshly ground black pepper", "2 teaspoons ground cumin", "2 teaspoons onion powder", "1 teaspoon ground cinnamon", "1 teaspoon ground coriander", "2 racks St. Louis-style pork spareribs (4-4 1/2 pounds total)", "Prepared barbecue sauce"], "instructions": ["Whisk garlic powder, salt, brown sugar, paprika, chili powder, pepper, cumin, onion powder, cinnamon, and coriander in a small bowl to blend. DO AHEAD: Spice blend can be made 1 month ahead. Store airtight at room temperature.", "Preheat oven to 300°. Rub ribs all over with spice blend and wrap each rack individually in foil, crimping seams to seal tightly. Place both racks on a rimmed baking sheet. Bake ribs until fork-tender, about 3 hours. DO AHEAD: Ribs can be made 2 days ahead. Open foil packets and let ribs cool completely. Rewrap tightly and refrigerate on same baking sheet.", "Preheat oven to 425°. Cut racks between bones into individual ribs. Divide ribs between 2 foil-lined rimmed baking sheets and bake until heated through and golden brown, 15-20 minutes.", "Layer ribs on plates in alternating directions, 3 ribs per layer. Serve ribs, passing barbecue sauce alongside."]}, "Janet McCracken's Rib Roast with Tapenade": {"ingredients": ["1 cup brine-cured pitted black olives (such as Kalamata)", "1 cup brine-cured pitted green olives (such as Picholine)", "1/4 cup extra-virgin olive oil", "2 tablespoons chopped fresh thyme", "2 tablespoons drained capers", "1 tablespoon chopped fresh rosemary", "3 garlic cloves, chopped", "1 anchovy fillet packed in oil, drained", "1 four-bone standing beef rib-eye roast (about 11 pound), chine bone removed, fat trimmed to 1/4 inches-1/2 inches thick", "1 1/2 tablespoons kosher salt plus more", "Freshly ground black pepper", "1 cup dry red wine (such as Merlot)", "2 cups reduced-sodium chicken or beef broth", "2 sprigs thyme", "2 tablespoons (1/4 stick) unsalted butter, room temperature, divided", "1 tablespoon all-purpose flour"], "instructions": ["Pulse all ingredients in a food processor until a coarse purée forms. DO AHEAD: Tapenade can be made 1 week ahead. Place in a small bowl. Cover; chill.", "Line a rimmed baking sheet with plastic wrap, leaving a long overhang on both ends. Place roast on top. Season meat with salt and pepper, then rub tapenade all over roast. (If fat cap is thicker than 1/4 inch, cut in between fat and meat, starting on side of fat farthest from bones and continuing to within about 1 inch of bones; your butcher can do this for you. Peel back layer of fat, leaving attached; season meat and spread some of tapenade under fat. This will help seasoning penetrate the meat. Lay fat back over meat.)", "Tie 2 pieces of kitchen twine crosswise and 2 pieces lengthwise around roast to secure. Wrap tightly with excess plastic wrap and chill overnight. Let roast stand at room temperature for 1 hour before cooking.", "Preheat oven to 425°. Unwrap roast; set on a rack inside a deep roasting pan. Pour 2 cups water into bottom of pan. Roast meat until deep brown, about 40 minutes. Reduce heat to 325° and continue to roast until an instant-read thermometer inserted into the thickest part of meat registers 120° for medium-rare (temperature will climb to 125° after removed from oven), about 1 1/2 hours longer. Transfer rack with roast to a cutting board; let rest for at least 30 minutes.", "Meanwhile, pour off fat from roasting pan; discard fat. Add wine to pan, set over medium heat, and cook, stirring to dissolve any browned bits from bottom of pan. Transfer liquid to a medium skillet and bring to a boil over medium-high heat. Reduce heat and simmer until wine is reduced to 1/4 cup, 7-8 minutes. Add broth and thyme sprigs; cook until reduced to 3/4 cup, about 15 minutes.", "Stir 1 tablespoon butter and flour in a small bowl until well blended. Whisk half of butter mixture into pan sauce. Return to a simmer and season to taste with salt and pepper. Sauce should be thick enough to coat a spoon but still runny. Whisk in remaining butter mixture to thicken more, if desired. Whisk in remaining 1 tablespoon butter.", "Carve roast. Serve sauce alongside."]}, "Japanese-Style Seasoning Salt": {"ingredients": ["1 1/2 toasted, crumbled nori sheets", "1/4 cup toasted sesame seeds", "2 finely grated zest of tangerines or lemons", "1 tablespoon kosher salt", "1 tablespoon toasted Sichuan peppercorns", "2 teaspoons ground ginger", "2 teaspoons paprika", "2 teaspoons toasted white or black poppy seeds", "1 large pinch of cayenne pepper"], "instructions": ["Grind toasted, crumbled nori sheets in a spice mill to a fine powder. Add toasted sesame seeds, finely grated zest of tangerines or lemons, kosher salt, toasted Sichuan peppercorns, ground ginger, paprika, toasted white or black poppy seeds, and cayenne pepper; pulse to a uniform spice blend but not to a powder. DO AHEAD: Can be made 3 days ahead. Store airtight at room temperature."]}, "Jalapeño Tequila Gimlet": {"ingredients": ["2 jalapeños, stemmed", "2 cups tequila blanco", "1 cup fresh lime juice", "1/2 cup agave syrup (nectar)"], "instructions": ["Grill, broil or roast jalapeños over a gas flame, turning frequently, until soft and charred. Stem and chop chiles.", "Transfer chiles and seeds, if using, to a jar. Add tequila and let sit for 1 hour. Strain mixture through a fine-mesh sieve into a medium pitcher; discard solids in sieve. Stir in lime juice, agave syrup, and 2 cups ice (to chill and dilute). Let stand, stirring occasionally, until ice is melted. Divide gimlet among chilled glasses."]}, "Jerk Chicken": {"ingredients": ["1 4-pound chicken, cut into 8 pieces", "1 medium red onion, chopped", "12 garlic cloves", "10 Scotch bonnet or 15 small habanero chiles, stemmed, seeded", "8 scallions (white and pale-green parts only), chopped", "1 3-inch piece peeled ginger, sliced", "2 tablespoons chopped fresh thyme", "1 1/2 tablespoons ground cinnamon", "1 1/2 tablespoons whole allspice", "1 tablespoon kosher salt", "1 tablespoon powdered adobo seasoning", "1/2 teaspoon Maggi Liquid Seasoning"], "instructions": ["Pierce chicken all over with tip of a small knife; transfer to a large bowl. Purée remaining ingredients and 1/4 cup water in a blender until smooth. Reserve 1 cup for dipping sauce, if desired. Pour remaining marinade over chicken; massage into chicken. (To protect your hands from the chiles' heat, wear latex gloves.) Cover; chill for at least 1 day and up to 2 days.", "Let chicken sit at room temperature for 1 hour before cooking. Build a medium-low fire in a charcoal grill, or heat a gas grill to medium. Place chicken on grill, skin side up. Cook covered, turning often, until skin is crisp and lightly charred and an instant-read thermometer inserted into the thickest parts of chicken registers 160° (breasts) or 165° (thighs), 30–45 minutes. Transfer to a platter and tent loosely with foil; let stand for 10 minutes. Serve with reserved dipping sauce, if desired."]}, "Jicama-Sesame Slaw": {"ingredients": ["1 lime", "1/2 teaspoon honey", "1/2 teaspoon Asian sesame oil", "1/2 teaspoon olive oil", "1 Fresno chile or 1 red jalapeño, stemmed, seeded, minced", "2 cups peeled matchstick-size pieces jicama", "1 teaspoon sesame seeds", "1 tablespoon thinly sliced mint (optional)"], "instructions": ["Using a small sharp knife, remove peel and all white pith from lime. Working over a small bowl, cut between membranes to release lime segments. Squeeze any juices from membranes into bowl. Whisk honey, sesame oil, and olive oil in a medium bowl. Stir in chile, lime segments, and any juice from bowl. Add jicama, sesame seeds, and mint (if using); toss gently to coat. Serve immediately."]}, "Jaguar's Milk Punch ": {"ingredients": ["6 allspice berries", "6 whole cloves", "12 large pasteurized eggs, separated", "1 cup sugar", "1 1/2 teaspoons ground cinnamon", "3/4 teaspoon cayenne", "1/2 cup dark rum (such as Cruzan Blackstrap)", "1 1/2 teaspoons vanilla extract", "1 1/2 cups joven mezcal (such as Sombra)", "2 cups reposado tequila", "1 cup white crème de cacao (such as Marie Brizard)", "8 cups whole milk", "Finely grated orange peel", "Freshly grated nutmeg"], "instructions": ["Finely grind allspice berries and cloves in spice mill. Using electric mixer, beat yolks in large bowl in mixture to blend. Stir in sugar, then ground spice mixture, cinnamon, and cayenne. Stir in rum and vanilla. Beat yolk mixture until thick and creamy, about 3 minutes. Using clean, dry beaters, beat egg whites in another large bowl until peaks form. Fold whites into yolk mixture in 2 additions, folding just to blend. Cover and chill rum mixture.", "Mix tequila, mezcal, and crème de cacao in crockpot. Heat over low heat. Heat milk in medium saucepan over medium heat. Whisk milk into mixture in crockpot 1 cup at a time.", "Ladle punch into mugs. Spoon dollop of rum mixture atop punch; stir until foamy. Sprinkle top with finely grated orange peel and freshly grated nutmeg and serve."]}, "Jalapeño-Goat-Cheese Hush Puppies": {"ingredients": ["1 cup yellow cornmeal", "1 1/2 tablespoons all purpose flour", "1 1/2 tablespoons sugar", "3/4 teaspoon coarse kosher salt", "1/2 teaspoon baking powder", "1/4 teaspoon baking soda", "1/2 cup buttermilk", "2 tablespoons beaten egg", "1 1/2 tablespoons chopped seeded jalapeño chile", "4 ounces coarsely crumbled soft fresh goat cheese (about 1 cup)", "Canola oil or vegetable oil (for deep-frying)"], "instructions": ["Whisk first 6 ingredients in medium bowl to blend. Whisk buttermilk, egg, and chile in small bowl to blend. Stir buttermilk mixture and cheese into dry ingredients.", "Add enough oil to deep medium saucepan to reach 1 1/2 inches. Attach deep-fry thermometer to pan; heat oil to 320°F to 330°F over medium heat. Working in batches of 4 or 5, drop batter by tablespoonfuls into oil. Cook until golden, turning occasionally, about 4 minutes. Using slotted spoon, transfer hush puppies to paper towels. DO AHEAD Can be made 2 hours ahead. Let stand at room temperature. Rewarm until crisp in 375°F oven, 12 to 14 minutes."]}, "Jim 'N Nick's Coleslaw": {"ingredients": ["1 2-pound head of green cabbage, quartered, cored, cut crosswise into 1/8-inch-thick slices (about 14 cups)", "1 1/4 cups apple cider vinegar", "1 cup sugar", "1 cup grated peeled carrots", "4 green onions, thinly sliced", "1/4 cup mayonnaise"], "instructions": ["Place cabbage in large bowl. Add vinegar and sugar; toss to coat. Cover and let stand 30 minutes. toss cabbage mixture well; cover and let stand 30 minutes longer. Drain cabbage. DO AHEAD Can be made 8 hours ahead. Cover and chill.", "Transfer drained cabbage to another large bowl. Add carrots, green onions, and mayonnaise; toss to coat. Season to taste with salt and pepper."]}, "Jerk Marinade": {"ingredients": ["6 tablespoons vegetable oil, divided", "1/4 cup fresh lime juice", "4 scallions, coarsely chopped", "4 Scotch bonnet or habanero chiles, stemmed, seeded, coarsely chopped", "3 garlic cloves, roughly chopped", "2 tablespoons fresh thyme", "1 tablespoon minced peeled fresh ginger", "1 tablespoon (packed) dark brown sugar", "2 teaspoons allspice berries", "1 teaspoon kosher salt plus more", "1/4 tablespoon freshly ground black pepper", "2 tablespoons distilled white vinegar"], "instructions": ["Purée 4 tablespoons oil and the next 10 ingredients in a food processor until smooth. Transfer 1/4 cup marinade to a small bowl and make sauce: Whisk in vinegar and remaining 2 tablespoons oil and season to taste with salt. Refrigerate sauce. Put meat in a glass, stainless-steel, or ceramic dish. Toss with remaining marinade. Cover and chill for at least 3 hours or overnight.", "Remove meat from marinade, pat dry, and grill.", "Spoon reserved sauce over grilled meat."]}, "John Dory with Squash Risotto and Herbed Cranberry Sauce": {"ingredients": ["1 cup fresh or frozen cranberries", "1/2 cup water", "1/4 cup sugar", "2 fresh sage leaves", "1/4 teaspoon Sherry wine vinegar", "4 2- to 3-ounce skinless John Dory fillets, each cut in half lengthwise", "2 teaspoons chopped fresh thyme", "2 teaspoons chopped fresh sage", "4 thin prosciutto slices, cut in half lengthwise (about 1 1/2 ounces)", "1 1 3/4-pound butternut squash, peeled, cut into 1/2-inch cubes (about 3 1/2 cups cubes) plus 1 small butternut squash with long slender neck (about 3 inches long)", "4 3/4 cups low-salt chicken broth, divided", "12 unpeeled baby carrots, scrubbed, 1 inch of green tops still attached", "1 1/2 tablespoons olive oil, divided", "16 pearl onions, peeled", "1 1/2 cups vegetable oil (for frying)", "12 fresh sage leaves", "3 tablespoons butter, divided", "1/2 cup chopped shallots (about 2 large)", "1 garlic clove, pressed", "1 cup arborio rice or other medium-grain white rice", "1/2 cup dry white wine"], "instructions": ["Bring first 4 ingredients to boil in medium saucepan over medium-high heat, stirring to dissolve sugar. Cover and reduce heat to medium. Cook until berries are tender, stirring occasionally, about 8 minutes. Uncover and boil until thickened, about 3 minutes. Remove from heat. Stir in vinegar and season to taste with salt and pepper. DO AHEAD Can be made 1 week ahead. Cover and refrigerate. Bring to room temperature before using.", "Place fillets on work surface; sprinkle with pepper and fresh herbs. Starting at 1 short end, roll up each fillet into spiral. Place prosciutto slices on work surface. Lay 1 fish spiral atop end of each prosciutto slice; roll up to enclose fish in prosciutto. Place on plate. DO AHEAD Can be made 6 hours ahead. Cover and chill.", "Boil squash and 1 3/4 cups broth in large saucepan until tender, 8 to 10 minutes. Using slotted spoon, transfer squash to processor. Puree until smooth, adding squash cooking liquid by 1/4 cupfuls as needed for thick puree. Set aside 1 cup puree (reserve remaining puree for another use). DO AHEAD Can be made 4 hours ahead. Let stand at room temperature.", "Preheat oven to 375°F. Cook carrots in saucepan of boiling salted water until tender, about 6 minutes. Drain; set aside. Heat 1/2 tablespoon olive oil in medium ovenproof skillet over medium-high heat. Add onions; sprinkle with salt and pepper and sauté until browned in spots. Transfer skillet to oven; roast until onions are golden brown and tender, stirring occasionally, about 10 minutes. DO AHEAD Can be made 4 hours ahead. Cover vegetables separately; let stand at room temperature.", "Peel neck of small butternut squash. Cut very thinly crosswise. Using 1 1/2-inch-diameter cookie cutter, cut rounds from each slice. Heat vegetable oil in small saucepan over medium-high heat until deep-fry thermometer registers 330°F. Reduce heat to medium-low. Working in batches, fry squash rounds until golden and slightly curled at edges to resemble petals, about 3 minutes per batch. Using slotted spoon, transfer squash petals to paper towels. Sprinkle with salt. Fry sage leaves in same oil until crisp, about 30 seconds.", "Melt 2 tablespoons butter in heavy large saucepan over medium-high heat. Add shallots; sauté until soft, stirring often, about 2 minutes. Reduce heat to medium. Add garlic; stir until aromatic, about 1 minute. Add rice; stir 1 minute. Add wine; boil until almost all liquid is absorbed, about 4 minutes. Add 2 1/2 cups broth by 1/2 cupfuls, stirring until liquid is absorbed between additions, until rice is tender and mixture is creamy, 15 to 18 minutes longer. Stir in reserved 1 cup squash puree and remaining 1/2 cup broth.", "Preheat oven to 400°F. Heat remaining 1 tablespoon olive oil in large ovenproof skillet over medium-high heat. Add fish rolls, seam side down, to skillet. Cook until golden brown all over, about 4 minutes. Transfer skillet to oven; roast until fish is just opaque in center, 5 to 6 minutes. Melt 1 tablespoon butter in large skillet over medium-high heat. Add carrots; toss until heated through, about 2 minutes.", "Place 2 fish rolls in center of each of 4 plates. Spoon 2 to 3 tablespoonfuls risotto around fish. Garnish plates with carrots, onions, and several rounded teaspoonfuls cranberry sauce. Sprinkle fried squash petals and fried sage leaves over each and serve."]}, "Jalisco Flower": {"ingredients": ["1/4 cup fresh ruby red grapefruit juice", "3 tablespoons St-Germain (elderflower liqueur)", "2 tablespoons blanco tequila", "Ice cubes", "Chilled brut Champagne", "Grapefruit peel twists"], "instructions": ["Combine first 3 ingredients in cocktail shaker; fill with ice. Cover and shake vigorously 20 times. Strain into 2 flutes. Top each with Champagne. Garnish with grapefruit twists."]}, "Jalapeño Biscuits": {"ingredients": ["1 3/4 cups all purpose flour", "2 teaspoons baking powder", "1 teaspoon sugar", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes", "1 1/2 tablespoons chopped seeded jalapeño chile", "3/4 cup (or more) chilled buttermilk"], "instructions": ["Preheat oven to 450°F. Line rimmed baking sheet with parchment paper. Combine first 5 ingredients in large bowl. Add butter. Rub in with fingertips until mixture resembles very coarse meal. Mix in jalapeño. Stir in 3/4 cup buttermilk; toss to moisten evenly, adding more buttermilk by tablespoonfuls if dry.", "Gather dough into ball. Transfer to lightly floured surface and gently pat to 1-inch thickness. Using floured 2-inch-diameter biscuit cutter, cut out biscuits. Gently gather dough scraps; reshape and cut out more biscuits. Arrange biscuits on prepared baking sheet.", "Bake biscuits until puffed and pale golden on top and tester inserted into center comes out clean, about 12 minutes. Serve warm."]}, "Jalapeño Crab Cakes with Slaw and Salsa": {"ingredients": ["1 pound fresh crabmeat, picked over, patted dry", "1 1/3 cups panko (Japanese breadcrumbs)*", "2 tablespoons chopped seeded jalapeño chiles (1 to 2 large)", "1 1/2 teaspoons coarse kosher salt", "4 large eggs, beaten to blend", "1/4 cup canola oil or other vegetable oil", "4 cups (about 6 ounces) coleslaw mix", "2/3 cup purchased salsa", "1/3 cup sour cream", "Lime wedges"], "instructions": ["Line rimmed baking sheet with waxed paper. Combine first 4 ingredients in large bowl. Stir in eggs. Using moist hands, shape mixture into 8 cakes, each about 3/4 inch thick. Arrange cakes on prepared sheet.", "Heat 2 tablespoons oil in each of 2 medium skillets over medium heat. Add 4 cakes to each. Cook until golden brown and cooked through, about 4 minutes per side.", "Mound slaw mix on 4 plates. Top each serving with 2 cakes. Serve with salsa, sour cream, and lime wedges."]}, "Julienne of Sesame Carrots and Celery Root": {"ingredients": ["2 tablespoons (1/4 stick) butter", "1 pound celery root, peeled, cut into matchstick-size strips", "1 pound carrots, peeled, cut into matchstick-size strips", "1 tablespoon black sesame seeds", "1 tablespoon toasted white sesame seeds", "1 tablespoon oriental sesame oil", "1 tablespoon fresh lemon juice", "1/2 teaspoon salt"], "instructions": ["Cook butter in heavy large deep skillet over medium heat until golden brown, about 2 minutes. Add celery root and carrots; toss to coat with butter. Reduce heat to medium-low and cook until carrots and celery root are crisp-tender, stirring occasionally, about 10 minutes. Add all sesame seeds, sesame oil, lemon juice, and salt; toss to coat. Cook 2 minutes longer to blend flavors. Transfer to bowl."]}, "Jumbo Shrimp with Chive Butter": {"ingredients": ["1/4 cup Dijon mustard", "1/4 cup fresh lemon juice", "1 cup (2 sticks) butter, melted", "6 tablespoons chopped fresh chives", "36 uncooked jumbo shrimp, peeled, deveined, butterflied", "Whole chives"], "instructions": ["Preheat broiler. Place mustard in bowl; whisk in lemon juice, then melted butter. Add chopped chives. Season with pepper.", "Arrange shrimp, cut side up, on broiler pan. Brush with some of butter mixture. Broil until just cooked through, about 4 minutes. Arrange on plates and garnish with whole chives. Serve, passing remaining butter separately."]}, "Jefferson Sour with Homemade Grenadine": {"ingredients": ["1 cup water", "1 cup sugar", "3 cups rye, divided", "1 1/2 cups fresh lemon juice (from about 8 large lemons), divided", "12 large egg whites (preferably organic), divided", "Ice cubes", "18 teaspoons Homemade Grenadine, divided"], "instructions": ["Bring 1 cup water and sugar to boil in small saucepan over medium-high heat, stirring until sugar dissolves; boil 2 minutes. Pour simple syrup into bowl; cool. DO AHEAD Can be made 1 week ahead. Cover; chill.", "For each drink, combine 1 tablespoon simple syrup, 1/4 cup rye, 2 tablespoons lemon juice, and 1 egg white in cocktail shaker. Fill shaker with ice cubes, cover, and shake vigorously until cold, 30 seconds to 1 minute.", "Fill glass with ice cubes; strain drink from shaker into glass. Drizzle 1 1/2 teaspoons grenadine over."]}, "Jerusalem Artichoke Pickles": {"ingredients": ["1/2 cup coarse kosher salt", "1 pound Jerusalem artichokes (also called sunchokes)*", "2 tablespoons dry mustard", "1 tablespoon all purpose flour", "1 1/3 cups apple cider vinegar", "1 cup plus 2 tablespoons sugar", "1 1/2 teaspoons yellow mustard seeds", "1 1/2 teaspoons celery seeds", "1 1/2 teaspoons turmeric", "1/2 teaspoon ground black pepper", "1 1/3 cups chopped red bell pepper", "2/3 cup chopped onion"], "instructions": ["Bring 2 cups water and 1/2 cup coarse salt to simmer in medium saucepan, stirring until salt dissolves. Remove from heat and add 2 cups water. Cool brine.", "Working with 1 Jerusalem artichoke at a time, peel and cut into 1/2-inch cubes. Place in brine. Cover; chill overnight.", "Whisk mustard, flour, and 1 tablespoon water in small bowl to paste. Bring vinegar and next 5 ingredients to boil in large saucepan, stirring to dissolve sugar. Whisk in mustard paste. Simmer until thickened, whisking often, about 2 minutes. Add drained Jerusalem artichokes, bell pepper, and onion to pan; cook until artichokes are crisp-tender, about 5 minutes. Cool.", "*Tubers of a variety of sunflower; available in the produce section of some supermarkets and at farmers' markets."]}, "Jerk-Spiced Beef Tenderloin": {"ingredients": ["1/2 cup extra-virgin olive oil", "3 1/2 tablespoons dried Jamaican jerk seasoning", "1 1/2 tablespoons balsamic vinegar", "4 small bay leaves, crumbled finely", "3 large garlic cloves, minced", "2 2 3/4- to 3-pound (thick-end) beef tenderloin roasts"], "instructions": ["Whisk first 5 ingredients in bowl. Pierce tenderloins all over with fork. Place tenderloins in large resealable plastic bag; add marinade and seal. Turn bag to distribute marinade evenly. Chill at least 8 hours and up to 1 day, turning bag occasionally.", "Preheat oven to 400°F. Remove beef from marinade; pat dry. Place on rimmed baking sheet. Sprinkle generously with salt and pepper. Roast until thermometer inserted into each tenderloin registers 125°F for medium-rare, about 40 minutes. Remove from oven; let stand 10 minutes. Cut beef crosswise into 1/2-inch-thick slices."]}, "Jasmine Rice with Garlic, Ginger, and Cilantro": {"ingredients": ["3 cups jasmine rice", "3 tablespoons vegetable oil", "1/3 cup finely chopped peeled fresh ginger", "3 large garlic cloves, minced", "4 1/2 cups low-salt chicken broth", "3/4 teaspoon salt", "1 large bunch fresh cilantro, 2 inches of bottom stems trimmed and discarded, tops and remaining stems coarsely chopped"], "instructions": ["Place rice in large sieve; rinse under cold running water until water runs clear. Drain. Heat oil in heavy large saucepan over medium-high heat. Add ginger and garlic; stir until fragrant, about 30 seconds. Add rice and stir 3 minutes. Stir in broth and salt. Sprinkle cilantro over. Bring to boil. Reduce heat to medium-low; cover and cook until rice is tender, about 18 minutes. Remove from heat; let stand covered 10 minutes. Fluff rice with fork. Transfer to bowl and serve."]}, "Japanese Cucumber Salad with Miso Dressing": {"ingredients": ["3 tablespoons grapeseed oil or vegetable oil", "2 tablespoons red miso", "1 tablespoon sugar", "1 tablespoon bottled yuzu juice", "4 Japanese cucumbers, cut into 1/2-inch-wide sticks", "", "4 radishes, thinly sliced", "1 teaspoon toasted sesame seeds", "1/2 cup dried shaved bonito flakes (optional)"], "instructions": ["Whisk first 4 ingredients in small bowl to blend.", "Divide cucumber sticks among plates in single layer.", "Drizzle dressing over cucumbers, then divide radishes, sesame seeds, and bonito flakes among salads, and serve."]}, "Jamaican Coffee Brownies with Pecans": {"ingredients": ["Nonstick vegetable oil spray", "2 cups sugar", "15 tablespoons (2 sticks minus 1 tablespoon) unsalted butter", "3/4 cup unsweetened cocoa powder", "3 tablespoons finely ground Jamaican Blue Mountain coffee beans", "1/2 teaspoon salt", "3 large eggs", "1 1/2 teaspoons vanilla extract", "1 1/4 cups all purpose flour", "3/4 cup pecan pieces", "1 cup bittersweet or semisweet chocolate chips (6 ounces)", "6 tablespoons freshly brewed Jamaican Blue Mountain coffee", "30 thin strips crystallized ginger"], "instructions": ["Preheat oven to 350°F. Spray 13x9x2-inch metal pan with nonstick spray. Combine sugar, butter, cocoa, ground coffee, and salt in large metal bowl. Place bowl over saucepan of simmering water and whisk until butter melts and are blended (texture will be grainy). Remove bowl from over water; cool mixture to lukewarm if necessary. Whisk in eggs and vanilla. Sift flour over and fold in. Mix in pecans.", "Spread batter in prepared pan. Bake brownies until tester inserted into center comes out clean, about 25 minutes. Cool brownies in pan.", "Place chocolate chips in small bowl. Bring brewed coffee to simmer in small saucepan; pour over chips and stir until melted and smooth. Let ganache stand until cool and beginning to thicken, about 1 hour; spread evenly over brownies. DO AHEAD Can be made 1 day ahead. Cover; let stand at room temperature.", "Cut brownies into 15 squares. Top each with 2 ginger strips."]}, "Jamaican Jerk Chicken": {"ingredients": ["3 tablespoons dark rum", "2 tablespoons water", "", "1/2 cup malt vinegar", "10 green onions, chopped", "4 garlic cloves, peeled, chopped", "2 tablespoons dried thyme", "2 Scotch bonnet chiles or habanero chiles with seeds, chopped", "2 tablespoons vegetable oil", "4 teaspoons ground allspice", "4 teaspoons ground ginger", "4 teaspoons ground cinnamon", "2 teaspoons ground nutmeg", "2 teaspoons salt", "2 teaspoons ground black pepper", "2 teaspoons dark brown sugar", "1 cup ketchup", "3 tablespoons soy sauce", "", "2 3- to 3 1/2-pound chickens, halved lengthwise, rinsed, patted dry", "1/2 cup fresh lime juice"], "instructions": ["Boil rum and 2 tablespoons water in small saucepan for 3 minutes.", "Transfer rum mixture to blender; add vinegar and next 12 ingredients and blend until almost smooth. Transfer 2 tablespoons jerk seasoning to small bowl; mix in ketchup and soy sauce to make sauce. DO AHEAD Jerk seasoning and sauce can be made 1 day ahead; cover separately and refrigerate.", "Arrange chicken in large roasting pan or baking dish. Pour lime juice over; turn to coat. Spoonjerk seasoning over chicken adn rub in. cover and refrigerate at least 4 hours, turning occasionally. DO AHEAD Can be prepared 1 day ahead. Keep refrigerated.", "Preheat oven to 350°F or prepare barbecue (medium heat). Remove chicken from jerk seasoning marinade; sprinkle with salt and pepper. If roasting chicken in oven, arrange chicken, skin side up, on rimmed baking sheet. Roast until chicken is cooked through and juices run clear when thickest part of thigh is pierced with fork, about 50 minutes. If grilling chicken, place chicken, skin side down, on grill rack, cover, and grill until chicken is cooked through, turning occasionally and adjusting heat if browning too quickly, about 50 minutes.", "Cut each chicken half into pieces and serve with sauce."]}, "Japanese-Style Potato Salad with Daikon and Cucumber": {"ingredients": ["1 cup mayonnaise", "1/2 cup white wine vinegar", "1/4 cup fresh lemon juice", "1 tablespoon honey", "1 teaspoon dry mustard", "1/4 teaspoon ground white pepper", "1/4 cup finely chopped celery", "1/4 cup finely chopped white onion", "2 3/4 pounds russet potatoes (about 4 very large), peeled, sliced into 1/2-inch-thick rounds", "1 2-inch-long piece daikon (Japanese white radish),* peeled, halved lengthwise, cut crosswise into 1/8-inch-thick slices", "1 large carrot, peeled, cut into 1/8-inch-thick rounds", "", "8 large escarole leaves, torn into 1-inch pieces", "1 cup very thinly sliced red onion", "1 cup very thinly sliced white onion", "3/4 cup thinly sliced peeled Japanese cucumber or half-rounds of peeled English hothouse cucumber", "1/2 cup diced red bell pepper", "1/2 cup diced yellow bell pepper"], "instructions": ["Whisk first 6 ingredients in small bowl. Mix in celery and onion. Season with salt. DO AHEAD Can be made 1 day ahead. Cover; chill.", "Steam potatoes until tender, about 12 minutes. Transfer potatoes to large bowl; mash coarsely. Steam daikon and carrot until tender, about 5 minutes. Transfer to medium bowl. Mix 1 1/2 cups dressing into mashed potatoes. Cool to barely lukewarm.", "Gently mix daikon, carrot, and remaining vegetables into potatoes. Season with salt and pepper."]}, "Jicama, Radish, and Pepita Salad": {"ingredients": ["1/2 cup olive oil", "1/3 cup chopped fresh cilantro", "1 1/2 tablespoons white wine vinegar", "1 tablespoon honey", "1 1/4 teaspoons ground cumin", "", "1 5-ounce package butter lettuce mix or baby spinach leaves", "2 cups diced peeled jicama", "1 scant cup thinly sliced radishes (about 8)", "1/3 cup natural shelled pumpkin seeds (pepitas), lightly toasted", "1/2 cup coarsely crumbled queso fresco or Cotija cheese"], "instructions": ["Whisk first 5 ingredients in small bowl. Season dressing with salt and pepper.", "Toss lettuce, jicama, and radishes in large bowl. Add dressing and toss to coat. Divide salad among 4 plates. Sprinkle with pumpkin seeds and cheese and serve.", "Pumpkin seeds, indigenous to North America, are also called pepitas, and can be found at many supermarkets. Queso fresco (sometimes labeled queso blanco) and cojita are both Mexican cheeses that can be found at some supermarkets and Latin markets. In a pinch, substitute feta cheese."]}, "Jalapeño Cheeseburgers with Bacon and Grilled Onions": {"ingredients": ["1 cup mayonnaise", "1 cup sour cream", "1/2 cup chopped fresh cilantro", "6 tablespoons fresh lime juice", "4 green onions, finely chopped", "2 tablespoons minced seeded jalapeño chile", "1/2 teaspoon cayenne pepper", "2 pounds ground beef", "1 small onion, chopped (about 1 1/4 cups)", "1/4 cup chopped fresh parsley", "2 tablespoons Worcestershire sauce", "1 tablespoon chopped seeded jalapeño chile", "1 teaspoon salt", "1 teaspoon ground black pepper", "1/4 teaspoon cayenne pepper", "1/3 cup light corn syrup", "2 tablespoons Worcestershire sauce", "2 tablespoons ketchup", "1 teaspoon instant coffee crystals", "2 teaspoons (packed) golden brown sugar", "3 tablespoons butter", "", "16 bacon slices", "", "Nonstick vegetable oil spray", "8 hamburger buns or 3- to 4-inch square focaccia rolls, split horizontally", "8 lettuce leaves", "2 cups coarsely shredded sharp white cheddar cheese", "Assorted additional toppings (such as tomato and grilled onion slices)"], "instructions": ["Whisk all ingredients in medium bowl to blend. Season sauce with salt and pepper.", "Gently mix all ingredients in large bowl. Form mixture into eight 1/2- to 3/4-inch-thick patties. Place on small baking sheet. Cover and chill at least 2 hours and up to 1 day.", "Stir first 5 ingredients in small saucepan over medium heat until coffee is dissolved. Remove from heat. Whisk in butter. Season glaze to taste with salt and pepper.", "Prepare barbecue (medium-high heat). Working in batches if necessary, cook bacon in large skillet over medium-high heat until crisp and brown. Transfer bacon to paper towels to drain.", "Spray grill rack with nonstick spray. Toast buns until golden, about 2 minutes per side. Transfer buns, cut side up, to plates. Place lettuce on each bun bottom. Grill burgers 5 minutes, basting with glaze. Turn burgers, baste with glaze, and grill until cooked to desired doneness, about 5 minutes longer for medium. Press cheese atop each burger and allow cheese to melt. Place some sauce, then 1 burger on each bun bottom. Top each with 2 slices bacon and desired additional toppings. Cover with bun top. Serve with remaining sauce."]}, "JoAnne's Apricot Bars": {"ingredients": ["Nonstick vegetable oil spray", "1 cup all purpose flour", "1/4 cup sugar", "Pinch of salt", "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes", "2/3 cup (packed) dried apricot halves (about four ounces), coarsely chopped", "", "1/3 cup all purpose flour", "1/2 teaspoon baking powder", "1/4 teaspoon salt", "2 large eggs", "1 cup (packed) golden brown sugar", "1/2 teaspoon vanilla extract", "1/2 cup chopped toasted walnuts", "", "Powdered sugar"], "instructions": ["Preheat oven to 350°F. Spray 8x8x2-inch glass baking dish with nonstick spray. Blend flour, sugar, and salt in processor. Add butter; using on/off turns, process until coarse meal forms. Press crumbs firmly onto bottom of dish. Bake until center is golden, about 25 minutes. Maintain oven temperature.", "Place apricots in small saucepan; add enough water to cover. Boil until soft, about 4 minutes; drain and set aside.", "Sift flour, baking powder, and salt into small bowl. Using electric mixer, beat eggs in large bowl. Add brown sugar and vanilla; beat until thick. Stir in flour mixture, then nuts and apricots. Spread over shortbread.", "Bake cookie until puffed, dark brown, and toothpick inserted into topping comes out with small moist crumbs attached, about 35 minutes. Cool in dish.", "Cut cookie into 6 strips, then crosswise into thirds. Transfer to waxed paper. Sift powdered sugar over bars."]}, "Jasmine Whipped Cream": {"ingredients": ["1 cup heavy whipping cream", "1 tablespoon good-quality loose-leaf jasmine tea or three jasmine tea bags", "", "1 tablespoon sugar"], "instructions": ["Combine chilled cream and tea in bowl. Cover; chill overnight or up to 2 days.", "Strain cream-tea mixture through fine strainer into mixing bowl; discard solids. Add sugar; beat until peaks form."]}, "Johnnycakes with Peekytoe Crab": {"ingredients": ["9 ounces fresh peekytoe crabmeat or other fresh crabmeat", "3/4 cup mayonnaise", "1/3 cup chopped fresh chives", "1 1/2 tablespoons fresh lemon juice", "", "1 1/3 cups whole milk", "1 1/3 cups water", "3/4 cup plus 2 tablespoons polenta or coarsely ground cornmeal", "1 tablespoon butter", "1/2 teaspoon salt", "", "Vegetable oil"], "instructions": ["Mix crabmeat, mayonnaise, chives, and lemon juice in medium bowl to blend. Season to taste with salt and pepper. Cover and refrigerate. Do Ahead: Can be made 8 hours ahead. Keep refrigerated.", "Bring milk and 1 1/3 cups water to boil in heavy large saucepan over medium-high heat. Gradually whisk in polenta, then butter and salt. Remove batter from heat; let stand 10 minutes, stirring occasionally.", "Lightly butter large rimmed baking sheet. Heat large nonstick griddle or skillet over medium-high heat. Brush lightly with vegetable oil. Working in batches, spoon 1 tablespoonful batter for each cake onto griddle, spreading slightly with back of spoon. Cook until cakes are golden brown on bottom and firm at edges, about 2 minutes. Turn cakes over and cook until firm and golden brown, about 1 minute longer. Transfer to prepared baking sheet. Do Ahead: Can be made 8 hours ahead. Cool, then cover with foil and refrigerate. Rewarm, covered, in 350°F oven until hot, about 7 minutes.", "Divide johnnycakes among 8 plates. Top johnnycakes with crab mixture."]}, "Jerusalem Artichoke and Arugula Salad with Parmesan": {"ingredients": ["2 tablespoons orange juice", "1 tablespoon plus 1 teaspoon red wine vinegar", "1 teaspoon Dijon mustard", "5 tablespoons extra-virgin olive oil", "", "1 pound Jerusalem artichokes, trimmed, peeled, thinly sliced", "1 5-ounce bag arugula", "2 ounces Parmesan cheese, shaved"], "instructions": ["Whisk orange juice, vinegar, and mustard in small bowl to blend. Gradually whisk in oil. Season vinaigrette to taste with salt and pepper. DO AHEAD Can be made 1 day ahead. Cover and refrigerate.", "Combine Jerusalem artichokes, arugula, and Parmesan in large bowl. Drizzle with vinaigrette and toss to coat. Divide among 6 plates and serve."]}, "Jerk Pork Tenderloin": {"ingredients": ["1 tablespoon espresso coffee beans", "1 1/4 teaspoons whole allspice", "3/4 teaspoon mustard seeds", "3/4 teaspoon ground cinnamon", "3/4 teaspoon ground nutmeg", "1 bunch green onions, chopped", "1 cup chopped fresh parsley", "1/4 cup fresh lime juice", "1/4 cup fresh lemon juice", "3 garlic cloves", "2 tablespoons olive oil", "1 tablespoon chopped fresh oregano", "2 teaspoons chopped fresh thyme", "1 teaspoon grated lemon peel", "1 teaspoon chopped seeded habanero chile", "2 1/2 pounds pork tenderloins"], "instructions": ["Stir first 5 ingredients in small skillet over medium heat until fragrant, about 30 seconds. Finely grind spice mixture in spice grinder; transfer to processor. Add all remaining ingredients except pork; blend until wet paste forms. Place pork in large glass baking dish and coat with paste. Cover; chill overnight.", "Preheat oven to 400°F. Transfer pork coated with paste mixture to rimmed baking sheet. Roast pork until thermometer inserted into center registers 150°F for medium, about 35 minutes. Slice pork and serve."]}, "Jade Dumplings with Soy-Sesame Dipping Sauce": {"ingredients": ["1/3 cup soy sauce", "1 green onion, very thinly sliced", "2 tablespoons rice vinegar", "2 teaspoons oriental sesame oil", "1 tablespoon minced fresh ginger", "1 garlic clove, peeled", "12 ounces fresh asparagus, trimmed, quartered crosswise", "1 8-ounce can whole water chestnuts, drained", "3 green onions, quartered", "1 teaspoon oriental sesame oil", "1 teaspoon soy sauce", "1/4 teaspoon coarse kosher salt", "", "All purpose flour", "36 wonton wrappers", "", "Romaine lettuce leaves"], "instructions": ["Stir all ingredients in small bowl to blend.", "Finely mince ginger and garlic in food processor. Add asparagus and next 5 ingredients; using on/off turns, process until asparagus is finely chopped but not pureed.", "Sprinkle baking sheet with flour. Place 1 wonton wrapper on work surface. Spoon 2 teaspoons asparagus mixture into center. Moisten edges of wrapper with water; gather corners together over filling. Twist edges of wrapper together, enclosing filling completely. Place dumpling on baking sheet. Repeat with remaining wrappers and filling. DO AHEAD: Sauce and dumplings can be made 8 hours ahead. Cover separately and chill.", "Place steamer rack in large pot. Pour enough water into pot to reach depth of 1/2 inch. Line steamer rack with lettuce leaves. Bring water to simmer. Working in batches, arrange dumplings side by side (but not touching) on rack. Cover and steam 15 minutes.", "Serve dumplings with dipping sauce."]}, "Jam Pancakes Flamed with Kirsch": {"ingredients": ["1 cup cherry preserves", "1 tablespoon fresh lemon juice", "1 tablespoon kirsch (clear cherry brandy)", "3 large eggs", "1/2 cup plus 1 tablespoon whole milk", "1/2 cup plus 1 tablespoon water", "3 tablespoons corn oil", "1/2 teaspoon vanilla extract", "1/8 teaspoon almond extract", "Pinch of salt", "1/4 cup plus 1 tablespoon sugar", "3 tablespoons plus 1/3 cup kirsch", "1 cup unbleached all purpose flour", "", "Additional corn oil", "", "1/4 cup (1/2 stick) unsalted butter, melted", "", "1/4 cup slivered almonds, toasted"], "instructions": ["Mix preserves, lemon juice, and 1 tablespoon kirsch in small bowl.", "Combine first 7 ingredients, 1/4 cup sugar, and 3 tablespoons kirsch in blender. Blend until smooth. Add flour and blend until smooth. Let batter stand 1 hour.", "Stir batter to blend. Lightly brush 7- to 8-inch-diameter nonstick skillet with oil; heat over medium heat. Using 3 tablespoons batter for each pancake, add batter to skillet and quickly tilt pan to coat bottom completely (pancake will be thin). Cook pancake until light golden on bottom, about 30 seconds. Turn pancake over and cook until bottom is pale golden, about 20 seconds. Transfer to plate. Repeat with remaining batter, brushing skillet lightly with oil before cooking each pancake and stacking pancakes on plate between sheets of waxed paper.", "Butter 13x9x2-inch broilerproof baking dish. Place 1 pancake on work surface, pale side up. Spread scant 2 tablespoons filling over half of pancake. Fold other half of pancake over filling, then fold in half again, forming triangle. Repeat with 7 more pancakes and remaining filling. Arrange pancakes in prepared baking dish. DO AHEAD Can be prepared 6 hours ahead. Cover tightly and refrigerate. Bring to room temperature before continuing.", "Preheat broiler. Drizzle melted butter over pancakes; sprinkle with 1 tablespoon sugar. Broil just until edges of pancakes are brown, about 2 minutes.", "Warm remaining 1/3 cup kirsch in small saucepan over low heat. Remove from heat. Using long match, carefully ignite kirsch; pour over pancakes. Divide pancakes among 4 plates. Sprinkle with almonds and serve."]}, "Jamaican Jerk Burgers with Orange-Chipotle Mayonnaise ": {"ingredients": ["1 cup mayonnaise", "3 tablespoons orange juice", "1 tablespoon minced canned chipotle chilies*", "1 bunch green onions, coarsely chopped (about 1 1/2 cups)", "1 tablespoon chopped fresh thyme", "1 small habañero chili or 2 medium jalapeño chilies, seeded, chopped", "1 garlic clove, peeled", "1/2 cup (packed) golden brown sugar", "1/2 cup vegetable oil", "1/2 cup soy sauce", "1 teaspoon ground allspice", "2 pounds ground beef (15% fat)", "", "6 sesame-seed hamburger buns, toasted", "1 onion, thinly sliced", "3 tomatoes, sliced", "6 romaine lettuce leaves"], "instructions": ["Mix all ingredients in small bowl. Season to taste with salt and pepper.", "Finely chop first 4 ingredients in processor. Add sugar and next 3 ingredients; process until almost smooth. Season with salt and pepper.", "Prepare barbecue (medium-high heat). Set aside 3/4 cup jerk sauce. Shape ground beef into six 1/2- to 3/4-inch-thick patties; place in 13x9x2-inch glass baking dish. Pour 1/2 cup jerk sauce over patties and turn to coat; let stand 20 minutes.", "Sprinkle patties with salt and pepper. Grill to desired doneness, brushing occasionally with remaining jerk sauce, about 4 minutes per side for medium.", "Spread mayonnaise over cut surfaces of buns. Place burgers on bottom halves of buns. Top with onion slices, tomato slices, lettuce, and bun tops. Serve, passing reserved 3/4 cup jerk sauce separately."]}, "Javanese Roasted Salmon and Wilted Spinach": {"ingredients": ["1/2 cup (1 stick) plus 3 tablespoons unsalted butter", "1 teaspoon dried crushed red pepper", "1 large garlic clove, minced", "1/2 cup (packed) golden brown sugar", "1/2 cup fresh lime juice", "1/2 cup soy sauce", "2 teaspoons cornstarch dissolved in 2 teaspoons water", "", "8 7-ounce salmon fillets", "", "2 6-ounce bags baby spinach"], "instructions": ["Preheat oven to 400°F. Melt 1/2 cup butter in heavy large saucepan over medium heat. Add crushed red pepper and garlic and stir until fragrant, about 1 minute. Add sugar; whisk until mixture is melted and smooth and begins to bubble, about 4 minutes. Whisk in lime juice and soy sauce. Increase heat and boil until reduced to 1 1/2 cups, about 2 minutes. Add cornstarch mixture and boil until thick, about 3 minutes. Set sauce aside.", "Melt 1 tablespoon butter in heavy large skillet over high heat. Working in batches, cook salmon until golden brown, about 2 minutes per side. Transfer to baking sheet. Spoon 1 tablespoon sauce over each fillet. Roast until fish is opaque in center, about 5 minutes.", "Melt remaining 2 tablespoons butter in large pot over medium-high heat. Add spinach and toss until wilted but still bright green, about 3 minutes. Season to taste with salt and pepper. Using tongs, divide spinach among 8 plates. Top each with salmon fillet; drizzle with remaining sauce and serve."]}, "Jerked Shrimp with Melon Salsa ": {"ingredients": ["6 large uncooked shrimp, peeled, deveined", "3 tablespoons olive oil", "4 teaspoons fresh lime juice", "2 teaspoons jerk or Carribbean-style seasoning blend", "", "3/4 cup diced cantaloupe", "3/4 cup diced honeydew melon", "1/4 cup chopped fresh cilantro", "1/4 cup diced red onion", "", "4 lime wedges"], "instructions": ["Prepare barbecue (medium heat). Toss shrimp, oil, 2 teaspoons lime juice, and jerk seasoning blend in medium bowl. Let marinate 10 minutes.", "Meanwhile, toss cantaloupe, honeydew, cilantro, red onion, and remaining 2 teaspoons lime juice in medium bowl. Season salsa to taste with salt and pepper.", "Thread shrimp onto metal skewers. Grill until opaque in center, occasionally brushing with marinade, about 5 minutes. Serve with salsa and lime wedges."]}, "Jasmine Rice with Green Onions, Peas and Lemon": {"ingredients": ["1 3/4 cups water", "1 1/4 cups jasmine rice, rinsed well, drained, or long-grain white rice", "1/2 teaspoon salt", "", "1/2 cup shelled fresh or frozen peas", "", "2 tablespoons extra-virgin olive oil", "6 green onions, thinly sliced", "2 tablespoons fresh lemon juice", "2 tablespoons chopped fresh parsley", "1 tablespoon grated lemon peel"], "instructions": ["Combine 1 3/4 cups water, rice and salt in large saucepan. Bring to boil over high heat. Reduce heat to low; cover and cook until rice is tender, about 15 minutes. Remove from heat. Let stand covered 15 minutes. Fluff with fork. Cool.", "Cook peas in medium saucepan of boiling salted water 1 minute. Drain. Rinse under cold water. Drain.", "Heat oil in large nonstick skillet over medium-high heat. Add all but 2 tablespoons green onions; sauté 30 seconds. Add rice and sauté until heated through, stirring to break pieces, about 4 minutes. Add peas, lemon juice, parsley and lemon peel. Sauté 2 minutes to blend flavors. Transfer to serving bowl. Sprinkle with remaining green onions."]}, "Jalapeño-Monterey Jack Grits": {"ingredients": ["1 tablespoon butter", "1 red bell pepper, cut into 1-inch strips (about 1 1/2 cups)", "1 yellow bell pepper, cut into 1-inch strips (about 1 1/2 cups)", "1 tablespoon minced seeded jalapeño chili", "1 garlic clove, minced", "3 cups chicken stock or canned low-salt chicken broth", "1 cup whipping cream", "1 cup quick-cooking grits", "1 1/2 cups grated hot pepper Monterey Jack cheese (about 6 ounces)"], "instructions": ["Melt butter in heavy medium skillet over medium-high heat. Add both peppers, jalapeño, and garlic; sauté until peppers are tender, about 5 minutes.", "Bring stock and cream to boil in heavy large saucepan. Add grits in thin stream, whisking constantly. Whisk until grits are cooked and mixture thickens, about 6 minutes. Add sautéed pepper mixture and cheese; stir until cheese melts. Season with salt and pepper."]}, "Jalapeño-Cheddar Frittata": {"ingredients": ["Nonstick vegetable oil spray", "1 pound extra-sharp white cheddar cheese, grated (about 4 cups)", "1 cup chopped drained pickled jalapeño chilies from jar, 5 tablespoons liquid reserved", "3/4 cup chopped drained oil-packed sun-dried tomatoes", "1/2 cup (packed) chopped fresh basil", "18 large eggs"], "instructions": ["Preheat oven to 350°F. Spray 15x10x2-inch glass baking dish with nonstick spray. Sprinkle cheese evenly over bottom of dish. Sprinkle chilies, sun-dried tomatoes and basil over cheese. Using electric mixer, beat eggs in large bowl until pale and slightly thickened, about 8 minutes. Beat in reserved 5 tablespoons jalapeño liquid. Pour egg mixture into dish.", "Bake frittata until firm, about 30 minutes. Cool slightly. Cut into 24 squares. Cut each square diagonally in half.", "DO AHEAD: Can be made 1 day ahead. Cover; chill. Reheat in 350°F oven 10 minutes. Serve warm."]}}