{"Neck of lamb stuffed with cannellini beans and hazelnuts": {"ingredients": ["4 tbsp extra virgin olive oil, plus extra for greasing", "5 garlic cloves, peeled, chopped", "2 sprigs fresh rosemary, leaves only, chopped", "800g/1lb 12¼oz canned cannellini beans, drained, rinsed", "50g/2oz shelled hazelnuts, toasted, skins removed ", "salt and freshly ground black pepper", "250-300g/9-10½oz cavolo nero, stalks removed", "1.2kg/2lb 10¼oz lamb neck fillets, each butterflied, then beaten out to 15cm x 30cm x 2cm/6in x 12in x 1in rectangles using a meat mallet"], "instructions": ["Preheat the oven to 220C/430F/Gas 7.", "Heat the oil in a saucepan over a medium heat and fry the garlic and rosemary for 2-3 minutes. Once the garlic is pale golden-brown, add the drained beans. Continue to heat, stirring regularly, for 10-12 minutes, or until the beans begin to break down. ", "Stir in the hazelnuts and season, to taste, with salt and freshly ground black pepper. Mash the mixture lightly, using a fork, then spoon onto a plate and set aside to cool.", "Blanch the cavolo nero in a pan of boiling, salted water for four minutes. Drain well and, when cool enough to handle, gently squeeze to remove any excess water.", "Lay each flattened rectangle of neck fillet onto a large piece of cling film and season, to taste, with salt and freshly ground black pepper. Arrange a layer of cavolo nero leaves onto each neck fillet and divide the bean mixture between them. Wet your hands and, using the flats of your palms, press the mixture down to form a compact, even layer.", "Starting with the short edge of the rectangle of lamb, gently but firmly roll up the lamb, using the cling film to keep the shape tight and even, until the lamb forms a neat roll.", "Remove the cling film and tie 3-4 pieces of string around each lamb fillet to hold it in place. (NB: If making in advance, cover the rolled lamb with cling film and store in the fridge overnight. Remove from the fridge 3-4 hours before cooking.)", "Place the stuffed lamb fillets onto a lightly oiled baking tray and season, to taste, with salt and freshly ground black pepper. Transfer to the oven and cook on the top shelf for 20-25 minutes (for medium), or until cooked to your liking. Once cooked, remove from the oven, cover with aluminium foil and set aside to rest for at least 10 minutes.", "To serve, carve the rolled, stuffed lamb into slices and divide the slices equally among six serving plates."]}, "Nimki": {"ingredients": ["275g/9¾oz plain flour, plus extra for dusting", "1 tsp salt", "3 tsp Sichuan peppercorns, crushed", "125g/4½oz cold butter or ghee, diced", "vegetable oil, for deep-frying", "80g/2¾oz pistachios, shelled and finely chopped, to decorate", "2 oranges, juice only", "125g/4½oz sugar"], "instructions": ["For the nimki, sift 250g/9oz of the flour into a bowl. Add the salt, peppercorns and 100g/3½oz of the butter (or ghee) to the dry ingredients. Rub the ingredients together until you reach a breadcrumb-like texture.", "Gradually add 100ml/3½fl oz cold water, continuing to mix with your hands until the dough comes together. Leave the dough to rest for 5 minutes. Beat together the remaining 25g/1oz butter and flour until it becomes a smooth, spreadable consistency.", "For the syrup, pour the juice of the oranges and the sugar into a small saucepan and bring to the boil. Simmer gently for about 15 minutes, or until the liquid has thickened to a syrup. Take off the heat and leave to cool.", "Dust a clean surface with a little flour and roll the rested dough into a rectangle (about 30x15cm/12x5in). Spread the butter and flour mixture over the surface of the dough and then roll up the dough to form a long cylinder. ", "Cut the roll into 10 equal pieces and place them cut-side down on a lightly floured surface. Take each one in turn and press with your palm to make a small circle. Fold the circle in half and then in half again to make a triangular shape. Squeeze the edges together. Repeat the process with the remaining pieces of dough.", "Heat a large, deep saucepan two-thirds filled with vegetable oil to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Gently lower a few nimki into the hot oil and fry for about 7 minutes, or until golden brown and puffed up. Using a slotted spoon, carefully transfer to a plate lined with kitchen paper to soak up any excess oil. Repeat with the remaining nimki. ", "When the nimki are cool, dip them in the orange syrup, sprinkle with pistachios and serve. "]}, "Norwegian custard buns (skolebrød)": {"ingredients": ["40g/1½oz butter", "285ml/9½fl oz milk", "1 x 7g sachet fast-acting yeast", "85g/3oz caster sugar", "425g/15oz plain flour", "1½ tsp ground cardamom", "oil, for greasing", "200g/7oz raspberries", "200g/7oz granulated sugar", "100ml/3½fl oz milk", "150ml/5fl oz double cream", "2 free-range egg yolks", "55g/2oz caster sugar", "1 tsp vanilla extract", "1 tbsp cornflour", "1 free-range egg, lightly beaten, for glazing", "6 tbsp icing sugar", "55g/2oz desiccated coconut "], "instructions": ["For the dough, melt the butter in a pan over a low heat and add the cold milk, heating until just tepid. Stir in the yeast and sugar and leave for 10 minutes.", "Mix together the flour and cardamom in the bowl of a free-standing electric mixer fitted with a dough hook.", "Add the yeast mixture and knead with the dough hook until the dough begins to pull away from the bowl.", "Place the dough in a large greased bowl, cover with oiled cling film and leave to rise until doubled (about 1-1½ hours). Take care not to over-prove the buns as otherwise they may collapse.", "For the raspberry jam, add the raspberries and sugar to a large pan and bring to the boil until thickened. ", "Transfer to a large heatproof bowl and leave to cool. When cooled, set aside in the fridge until needed.", "For the custard, warm the milk and cream in a pan until simmering.", "Whisk together the egg yolks, sugar and vanilla extract in another bowl. Whisk in the cornflour.", "Slowly pour the hot milk mixture into the egg mixture, whisking continuously, then return to the pan.", "Cook over a very low heat, stirring constantly until thickened enough to coat the back of a spoon.", "Transfer to a heatproof bowl and set aside to cool. When cooled, set aside in the fridge until needed.", "Turn the dough out onto a lightly floured surface and knock back, lightly kneading until smooth. Roll into a sausage and cut into 12 equal pieces.  Shape into balls and place on a baking tray and cover with oiled cling film. Leave to prove for about 30 minutes.", "Preheat the oven to 200C/fan oven 180C/400F/Gas 6.", "When risen, press down an egg-sized indentation into each bun and fill with the custard. Brush the bun with beaten egg.", "Bake for 20 minutes, or until golden-brown. Transfer to a wire rack to cool.", "Combine the icing sugar with one teaspoon of water to make a glaze. ", "Brush the glaze onto the buns around the custard centre. Dip the glazed part of each bun into the coconut.", "Finish by placing a little jam on top of the custard and serve."]}, "Noodles with beansprouts and ham": {"ingredients": ["450g/1lb egg noodles (dried or fresh)", "dash sesame oil", "450g/1lb fresh beansprouts, ends removed", "50g/2oz shredded cured ham or lean English smoked bacon", "300ml/10fl oz chicken stock", "2 tbsp dark soy sauce", "1 tbsp light soy sauce", "2 tbsp Shaoxing rice wine (or dry sherry)", "1½ tbsp finely chopped garlic", "3 tbsp finely chopped spring onion", "1 tsp salt", "½ tsp freshly ground white pepper", "2 tsp sesame oil "], "instructions": ["Bring a pan of water to the boil and cook the noodles for 3–5 minutes. Drain and immerse in cold water. Drain again, then toss with sesame oil. Set aside.", "Heat a large wok or pan until hot. Add all the sauce ingredients, except for the sesame oil and bring to a simmer. Turn down the heat, add the noodles and toss well. ", "Turn the heat back to high and add the beansprouts and ham and another dash of sesame oil. Stir-fry for 3 minutes, or until the noodles are thoroughly heated. Tip onto a warm platter and serve."]}, "No-churn blueberry and lemon ice cream": {"ingredients": ["500g/1lb 2oz frozen blueberries, plus extra for garnish", "500g/1lb 2oz  fat-free Greek yoghurt", "125g/4½oz icing sugar, plus extra to decorate", "2 lemons, grated rind and 1 tbsp juice"], "instructions": ["Place the blueberries in a food processor or blender with the yoghurt, icing sugar, lemon rind and juice and process until smooth.", "Spoon the mixture into a freezer-proof container and freeze.", "When the mixture is softly frozen and easily spoonable, serve with a few blueberries and a sprinkling of icing sugar. "]}, "N’duja-crusted cod with broccoli": {"ingredients": ["1 tbsp sultanas", "2 tsp muscatel vinegar      ", "1 slice white bread ", "4 tbsp finely chopped flatleaf parsley", "1 tbsp capers, drained, finely chopped", "2 anchovies, drained, finely chopped                    ", "1 egg, hard-boiled, cooked white only, finely chopped", "½ tbsp fennel seeds", "110g/4oz N’duja (spreadable French pork sausage)                       ", "300g/11oz broccoli, washed and trimmed into florets", "4 x 175g/6oz cod fillets", "salt and freshly ground black pepper", "2 tbsp extra virgin olive oil                    ", "1 garlic clove, finely julienned", "1 red chilli, finely julienned", "1 tbsp pine nuts    "], "instructions": ["Soak the sultanas overnight in the vinegar. ", "The next day, remove the sultanas from the vinegar using a slotted spoon and set aside. Soak the slice of bread in the same vinegar. When soaked, squeeze out any excess liquid.", "Pound the soaked bread, parsley, capers, anchovies, cooked egg white, fennel seeds and N’Duja in a pestle and mortar to a paste. ", "Spread the paste between two sheets of greaseproof paper and chill in the fridge until firmed up.", "Preheat the oven to 200C/400F/Gas 6.", "Blanch the broccoli florets in a pan of salted, boiling water for 3-4 minutes, or until tender. Drain well and set aside to cool.", "When the paste has firmed up, season the cod fillets on both sides with salt and freshly ground black pepper. Cut the layer of paste into four pieces that are the same size as each cod fillet. Place one on top of each piece of cod. ", "Place the N’duja-crusted cod fillets onto a baking tray and roast in the oven for 6-8 minutes. ", "Meanwhile, heat one tablespoon of the extra virgin olive oil in a frying pan and fry the garlic and chilli until the garlic is golden-brown. Add the pine kernels, reserved soaked sultanas and the broccoli and stir-fry for 1-2 minutes, or until warmed through.  Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the broccoli mixture into the centre of four serving plates. Place one N’duja-crusted cod fillet on top of each portion.", "In a bowl, whisk together the pan juices and the remaining tablespoon of olive oil until emulsified (well combined). Drizzle the sauce over the cod."]}, "Neapolitan baked Alaska": {"ingredients": ["1 litre/1¾pint vanilla ice cream", "1 litre/1¾pint strawberry ice cream ", "1 litre/1¾pint chocolate ice cream", "2 large free-range eggs", "50g/1¾oz caster sugar", "30g/1oz self-raising flour ", "20g/¾oz cocoa powder", "20g/¾oz butter, melted", "225g/8oz caster sugar", "4 large free-range egg whites ", "pink gel paste food colouring", "yellow gel paste food colouring", "mixed berries, to decorate"], "instructions": ["Line a 3 litre/5¼pint pudding bowl with cling film.  In a large bowl or a freestanding mixer, beat the vanilla ice cream to soften a little then spoon into the base of the pudding bowl.  Level with a spatula and freeze for one hour, or until firm. ", "Wipe out the mixing bowl and add the strawberry ice cream. Beat to soften a little then spoon over the vanilla ice cream.  Level with a spatula and freeze for one hour, or until firm.", "Preheat the oven to 190C(170C fan)/375F/Gas 5. Lightly grease a 20cm/8in sandwich tin and line the base with baking parchment. ", "For the sponge base, place the eggs and sugar into a large bowl and beat at full speed with an electric whisk until the mixture is pale in colour and thick enough to just leave a trail when the whisk is lifted. ", "Sift the flour and cocoa powder over the surface of the mixture and gently fold in with a metal spoon or spatula. Pour the melted butter down the side of the bowl and gently fold in. ", "Pour into the prepared tin and tilt the tin to allow the mixture to spread evenly to the sides. Bake for about 10–12 minutes, or until springy to the touch and beginning to shrink from the sides of the tin. Turn out and leave to cool on a wire rack. ", "For the filling, in a large bowl or mixer, beat the chocolate ice cream to soften a little then spread over the strawberry ice cream. Level with a spatula and freeze for one hour, or until firm.", "Place the cold sponge on an ovenproof serving dish.  Turn the ice cream out onto the sponge and pop it back in the freezer while you are making the meringue. ", "Preheat the oven to 240C(220C fan)/460F/Gas 8½.  ", "To make the meringue, place the sugar and six tablespoons of water in a heavy-based saucepan. Stir the sugar and water over a medium heat until the sugar dissolves, then bring to a fast boil until it reaches 110C/230F.", "Whisk the egg whites in a large bowl of an electric mixer until stiff peaks form when the whisk is removed. ", "When the syrup temperature reaches 115C/240F on a sugar thermometer, slowly and carefully pour the syrup over the egg whites in a thin stream while continuing to whisk. Taking care not to let the syrup run onto the beaters as it may splash.", "Continue whisking for about 15 minutes, or until the meringue is completely cold. ", "Take the cake and ice cream from the freezer and remove the cling film.  Using a palette knife, spread a thin layer of meringue all over the ice cream and sponge to form a coating. ", "Fit a large disposable piping bag with a 2D star nozzle. Using a paint brush or small pastry brush, paint a line of pink gel paste up the inside of the bag in a line from the nozzle to the top. Repeat on the opposite side with the yellow gel paste. Spoon the meringue into the piping bag. ", "Starting from the top of the dome of ice cream and working quickly, pipe small rosettes of meringue over the dome of ice cream, until completely covered. ", "Bake in the preheated oven for about 4-5 minutes, or until golden-brown. Decorate with mixed berries and serve immediately. "]}, "Nine-hour pork shoulder with pineapple relish": {"ingredients": ["3 tbsp hot smoked paprika", "3 tbsp sweet smoked paprika ", "3 tbsp brown sugar", "3 tbsp garlic powder ", "1 tbsp ground cumin", "1 tbsp ground coriander ", "4 tbsp runny honey", "2 tbsp apple juice ", "2kg/4lb 8oz boneless pork shoulder", "1 tbsp vegetable oil", "2 shallots, peeled and diced ", "1 fresh pineapple, flesh chopped into small chunks", "1 tsp wholegrain mustard", "50ml/2fl oz apple cider vinegar ", "150g/5½oz soft light brown sugar ", "salt and fresh ground black pepper", "6 spring onions, trimmed and finely sliced", "4 Thai shallots, peeled and finely sliced", "1 small bunch coriander, finely chopped", "1 small bunch Thai basil, finely chopped", "1 small bunch mint, finely chopped", "3 large red chillies, finely sliced", "1 small Thai red chilli, finely sliced", "2 limes, juice only", "2 tbsp rapeseed oil ", "1 tsp Thai fish sauce, plus extra to taste"], "instructions": ["For the pork shoulder, mix the paprikas, sugar, garlic powder, cumin, coriander, honey and apple juice in a small bowl. Rub the marinade thoroughly all over the pork shoulder. Cover and leave to marinate in the fridge for 24 hours. ", "Preheat the oven to 150C/130C Fan/Gas 2. Cover the pork in foil, place in a roasting tin and slow roast for 8 hours. Leave to rest for 1 hour before tearing apart with forks. ", "For the pineapple relish, heat the oil in a saucepan and sweat the shallots for 5 minutes. Add the pineapple, mustard, vinegar and sugar and simmer for 1–2 hours, or until soft and syrupy. Season with salt and pepper. ", "For the Thai garnish, mix the spring onions, shallots, herbs, chillies and lime juice in a bowl. Place half of this mixture in a blender or food processor. Blitz with the oil and fish sauce. Taste and add more fish sauce, if preferred. ", "To serve, spread the Thai purée on the base of a serving board and add the pulled pork on top. Scatter over the rest of the Thai garnish and drizzle over a few drops of the Thai fish sauce. Serve with the relish alongside. "]}, "Nigella's jam roly-poly": {"ingredients": ["250g/8oz self-raising flour", "pinch salt", "50g/2oz light brown sugar", "125g/4oz shredded suet (vegetarians may substitute vegetarian suet)", "6-8 tbsp water", "5 tbsp raspberry jam, warmed", "milk, for brushing", "1 free-range egg, beaten ", "demerara sugar, to glaze", "custard, to serve"], "instructions": ["Preheat the oven to 200C/400F/Gas 6.", "Sift the flour into a bowl with the salt and add the light brown sugar. Add the suet and just enough water to create a soft, but not sticky, dough.", "Place the dough onto a floured work surface and roll out into a rectangle about 20cm/8in x 30cm/12in.", "Brush one side of the pastry with the warmed raspberry jam, leaving a 1cm/½in border all around the edge. Fold the jamless border in and brush with milk.", "With the short side of the pastry sheet towards you, roll up the pastry loosely and seal the ends well.", "Place the pastry roll onto a greased baking sheet with the sealed edge underneath.", "Brush the pastry roll all over with beaten egg and sprinkle with demerara sugar.", "Place into the oven to bake for 35-40 minutes, or until golden-brown and cooked through.", "Remove from the oven and sprinkle on a little more demerara sugar.", "To serve, place generous slices of the roly-poly into bowls and serve hot with custard."]}, "Nikki Lilly's sausage rolls": {"ingredients": ["drizzle olive oil, plus extra for greasing", "1 red onion, finely chopped ", "1 garlic clove, crushed or grated", "400g/14oz sausage meat", "handful fresh mixed herbs, such as coriander, basil or parsley", "2 tbsp yeast extract", "90g/3oz cheddar, grated ", "400g/14oz ready-made puff pastry", "1 egg, lightly beaten\t", "1½ tbsp poppy seeds"], "instructions": ["Preheat the oven to 200C/180C Fan/Gas 6. Grease a baking sheet and line with baking paper.", "Heat the olive oil in a large frying pan over a medium heat, add the onion and cook for 3 minutes. Add the garlic and cook for a further couple of minutes until softened. Cool slightly and tip into a large bowl. Stir in the sausage meat, chopped herbs, ¾ tablespoon of the yeast extract and the cheese until well combined.", "Roll out the puff pastry on a lightly floured surface until it’s a little bit wider and longer than A4 paper (32x22cm/12½x8½in). Using a knife, cut the pastry lengthways to make two long pieces. Brush the remaining yeast extract down the length of each pastry strip.", "Roll the meat into two long sausage shapes, the same length as the pastry, and place on top of each strip. Brush the egg on the outer edges of the pastry and fold it over to cover the sausage. Press down the sides so they stick together and use a fork to crimp the edges. Reserve the remaining egg.", "Cut each roll into 6 equal pieces and score some light diagonal slits on the top. Space out evenly on the baking tray. Brush the sausage rolls with the remaining egg and sprinkle with poppy seeds.  ", "Bake for 30 minutes until golden brown. Leave to cool for 10 minutes."]}, "Noodle soup with teriyaki beef and toasted cashews": {"ingredients": ["1 tbsp sesame oil", "1 tbsp soy sauce", "2.5cm/1in piece fresh ginger, peeled and finely sliced", "pinch chilli flakes", "150ml/5fl oz hot vegetable stock", "100g/3½oz ready-cooked udon noodles ", "1 tbsp olive oil", "100g/3½oz beef fillet", "salt and freshly ground black pepper", "1 tbsp soy sauce", "1 tbsp clear honey", "1 tbsp cashew nuts, lightly toasted"], "instructions": ["For the noodle soup, place all the noodle soup ingredients except for the noodles into a saucepan and bring to the boil. Reduce the heat and simmer for five minutes.", "For the teriyaki beef, rub the beef all over with olive oil and season well with salt and freshly ground black pepper.", "Heat a frying pan until hot and fry the beef for 2-3 minutes on each side, or until cooked to your liking. Remove the beef from the pan and set aside to rest in a warm place. Add the soy sauce and honey to the pan and stir, then remove the pan from the heat. ", "Cut the beef into thin slices and stir around in the pan of soy mixture to coat all over in the pan juices.", "To serve, place the noodles into a bowl and pour over the soup. Top with the sliced beef and sprinkle over the cashew nuts."]}, "Noodle salad with chilli nuts": {"ingredients": ["1 tsp vegetable oil", "1 tsp soy sauce", "2 tsp clear honey", "¼ cucumber, peeled, seeds removed, finely chopped", "¼ red pepper, finely chopped", "100g/3½oz egg noodles, cooked according to packet instructions", "salt and freshly ground black pepper ", "1 tsp vegetable oil", "50g/2oz peanuts", "½ tsp salt", "½ tsp chilli flakes"], "instructions": ["For the noodle salad, put the vegetable oil, soy sauce and honey in a large bowl and mix well.", "Add the cucumber, pepper and cooked noodles, season with salt and pepper and mix well.", "For the chilli nuts, heat the vegetable oil in a frying pan over a medium heat and fry the peanuts for 3-4 minutes. Drain off the oil and fry for a further 2-3 minutes, then add the salt and chilli and stir well to coat the nuts.", "Put the noodle salad in a bowl, sprinkle over the nuts and serve. "]}, "Noodle soup with teriyaki cod": {"ingredients": ["600ml/1 pint vegetable or chicken stock", "½ 'cherry bomb' chilli", "125g/4½oz noodles, cooked ", "1 tbsp fresh coriander", "1 pak choi, cut into quarters", "1 lime, juice only", "150g/5½oz cod, skin on", "1 tsp rock salt", "1 tbsp honey", "1 tbsp soy sauce"], "instructions": ["Preheat the oven to 200C/180C Fan/Gas 6.", "To make the noodle soup, in a large saucepan warm the chicken or vegetable stock with the chilli and noodles for five minutes.", "Add the coriander, pak choi and lime and cook for a further two minutes and serve.", "To make the teriyaki cod, in a medium-sized saucepan heat the oil. Place the cod in the saucepan and fry for two minutes.", "Add the rock salt and then turn over and cook on the other side.", "Place the pan into the oven for three minutes.", "Take out and glaze with the honey and the soy.", "Serve on top of the noodle soup."]}, "Nectarine syllabub": {"ingredients": ["100g/3½oz caster sugar ", "50ml/2fl oz water ", "3 nectarines, peeled, stones removed and chopped", "½ a ready-made Madeira cake, sliced", "75ml/3fl oz sweet dessert wine", "100g/3½oz mascarpone cheese", "60g/2oz icing sugar, sieved ", "225ml/8fl oz double cream, whipped until stiff peaks form when the whisk is removed", "1 nectarine, skin left on, stone removed, chopped"], "instructions": ["Heat the caster sugar and water in a pan for 4-5 minutes, until the sugar has dissolved and the liquid forms a syrup. ", "Transfer to a food processor and allow to cool slightly. ", "Add the chopped peeled nectarines, then blend to a puree. Allow to cool.", "Place 1-2 slices of Madeira cake into the bottom of each of four serving dishes or bowls and drizzle some of the wine over each. You should use about half of the wine. ", "Place the mascarpone, icing sugar, the remaining wine and whipped cream into a clean bowl and fold together until smooth.", "Add the nectarine puree and gently stir through the mascarpone mixture to create a marbled effect. ", "Add two thirds of the pieces of unpeeled nectarine and fold through the mixture. ", "To serve, spoon the mixture over the wine-soaked sponge in each bowl and top with a few pieces of the remaining nectarine."]}, "Nduja and potato hash": {"ingredients": ["300g/10oz new potatoes", "2 tbsp vegetable oil", "1 onion, sliced", "75g/3oz 'nduja (available from Italian delis and specialist online retailers)", "1 red chilli, chopped", "200g/7oz Serrano ham, chopped", "1 tbsp capers", "100g/3½oz butter", "8 free-range eggs", "4 slices French bread", "1 tbsp chopped fresh parsley ", "chilli sauce"], "instructions": ["Place the new potatoes in a saucepan, fill with water and bring to the boil. Turn down the heat and simmer until the potatoes are tender. Drain and set aside.", "Heat one tablespoon of oil in two heavy-based frying pans set over a medium heat. Divide the onion between the two pans and fry gently for 10 minutes, or until soft and golden-brown.", "Add half the nduja and chilli to each pan and cook for three minutes. Stir in equal amounts of the Serrano ham, cook for a further three minutes.", "Add half the potatoes, capers and butter to each pan. Let the potatoes brown - keep turning them every so often with a spatula until crisp all over.", "Make two holes in the mixture in each pan. Crack two eggs in each hole, cover with a lid and cook for three minutes until set.", "Meanwhile, toast the bread on a griddle pan until crisp.", "Spoon the hash onto four plates, giving each person two eggs, and sprinkle over the parsley.  Serve with the toast and chilli sauce on the side."]}, "Nargis kebabs": {"ingredients": ["5 free-range eggs, plus 1 egg yolk", "250g minced beef or lamb", "2 garlic cloves, peeled, crushed", "2.5cm/1in piece root ginger, peeled, grated", "½ tsp ground coriander", "½ tsp ground cumin", "½ tsp chilli powder", "¼ tsp ground cloves", "1 tbsp cornflour", "salt", "2 tbsp flour", "2 tbsp sesame seeds", "vegetable oil for shallow frying"], "instructions": ["Bring a large pan of water to the boil and cook 4 of the eggs for 4-5 minutes until they are medium- to hard-boiled. Drain and cool under cold running water (this will prevent the yolks from discolouring). Peel and set aside. Beat the remaining egg in a bowl and set aside.", "In a bowl, mix together the minced beef, garlic, ginger, spices, cornflour and egg yolk until well combined. Season, to taste, with salt.", "Divide the beef mixture evenly into 4 portions. Roll each portion into a ball, then flatten out to form a thin patty. Wrap each patty around the peeled boiled eggs, smoothing out the join and making sure there is no egg left exposed. ", "Roll the scotch eggs in the flour, then dip in the beaten egg and roll in the sesame seeds.", "Half-fill a frying pan with the vegetable oil and heat until hot. (CAUTION: hot oil can be dangerous. Do not leave unattended). Fry the nargis kebabs in small batches for 4-5 minutes, turning the eggs occasionally, or until golden-brown all over and cooked through. Remove from the oil with a slotted spoon and drain on kitchen paper."]}, "No-churn Irish cream ice cream": {"ingredients": ["300ml/10fl oz whipping cream", "125g/4½oz sweetened condensed milk", "2 tbsp Irish cream liqueur", "pinch ground cinnamon"], "instructions": ["Pour the cream into a large bowl and whisk until stiff peaks form.", "Carefully fold in the condensed milk, Irish cream liqueur and cinnamon. ", "Transfer to a lidded container and freeze for 4–6 hours, or until solidified."]}, "Nectarine puff tart with cinnamon and rum cream": {"ingredients": ["1 ready-rolled sheet puff pastry", "1 free-range egg, beaten", "3 large ripe nectarines, thinly sliced ( or peaches or bananas)", "3 tbsp runny honey (or maple syrup or sugar)", "generous dash dark rum (or amaretto)", "large pinch ground cinnamon (or allspice, ground cloves or nutmeg)", "1 lime, zest only, to decorate (or lemon)", "edible flowers, to decorate", "300ml/10fl oz double cream", "1 tsp ground cinnamon  (or allspice, ground cloves or nutmeg)", "generous splash dark rum (or amaretto)", "1 tbsp icing sugar"], "instructions": ["To make the nectarine puff tart, preheat the oven to 220C/200C Fan/Gas 7 and preheat a large baking tray. Lay the pastry sheet out on a sheet of baking paper and roll the pastry edges up to form a 1cm/½in border all around. Brush the border with the beaten egg.", "Mix the nectarine, honey, rum and cinnamon in a bowl. Arrange the mixture in the middle of the pastry. Slide the tart, on its baking paper, on to the baking tray. Bake for 15–20 minutes until the pastry is puffed up and golden. Decorate the tart with the lime zest and edible flowers. ", "To make the cinnamon cream, place all of the ingredients in a large bowl and whip until it forms soft peaks. ", "Cut the tart into slices and serve with the whipped cream. "]}, "Naan bread": {"ingredients": ["250g/9oz plain flour", "2 tsp sugar", "½ tsp salt", "½ tsp baking powder", "120ml/4fl oz milk", "2 tbsp vegetable oil, plus extra for greasing", "nigella seeds, poppy seeds or sesame seeds, or chopped garlic and fresh coriander", "1 tbsp butter, melted, to serve"], "instructions": ["For the dough, sift the flour, sugar, salt and baking powder into a bowl. In another bowl, mix together the milk and oil.", "Make a well in the centre of the flour mixture and pour in the liquid mixture. Slowly mix together the dough by working from the centre and incorporating the flour from the edges of the 'well', to make a smooth, soft dough. Knead well for 8–10 minutes, adding a little flour if the dough is too sticky.", "Place the dough into an oiled bowl, cover with a damp tea-towel and leave in a warm place for 10–15 minutes. Form the dough into five balls.", "Preheat the grill to medium and place a heavy baking sheet on the upper shelf of the grill to heat.", "Roll the dough balls out quite thinly, ideally in a teardrop shape, but really this is just aesthetic. Sprinkle over your chosen topping and press into the surface of the dough. Place the naans onto the hot baking sheet and grill for 1–2 minutes, or until lightly browned. Brush with butter and serve hot."]}, "Nigel Slater's toad in the hole": {"ingredients": ["2 free-range eggs", "125g/4½oz plain flour", "150ml/5fl oz milk mixed with 150ml cold water", "1 level tbsp grain mustard", "salt and freshly ground black pepper", "6 fat, herby pork sausages", "100g/3½oz thinly sliced prosciutto, pancetta, Serrano ham or thin streaky bacon", "3 tbsp dripping or lard", "brown onion and madeira gravy"], "instructions": ["Whisk together the eggs, flour, milk, mustard and seasoning, beating out any little lumps of flour. The consistency should be about that of ordinary double cream, but no thinner. Rest for 15 minutes.", "Preheat the oven to 220C/425F/Gas 7.", "Carefully remove the skin from each of the sausages. Wrap each piece of skinned sausage meat in a piece of cured ham.", "Put the dripping or lard in a roasting tin and leave it in the oven until it is smoking.", "Pour in the batter - it will sizzle softly in the hot fat - then arrange the sausages in the batter.", "Transfer the tin back into the oven and bake for 25-30 minutes until puffed and golden. Serve with brown onion and madeira gravy."]}, "Nigel Slater's Thai green curry": {"ingredients": ["4 lemongrass stalks, tougher outer leaves discarded ", "6 medium-hot green chillies, seeded and chopped ", "3 cloves garlic, peeled and crushed", "5cm/2in piece of galangal or ginger, peeled and chopped", "2 shallots, peeled and finely chopped", "4 tbsp chopped fresh coriander", "1 tsp ground cumin", "1 tsp chopped lime zest", "1 tbsp nam pla (Thai fish sauce)", "½ tsp ground black peppercorns", "750g/1lb 10oz free-range chicken breasts or thighs, bones removed", "3 tbsp groundnut oil", "200g/7oz chestnut mushrooms, quartered", "400ml/14fl oz tin coconut milk", "400ml/14 fl oz homemade or ready-made chicken stock", "8 lime leaves", "1 tbsp nam pla (Thai fish sauce)", "1 tbsp bottled green peppercorns, drained ", "leaves from a large bunch (about 20g/0.7oz) basil, shredded ", "15g/½oz fresh coriander (leaves and stalks,) roughly chopped"], "instructions": ["For the curry paste, slice the lemongrass finely. Put it in a food processor with all the remaining curry paste ingredients and whiz to a thick paste, pushing the mixture down from time to time with a spatula. Transfer to a glass or china dish, cover tightly (otherwise it will taint everything in the fridge) and refrigerate.", "For the curry, cut the chicken into finger-thick strips. ", "Warm the oil in a casserole and, when hot and sizzling, add the chicken strips and let them colour slightly on all sides. You will need to do this in batches to avoid crowding the pan. ", "Remove the cooked chicken pieces from the casserole with a slotted spoon. Add the quartered mushrooms to the casserole and fry until golden-brown, adding more oil if needed. ", "Pour in the coconut milk and stock, then add the lime leaves, four heaped tablespoons of the curry paste, the fish sauce, peppercorns and half of the chopped herbs. Bring to the boil, then turn the heat down and simmer for 10 minutes, stirring from time to time.", "Return the chicken to the casserole with a further tablespoon of the paste and simmer for five to six minutes, or until the chicken is cooked through. Stir in the last of the herbs and serve."]}, "Nasi goreng with lime and sugar barbecued chicken": {"ingredients": ["3 garlic cloves, crushed", "1 tsp crushed white peppercorns", "1 tbsp granulated sugar", "1 tbsp Thai fish sauce", "1 lime, juice only", "500g/1lb 2oz skinned boneless chicken thighs, each cut into 2.5cm/1in strips", "2 tbsp vegetable oil", "4 fat garlic cloves, roughly chopped", "50g/2oz shallots, roughly chopped", "25g/1oz roasted salted peanuts", "6 medium-hot red chillies, roughly chopped", "1 tsp blachan (shrimp paste)", "1 tsp salt", "300g/10½oz long-grain rice", "sunflower oil, for frying", "6 large shallots, thinly sliced", "2 large free-range eggs", "salt and freshly ground black pepper", "1 tbsp tomato purée", "1 tbsp ketjap manis", "1 tbsp light soy sauce", "5cm/2in piece cucumber, cut into quarters lengthways, sliced", "8 spring onions, trimmed, thinly sliced on the diagonal"], "instructions": ["For the barbecued chicken, mix the crushed garlic, crushed white peppercorns, sugar, fish sauce and lime juice together in a bowl. Add the chicken pieces and place in the fridge to marinate for at least 2 hours or overnight. ", "To cook the chicken, thread the marinated chicken pieces onto parallel pairs of the soaked bamboo skewers (this helps to stop the pieces from spinning around as you turn them). ", "Preheat the grill to its highest setting (or prepare the barbecue).", "Grill the chicken skewers for 6-7 minutes, turning regularly, until golden-brown and caramelised on the outside and cooked through (no trace of pink should remain). ", "Slide the barbecued chicken off the skewers, cut into chunks and set aside. ", "For the spice paste, blend all of the spice paste ingredients in a food processor to a smooth paste. ", "For the nasi goreng, cook the rice in boiling, salted water for 12-15 minutes, or according to packet instructions, until just tender. Drain, rinse well with boiling hot water from the kettle, and drain well again.", "Spread the rice out onto a large baking tray and set aside until cold (but do not refrigerate). ", "Heat 1cm/½in of the sunflower oil in a large, deep-sided frying pan until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: hot oil can be dangerous. Do not leave unattended.) Add the sliced shallots and shallow fry, stirring now and then, until crisp and richly golden-brown. Remove the onions from the pan with a slotted spoon and set aside to drain on plenty of kitchen paper. Sprinkle lightly with salt and set aside until cold and crisp. ", "Beat the eggs in a bowl with some salt and freshly ground black pepper. ", "Heat a couple of tablespoons of the sunflower oil in a small frying pan over a medium-high heat, pour in one-third of the beaten egg and cook until it has has set on top. ", "Flip the egg over, fry it for a few more seconds then turn it out onto a chopping board or plate, roll it up tightly and set aside until cold. Repeat the process twice more with the remaining egg. ", "When the egg rolls are cold, slice them into thin strips. ", "Heat a wok over a high heat until smoking hot. Add two tablespoons of the oil left over from frying the shallots, then add the nasi goreng paste and stir-fry for 1-2 minutes, or until fragrant. ", "Add the tomato purée and ketjap manis and stir-fry for a few seconds, then add the cold cooked rice and stir-fry for a further 2-3 minutes, or until heated through. ", "Add the barbecued chicken pieces, fried shallots and strips of omelette and stir-fry for another minute. ", "Add the soy sauce, cucumber and most of the spring onions and mix together well. ", "To serve, spoon the nasi goreng onto a large warmed platter. Sprinkle over the remaining spring onions and allow people to help themselves."]}, "Nigella's devil’s food cake": {"ingredients": ["50g/2oz best-quality cocoa powder, sifted", "100g/4oz dark muscovado sugar", "250ml/8fl oz boiling water", "125g/4½oz soft unsalted butter, plus some for greasing", "150g/5oz caster sugar", "225g/8oz plain flour", "½ tsp baking powder", "½ tsp bicarbonate of soda", "2 tsp vanilla extract", "2 free-range eggs", "125ml/4fl oz water", "30g/1oz dark muscovado sugar", "175g/6oz unsalted butter, cubed", "300g/10oz best-quality dark chocolate, finely chopped"], "instructions": ["Preheat the oven to 180C/350F/Gas 4. Line the bottoms of two 20cm/8in sandwich tins with baking parchment and butter the sides.", "Put the cocoa and the dark muscovado sugar into a large bowl and pour in the boiling water. Whisk to mix, then set aside.", "Cream the butter and caster sugar together in a separate bowl, beating well until pale and fluffy; I find this easiest with a freestanding mixer, but by hand wouldn’t kill you.", "Stir the flour, baking powder and bicarbonate of soda together in another bowl and set aside for a moment.", "Dribble the vanilla extract into the creamed butter and sugar – mixing all the while – then crack in one egg, quickly followed by a scoop of the flour mixture, then the second egg. Keep mixing after each addition.", "Incorporate the rest of the flour mixture little by little, then finally mix and fold in the cocoa mixture, scraping the bowl well with a spatula.", "Divide this fabulously chocolatey batter between the two prepared tins and put in the oven for about 30 minutes, or until a cake tester comes out clean. Take the tins out and leave them on a wire rack for 5-10 minutes, then turn the cakes out and set aside to cool.", "As soon as the cakes are in the oven, get started on your frosting. Put the water, muscovado sugar and butter into a pan over a low heat until melted.", "When this mixture begins to bubble, take the pan off the heat and add the chopped chocolate, swirling the pan so that all the chocolate is hit with heat, then leave for a minute to melt. Once melted, whisk until smooth and glossy.", "Set the frosting aside for about one hour, whisking now and again – when you’re passing the pan – by which time the cakes will be cooled, and ready for the frosting.", "Set one of the cooled cakes, with its top side facing downwards, onto a cake stand or plate, and spread with about one-third of the frosting. Top that with the second cake, regular way up, and spread the remaining frosting over the top and sides, swirling away with your spatula. You can go for a smooth look, but I never do and probably couldn’t."]}, "Nutty oat energy bars": {"ingredients": ["120g/4oz rolled jumbo oats", "30g/1oz unsweetened puffed rice (not crisped rice cereal)", "75g/2½oz toasted flaked almonds", "25g/1oz mixed seeds", "130g/4½oz stoned dates, chopped", "50g/1¾oz dark chocolate chips (optional) ", "40g/1½oz raisins or dried berries of your choice", "100g/3½oz crunchy peanut butter", "90g/3¼oz honey"], "instructions": ["Line a 20cm/8in or 23cm/9in square tin with baking paper. ", "Preheat the oven to 180C/160C Fan/Gas 4. ", "Spread the oats out onto a baking tray and bake them for about 10 minutes until they smell nice and toasty. Set aside to cool. (You can skip this step, but it makes the bars crispier.)", "Mix together the toasted oats, puffed rice, almonds, seeds, chopped dates, chocolate chips, and raisins in a large bowl.", "Melt the peanut butter and honey together in a small saucepan over a gentle heat. Stir until the mixture is smooth and thoroughly combined. While still warm, stir the peanut butter and honey into the oat mixture (you may need to get your hands in there) to completely coat all the oats, nuts and fruit. ", "Tip the mixture into the lined tin and press firmly to make an even layer. Damp hands make this less sticky work. Place the tin into the freezer for 20 minutes to firm up before cutting into 15 bars. Wrap each bar in cling film to keep them fresh, and they’re ready to pop into a packed lunch."]}, "No-bake fruity oat bars": {"ingredients": ["150g/5½oz peanut butter", "150g/5½oz honey or agave syrup", "2 tsp vanilla extract", "200g/7oz porridge oats, gluten-free if required", "50g/1¾oz brown puffed rice or puffed oats, gluten-free if required", "75g/2½oz pumpkin seeds", "125g/4½oz dates, roughly chopped "], "instructions": ["Grease and line a 30 x 23cm deep tin with baking paper.", "Put the peanut butter, honey and vanilla extract in a large microwaveable bowl and microwave for 45 seconds. Stir well and heat for another 10 seconds, until melted and smooth. Stir in the remaining ingredients until everything is fully coated.", "Tip into the prepared tin and press down evenly with wet hands. Refrigerate for at least 2 hours or until solid.", "Slice into 24 bars. Transfer to a sealed container and keep in the fridge for up to 1 week. "]}, "New potato, spinach and goats’ cheese frittata": {"ingredients": ["2 tbsp olive oil", "400g/14oz new potatoes, roughly chopped", "1 large red onion, finely chopped", "8 large free-range eggs", "100ml/3½fl oz single cream", "½ tsp freshly grated nutmeg", "handful mint leaves, finely chopped", "3 garlic cloves, sliced", "150g/5½oz spinach, roughly chopped", "120g/4½oz goats' cheese, roughly chopped", "12 sage leaves", "salt and freshly ground black pepper"], "instructions": ["Preheat the oven to 220C/200C Fan/Gas 7. Heat the olive oil in a large ovenproof frying pan over a medium-low heat. Add the potatoes with a pinch of salt and cook, stirring for 8–10 minutes. Toss in the red onion and cook for a further 5 minutes.", "Meanwhile, crack the eggs into a large bowl. Add the cream, nutmeg, chopped mint and some salt and pepper and whisk well. Set aside.", "Add the garlic to the pan and cook for 2 minutes, then toss in the spinach and sauté until it begins to wilt. Pour the cream mixture into the pan, stir around for one minute, then remove from the heat.", "Dot the goats’ cheese evenly over the surface of the frittata and scatter over the sage leaves. Place on the top shelf of the oven for 8–10 minutes, or until the egg has set and the cheese is golden.", "Remove the frittata from the oven and leave to stand for a few minutes to cool slightly before serving."]}, "No-churn berry ice cream ": {"ingredients": ["½ unwaxed lemon, finely grated zest and juice", "450g/1lb mixture of berries (e.g. strawberries, raspberries, blackcurrants, blackberries)", "397g tin condensed milk ", "600ml/1 pint whipping cream "], "instructions": ["Put the lemon zest and juice in a large bowl, making sure you remove any pips. Add the berries and mash into a purée using a potato masher. Pour in the condensed milk.", "In a separate large bowl, pour in the cream and whisk using an electric hand whisk or balloon whisk, until soft peaks form and curl over a little when you lift the whisk out of the mixture. Make sure you don’t whisk past this point.", "Pour the fruit purée into the cream and carefully mix together using a big spoon, until the mixture is all the same colour.", "Spoon the mixture into a large tub and cover with a lid or cling film. Freeze for at least 4 hours, or overnight."]}, "Nigella's sticky toffee pudding": {"ingredients": ["200g/7oz soft dried pitted dates, roughly chopped", "200ml/7fl oz water from a freshly boiled kettle ", "1 tsp bicarbonate of soda ", "75g/2½oz unsalted butter, softened, plus more for greasing", "2 tbsp black treacle ", "50g/1¾oz dark muscovado sugar ", "2 large free-range eggs, at room temperature", "150g/5½oz plain flour ", "2 tsp baking powder ", "150g/5½oz unsalted butter, softened", "300g/10½oz dark muscovado sugar ", "1 tbsp black treacle ", "200ml/7fl oz double cream, plus more to serve"], "instructions": ["Preheat the oven to 180C/160C Fan/Gas 4 and lightly grease your dish. ", "Put the chopped dates, boiling water and bicarbonate of soda into a bowl, stir and then leave for 10 minutes.", "Cream the butter and black treacle together in a stand mixer until well mixed, then add the sugar and mix again, beating out any lumps. Beat in an egg and keep beating – scraping down as necessary – until completely incorporated, then do the same with the other egg. Beating more gently, add the flour and baking powder until you have a smooth, thick batter.", "Using a fork, stir the soaked dates, squishing them a bit, then pour the dates and their liquid into the batter and beat gently to mix in.", "Pour and scrape into your prepared dish or cake tin and bake for 30–35 minutes, or until a cake tester comes out clean.", "Meanwhile, to make the sauce, melt the butter, muscovado sugar and treacle over a very low heat in a heavy-based saucepan. Once the butter’s melted, stir gently until everything else is melted too. Now stir in the cream, then turn up the heat and when it’s bubbling and hot, take it off the heat.", "As soon as it’s out of the oven, prick the cooked sponge pudding all over with a cocktail stick and pour about a quarter of the warm sauce over, easing it to the edges with a spatula so that the sponge is entirely topped with a thick sticky glaze. Put a lid on the remaining sauce in the pan to keep it warm.", "Leave the pudding to stand for 20–30 minutes, then take to the table, with the rest of the sauce in a jug, and cream to serve."]}, "Nadiya's pad Thai": {"ingredients": ["200ml/7fl oz rice wine vinegar", "75g/2¾oz palm sugar, grated", "1 young papaya, peeled and sliced", "3 tbsp tamarind paste", "2 tbsp fish sauce", "2 tsp turmeric", "2 tbsp light soy sauce", "2 limes, juice only", "1kg/2lb 4oz mussels, scrubbed and debearded (optional)", "2 tbsp vegetable oil", "400g/14oz cooked rice noodles ", "6 Thai shallots, peeled and finely chopped", "2 red chillies, finely sliced", "250g/9oz squid, cleaned, prepared and cut into rings", "lime wedges", "celery leaves,", "cashew nuts, to serve", "chilli flakes, to serve"], "instructions": ["For the pickled papaya, bring the vinegar to the boil in a small saucepan. Stir in the palm sugar until dissolved. Remove from the heat, stir in the papaya and set aside until the pickle has cooled completely.", "For the pad Thai sauce, mix all of the ingredients together in a small bowl until combined into a smooth sauce.", "For the noodles, discard any mussels with broken shells and any that refuse to close when tapped (if using). Heat a tablespoon of oil in a large, lidded wok and add the mussels. Cover with the lid and steam the mussels for 3–4 minutes, or until all of the mussels are opened. Discard any mussels that remain closed and remove the mussels from the remaining opened shells. Tip the noodles into a bowl and add the mussels.", "Wipe the wok and add a tablespoon of oil. When hot, add the shallots and chillies and stir-fry for 1 minute. Add the squid rings and stir-fry for 1–2 minutes. Keep the wok on the heat, add the mussel and noodle mixture (or just the noodles if you aren't using mussels) and toss everything together. Pour in the pad Thai sauce and toss through the noodles until everything is coated and warmed through. ", "To serve, spoon the noodles into warmed bowls and garnish with the pickled papaya. Serve immediately with the lime wedges, celery leaves, cashew nuts and chilli flakes alongside. "]}, "Niçoise salade": {"ingredients": ["400g/14oz fresh tuna loin", "1 tbsp olive oil", "4 free-range eggs", "110g/4oz French beans, cooked", "10 cherry tomatoes", "olive oil, for drizzling ", "8 new potatoes, cooked", "10 black olives", "1 Little Gem lettuce", "½ garlic clove", "2 canned anchovy fillets, drained", "1 free-range egg yolk", "½ lemon, juice only", "110ml/4oz olive oil", "1 tsp Dijon mustard", "salt and freshly ground black pepper"], "instructions": ["Preheat the oven to 210C/415F/Gas 7.", "For the salad, heat an ovenproof frying pan until hot. Rub the tuna loin with olive oil, then sear the tuna on each side.", "Place in the oven for 5-6 minutes, or until just cooked, but still pink in the centre.", "Bring a small pan of water to the boil and place the eggs into the water. Boil for 4-5 minutes, then drain and run under cold water to stop them continuing to cook. Peel off the shell.", "Bring another pan of salted water to the boil, add the French beans and cook for 3-4 minutes, until just tender. Drain and refresh under cold water, then slice in half lengthways.", "Place the cherry tomatoes onto a baking sheet and drizzle with a little olive oil. Place in the oven for 3-4 minutes, until just softened.", "For the dressing, place the garlic and anchovy fillets into a pestle and mortar with the egg yolk and pound to a paste.", "Add the lemon juice and stir, then gradually add the olive oil in a slow drizzle, mixing all the time with a whisk.", "Stir in the mustard and season, to taste, with salt and freshly ground black pepper.", "To assemble the salad, place the beans, tomatoes, potatoes, olives, eggs and lettuce leaves into a bowl. Drizzle over the dressing and stir well.", "To serve, divide the salad among four serving plates. Cut the cooked tuna loin into thin slices and place on top of the salad."]}, "Norwegian pork ribs": {"ingredients": ["2.5–3kg/5½ –6½lb bone-in pork belly, prepared as in recipe tip below", "3 fat garlic cloves, peeled", "3 tbsp sea salt flakes (or 1½ tbsp fine sea salt)", "1 tsp juniper berries", "large bunch (or 2 x 20g packets) fresh dill, fronds and stalks separated", "2 onions, each peeled and cut into 3 thick slices", "250ml/9fl oz hot water from a just-boiled kettle"], "instructions": ["You need to take the pork out of the fridge about an hour before you cook it so factor that into your timetable, adding it to the 3 hours, give or take, that the pork will be in the oven. For now, unwrap it and lay it rind-side down on a large chopping board.", "Put the garlic cloves into the mortar part of a pestle and mortar, or into a bowl you can use with a stick blender. Add 2 tablespoons of the sea salt flakes (or 1 tablespoon of fine sea salt), the juniper berries and the stalks from your dill, and start either bashing, grinding and crushing or whizzing, as you prefer, until you have an aromatic green paste. It’s harder work with a pestle and mortar, but I adore making it this way: it makes my kitchen smell, rather invigoratingly, like a Nordic spa.", "Where the butcher has sawn through the bones, you will have 2 long troughs to tuck the paste into. Run a knife through them if you need to open up the cut area a little more. Press the green paste evenly between them. Push as many of the dill fronds into the paste as you can fit. Turn the pork rind-side up. Rub the rind and sides of the pork with the remaining 1 tablespoon of sea salt flakes (or 1½ teaspoons of fine sea salt).", "Get out a large roasting tin (I use one that measures 34 x 37 x 5cm/13½ x 14½ x 2in). Place the onion slices in the tin to prop up the pork. One end must be slightly higher than the other, so that any liquid pours off and doesn’t pool on the rind, so place the pork, rind-side up, on the onions. Leave the pork in the tin for about 1 hour to lose its fridge chill. Preheat the oven to 220C/200C Fan/Gas 7.", "Pour the 250ml of just-boiled water into the roasting tin, cover the tin tightly with kitchen foil, and cook in the hot oven for 45 minutes. When it’s had its 45 minutes, take the pork out of the oven and remove the foil; the rind should have softened and puffed up a little. Use a large sharp knife to define the squares on the rind, cutting a little deeper into the original scoring marks. Or if you didn’t get it done by the butcher, do your own scoring at this point, cutting the softened rind into 2cm/¾in squares.", "Turn the oven down to 170C/150C Fan/Gas 3½. Put the pork back into the oven without the foil, making sure that it’s still perched, one end higher than the other, on the slices of onion. Roast for 2½ hours at this temperature, by which time much of the fat should have rendered down, melting lusciously into the meat, and the rind will be beginning to crackle. But if, when you poke the tip of a knife into the pork, it doesn’t feel tender, leave it in for another 30 minutes.", "Turn the oven back up to 220C/200C Fan/Gas 7 and give the pork around 15 minutes – or a little longer if needed, but make sure the rind doesn’t go too far and burn – until the crackling is deep gold and crunchy: some of the little squares may have popped up. Take the pork out of the oven and remove carefully to a carving board. Cut through both sides of each rib, down to where the butcher cut through the bones, then cut a chunky rib section for each person. The crackling may make this tricky, so you can use poultry shears or kitchen scissors to cut through it before slicing down into the meat. This way each rib section gets a proper piece of crackling. ", "Because the meat has to be so heavily salted to boost juiciness and flavour, most of the onions will be far too salty to serve. One or two will be perfect though, and divinely sticky with pork fat; you can share these out meagrely now, or save them for sandwiches later."]}, "Nigel’s lazy loaf": {"ingredients": ["225g/8oz wholemeal flour", "225g/8oz plain flour", "½ teaspoon sea salt", "1 teaspoon caster sugar", "1 teaspoon bicarbonate of soda", "350ml/12fl oz buttermilk"], "instructions": ["Preheat the oven to 220C/425F/Gas 8. Put a large casserole dish and its lid into the oven.", "In a large bowl, mix the flours, sea salt, sugar and bicarbonate of soda together with your fingers. Pour in the buttermilk, bringing the mixture together as a soft dough. Working quickly (the bicarbonate of soda will start working immediately), shape the dough into a shallow round loaf about 4cm/1½in thick.", "Remove the hot casserole dish from the oven, dust the inside lightly with flour then lower in the dough. Cover with the lid and return to the oven. ", "The bread should be ready after 25 minutes. Remove from the oven and leave in place for 5 minutes before turning out and leaving to cool slightly before eating. (Soda bread is best eaten warm.) "]}, "Nigel Slater's spaghetti bolognese": {"ingredients": ["50g/1¾ oz butter", "70g/2½ oz pancetta", "1 onion, finely chopped", "2 cloves garlic, finely chopped", "1 carrot, finely chopped", "2 celery stalks, finely chopped", "2 large mushrooms, finely chopped", "2 bay leaves", "400g/14oz beef mince", "200ml/7fl oz whole milk ", "220ml/7¾fl oz crushed tomatoes or passata", "200ml/7fl oz red wine", "200ml/7fl oz vegetable stock", "pinch freshly ground nutmeg", "spaghetti or tagliatelle, cooked according to packet instructions", "grated parmesan cheese, to serve"], "instructions": ["Melt the butter in a heavy-based pan, then stir in the pancetta and let it cook for 4-5 minutes, without colouring much. Add the onion, garlic, carrot, celery, mushrooms and bay leaves, stirring well. Leave to cook for 8-10 minutes over a medium heat, stirring frequently, until the vegetables are tender. ", "Turn up the heat and tip in the minced beef, breaking it up well with a wooden spoon. Leave to cook without stirring for 3-4 minutes, or until the bottom is browned, then stir again and cook for a further 3-4 minutes, or until golden-brown all over and cooked through. ", "Pour in the milk a bit at a time, then mix in the tomatoes, red wine, vegetable stock, nutmeg and season with salt and freshly ground black pepper freshly ground black pepper. Bring to the boil, then reduce the heat to a gentle simmer. Partially cover the pan with a lid and leave to simmer for 1 hour 30 minutes, stirring occasionally. ", "To serve, season to taste with salt and freshly ground black pepper, then stir in the cooked pasta and pile onto serving plates. Sprinkle over the grated parmesan and serve."]}, "Nadiya's dal ": {"ingredients": ["250g/9oz toor dal (yellow split pigeon peas)", "2 tbsp vegetable oil", "4 onions, chopped", "1 red chilli, finely chopped (seeds removed if preferred)", "4 garlic cloves, crushed", "½ tsp ground turmeric", "½ tsp chilli powder", "1 tsp ground cumin", "3 small dried red chillies", "2 floury potatoes, peeled and cut into 5mm dice", "2 tomatoes, roughly chopped", "5 tbsp vegetable oil", "2 garlic cloves, crushed ", "½ onion, thinly sliced", "1 red chilli, thinly sliced", "1 tsp panch phoran", "large handful fresh coriander leaves"], "instructions": ["For the dal, soak the dal (ideally overnight) or for a minimum of 4 hours. ", "Heat the vegetable oil in a large pan. Add the onions, chilli and garlic and cook until softened. ", "Add the ground spices, dried chillies and a little water to loosen and stir.", "Add the potatoes and lentils and enough water to almost cover. Simmer for 10–12 minutes..Add the tomatoes and simmer for 10–15 minutes, until they have softened but not dissolved.", "Meanwhile, for the topping fry the garlic, onion and chilli in the oil until caramelised and crispy. Add the panch phoran and, once you hear the spices pop, take off the heat.", "To serve, spoon out the dal and garnish it with the crunchy topping. Sprinkle with the coriander."]}, "Nadiya's lentil soup and soda bread ": {"ingredients": ["250g/9oz wholemeal flour", "250g/9oz strong white bread flour, plus extra for dusting  ", "1 tsp fine salt ", "1 tsp bicarbonate of soda ", "1 tbsp panch phoran", "400ml/14fl oz buttermilk (see tip below)", "150g/5½oz red split lentils ", "1 bay leaf ", "1 dried red chilli", "½ tsp turmeric ", "½ tsp fine salt ", "75g/3oz unsalted butter ", "5 garlic cloves, thinly sliced", "handful fresh coriander (approx. 10g), roughly chopped "], "instructions": ["Preheat the oven to 200C/180C Fan/Gas 6 and line a baking tray with baking paper. ", "For the soda bread, put the flours, salt, bicarbonate of soda and five-spice into a large bowl and mix well. Make a well in the centre and add a little over half the buttermilk. Bring the dough together by hand, adding more of the buttermilk if needed (you may not need any more). ", "As soon as all the flour is absorbed and the dough comes together, lightly flour the work surface, tip the dough onto it and roll into a neat ball. Place on the baking tray. Using a sharp knife, make a cut down the centre vertically and then the same horizontally to form a cross, cutting all the way down to the base. Bake on the middle shelf for 30 minutes, until the bread is golden and sounds hollow when tapped on the base. Put on a wire rack to cool.", "While the bread is baking, wash the lentils, rinsing them till the water runs clear. Put the lentils into a pan with 1 litre of cold water, the bay leaf, red chilli, turmeric and salt. Bring to the boil and leave to simmer for 30 minutes. After 30 minutes the mixture should be thicker and the lentils will have broken up. ", "Melt the butter in a small frying pan over a medium heat. Add the sliced garlic and fry until golden-brown. Pour the garlic and butter into the lentils and mix through. Now add the chopped coriander and take the pan off the heat. Serve the warm lentils with chunks of soda bread."]}, "No-churn lemon yoghurt ice cream": {"ingredients": ["300ml/½ pint double cream", "300ml/½ pint full-fat natural yoghurt", "2 lemons, finely grated zest and juice", "350g/12oz caster sugar", "300ml/½ pint milk"], "instructions": ["Whisk the cream in a bowl until soft peaks form when the whisk is removed.  Stir in the yoghurt, lemon zest and juice, sugar and milk. Whisk until well combined.", "Pour into a 1.5 litre/2½ pint shallow plastic container, cover with a lid and freeze for at least six hours, preferably overnight, until firm.", "Remove the ice cream from the freezer, cut into chunks and blend in a processor until smooth and creamy.  Return to the plastic container, cover with the lid and return to the freezer until required."]}, "Nigel Slater's all-in-one roast beef rib ": {"ingredients": ["2kg/4lb 8oz Maris Piper potatoes, sliced into thirds ", "600g/1lb 5oz beef dripping", "3 tbsp grated fresh horseradish", "2 tbsp black peppercorns", "2 tbsp sea salt", "3.5kg/7lb 11oz rib of beef", "8 large carrots, chopped into 3", "8 large parsnips, sliced into thirds lengthways"], "instructions": ["Preheat the oven to 220C/425F/Gas 7.", "Boil the peeled and sliced potatoes in a large pan of salted water until soft to the point of a knife. ", "Drain the potatoes and shake in a colander so that the edges fluff up.", "In a saucepan, melt the dripping with the horseradish, salt and pepper.", "Score the beef all over with a sharp knife.", "Layer all the chopped vegetables in a large oven tray and place the beef on top. Tip the potatoes into another tray.", "Ladle most of the horseradish glaze over the top of the vegetables and meat (reserving some for the potatoes). Roast the meat in the oven for 20 minutes then reduce the temperature to 160C/325F/Gas 3 and baste the meat with the dripping.", "Pour the remaining horseradish glaze over the potatoes and place them in the oven to cook for the duration of the beef cooking time.", "Roast the meat for two hours,basting it with the dripping every half hour.", "Allow the meat to rest under foil for 30 minutes before serving.  If necessary, you could turn up the oven to crisp the potatoes while the meat is resting."]}, "Nigella's queen of puddings ": {"ingredients": ["150g/5½oz brioche, cut into slices and left to go stale (see recipe tip)", "50g/1¾oz unsalted butter, softened, plus more for greasing", "500ml/18fl oz full-fat milk ", "1 lemon, zest and juice", "1 tsp vanilla extract ", "25g/1oz caster sugar ", "pinch fine sea salt", "4 large free-range egg yolks (whites reserved for meringue topping)  ", "175g/6oz plum (or other) jam ", "4 large free-range egg whites (from eggs above)", "100g/3½oz caster sugar, plus extra for sprinkling "], "instructions": ["Grease your pie dish with butter and preheat the oven to 170C/150C Fan/Gas 3½.", "Put the brioche slices into a food processor and blend into crumbs then place in a mixing bowl. ", "Gently warm the milk in a saucepan with the butter, lemon zest, vanilla extract, sugar and a pinch salt, until the butter’s melted.", "Whisk the yolks in a large bowl or jug, pour the warm milk mixture on top and whisk to combine, then pour this over the crumbs in their bowl and leave for 10 minutes, before transferring to the greased dish. Bake for 20 minutes, or until the top is just set, although the crumb-custard will still be wobbly underneath. Remove from the oven and set aside. ", "Whisk 2 teaspoons lemon juice into the jam in a small bowl: you want a soft, pourable consistency. If the jam’s too thick, warm it in a small pan. Set aside while you get on with the topping.", "Whisk the egg whites in a grease-free bowl until they form firm peaks, then gradually whisk in the sugar, until you have a thick and shiny meringue.", "Pour the lemon-spritzed jam over the crumb-custard, gently smoothing it over the top. Cover the jam-topped custard with the meringue, making sure it comes right to the edges to seal it well. Use a fork to pull the meringue topping into little peaks, and sprinkle with a ½ teaspoon or so of caster sugar. ", "Put the dish back in the oven and bake for about 20 minutes until the meringue is bronzed and crisp on top. Let it stand for about 15 minutes before serving."]}, "No-bake strawberry cheesecake": {"ingredients": ["2 tsp sunflower oil", "200g/7oz digestive biscuits", "100g/3½oz unsalted butter", "½ tsp ground cinnamon", "100g/3½oz white chocolate, roughly chopped", "400g/14oz strawberries, trimmed, plus extra to decorate", "300g/10½oz full-fat cream cheese", "1 tsp vanilla extract", "½ unwaxed lemon, finely grated zest only", "1 tbsp runny honey or maple syrup", "200ml/7fl oz double cream"], "instructions": ["Brush the inside of a 20cm/8in springform tin with the sunflower oil, and line the base with a disc of baking parchment. ", "Put the digestive biscuits into a sealable freezer bag. Push all the air out and seal the bag. Crush the biscuits with a rolling pin, until they are reduced to sand-like crumbs.", "Melt the butter in a large saucepan. Stir in the biscuit crumbs and cinnamon. Press the crumbs into the bottom of the tin. Chill in the refrigerator for 30 minutes.", "Chop 150g/5oz of the strawberries in half from top to bottom and arrange around the edge of the prepared tin, cut side-up. Chop the remaining berries into small pieces. ", "Melt the chocolate in a heatproof bowl, either over a pan of simmering water, making sure the bowl doesn’t touch the water, or in a microwave.", "Beat together the cream cheese, vanilla, lemon zest and honey in a mixing bowl. Stir in the chopped strawberries. ", "In another bowl, whisk the double cream until it holds a floppy peak.", "Fold the melted chocolate into the cream cheese mixture, followed by the double cream. Add more honey if needed. ", "Spoon the filling into the tin, being careful not to move the strawberries on the edge. Spread level with a palette knife or the back of a spoon, cover with cling film and chill overnight, until firm.", "Carefully remove the cheesecake from the tin and put on a serving plate. Slice or quarter extra strawberries to arrange on top. "]}, "Nadiya's hot cross buns": {"ingredients": ["300ml/10fl oz full-fat milk ", "50g/1¾oz unsalted butter ", "500g/1lb 2oz strong bread flour, plus extra for dusting ", "75g/2¾oz caster sugar ", "1 tsp salt ", "7g fast-action dried yeast ", "1 free-range egg, lightly beaten ", "oil, for greasing ", "75g/2¾oz dried cranberries, roughly chopped ", "50g/1¾oz dried blueberries, roughly chopped ", "1 orange, zest only ", "9g freeze-dried strawberries or raspberries ", "75g/2¾oz plain flour, sifted ", "300g/10½oz seedless berry jam (strawberry, raspberry or any berry jam) ", "3 tbsp golden syrup, warmed"], "instructions": ["To make the dough, heat the milk and butter in a saucepan until the butter has melted. Take off the heat. ", "Add the flour to a large bowl and mix in the sugar. Add the salt on one side of the flour and the yeast on the other side. Make a well in the centre, pour in the egg and then add the milk mixture. Roughly mix using the back of a spoon or a palette knife, then get your hands in and bring the dough together. ", "Knead the dough on a lightly floured surface until it is smooth and stretchy. This will take about 10 minutes or it can be done in a mixer with a dough hook attached, which should take about 6 minutes on a medium speed. Pop the dough into a greased bowl and leave to rest in a warm place for about 1½ hours or until doubled in size.  ", "Line a large baking tray or 2 smaller trays with some baking paper. Tip the dough out onto a lightly floured surface and knock back the dough. Spread the dough out into a circle and sprinkle on the cranberries, blueberries and orange zest, then knead until the fruit is evenly distributed. ", "Take the dough and divide into 15 portions. Shape each piece into a ball and roll until it has a smooth surface. Place on the tray or trays with about a 3cm/1¼in gap between each one to give them space to prove and grow. Leave in a warm place, covered in some greased cling film, for about 40–60 minutes or until doubled in size. ", "Preheat the oven to 200C/180C Fan/Gas 6. To make the flour paste for the crosses, pound the strawberries in a pestle and mortar or blitz in a food processor until you have a fine pink dust. Add this to a bowl with the flour and 6 tablespoons of water and mix to a smooth, pipeable paste. Spoon into a piping bag. Uncover the proven buns and pipe a thin cross on each bun. ", "Bake the buns for 18–20 minutes. As soon as they are golden brown and bounce back when touched, take them out of the oven and leave to cool on a wire rack.", "Use the handle of a teaspoon or the end of a cutlery knife to make a hole in the side of each bun without going all the way through. Pop the jam into a piping bag and pipe into the hole of each hot cross bun until full. You will know when it is full as the piping bag will naturally force itself out. Put the buns back onto the tray. Brush the warmed syrup all over the buns to give a sweet, sticky glaze. Filled, fruity and ready to eat!"]}, "Nigella's turkey breast with Christmas stuffing": {"ingredients": ["100g/3½oz dried cranberries", "100ml/3½fl oz Marsala", "2 tbsp olive oil", "2 banana shallots, finely chopped", "¼ tsp ground cloves", "½ tsp ground allspice", "2 tsp chopped fresh sage", "1kg/2lb 4oz Italian sausages", "2 free-range eggs, beaten", "50g/2oz parmesan, grated", "60g/2¼oz breadcrumbs", "5kg/11lb double breast turkey joint, boned, butterflied, with skin left on", "4 tbsp duck or goose fat"], "instructions": ["Put the cranberries and Marsala into a small saucepan and bring to a boil, then take off the heat and leave to one side. ", "Put the oil into a large frying pan or similar heavy-based pan, and fry the shallots for a minute or so, then add the spices and shredded sage, turning them in the soft shallots.", "Squeeze the sausagemeat out of its skins, add to the pan and break it up – using a wooden fork and spatula for ease – turning it in the hot pan until it loses its pinkness. This will take about five minutes.", "Take the frying pan off the heat and turn the contents into a large bowl, mixing in the steeped cranberries and any Marsala clinging to them, and leave to cool. You can cover with cling film and put in the fridge for up to two days at this stage.", "When you are ready to stuff the turkey breast, take the bowl of sausagement out of the fridge.", "Preheat the oven to 200C/400F/Gas 6.", "Uncover the bowl of sausagemeat, add the eggs, parmesan and breadcrumbs and – I use my hands for this – mix well.", "Lay the butterflied turkey joint out in front of you. It really does look like a butterfly though admittedly a fleshy one. Spread the stuffing out first in the slight cavity in the centre of the butterfly and then outwards onto the wings though not going right up to the edge (or it will squodge out when cooking) but as evenly as possible over the whole joint.", "Carefully, in one swift but steady movement, fold one ‘wing’ over the other to close the joint, and then sit the turkey on a large roasting tin, breast bone (or where the breast bone would be) uppermost as it would look were it the whole bird, with the pointier bit furthest away from you. Thread two skewers through the base – i.e., the widest part that is nearer you – to keep it closed and smear it all over with the duck or goose fat.", "Roast the turkey breast for 2-2½ hours, then check it is cooked with a turkey or meat thermometer. When cooked, it should read 75C. (If you’re leaving it to rest, as you should or to cool, you could take it out at 73C – it wil retain heat and continue to cook for a short while once out of the oven.)", "Flex your muscles, then lift out onto a carving board, and leave to rest for at least 20 minutes. Or leave to get cold if you are eating it as part of a buffet.", "Cut through the whole joint in wide slices right across; they will need to be quite thick, at least 1-2cm/½-1in, to keep the stuffing intact within the slice.", "As you place it on table or sideboard, dot around it the condiments of your choice: I revert to Christmas in Italy here by putting a lusciously extravagant pot or two of Italian mostarda di Cremona on the table alongside: this is a hot and sweet preserve of mustardy candied fruits that gleam beautifully and taste both festive and fabulous."]}, "Nigella's steak tartare": {"ingredients": ["100g/3½oz organic beef fillet, finely chopped", "2 gherkins, finely chopped", "1 tsp capers, rinsed and drained, finely chopped", "1 shallot, finely chopped", "½ tsp Dijon mustard ", "few drops Tabasco sauce", "½ tsp Worcestershire sauce", "salt and freshly ground black pepper", "1 slice dark rye or pumpernickel bread ", "1 free-range egg yolk"], "instructions": ["Place the chopped beef, gherkins, capers and shallot into a bowl and mix well.", "Add the mustard, Tabasco sauce, Worcestershire sauce, salt and freshly ground black pepper and mix well. ", "To serve, spoon the steak tartare mixture onto a slice of plain or toasted dark rye or pumpernickel bread.", "Make a small dent in the top of the tartare and top with a fresh egg yolk. Eat immediately."]}, "Noodles with prawns and pak choi": {"ingredients": ["1 tbsp olive oil", "1 garlic clove, chopped", "½ tsp chilli flakes", "2.5cm/1in piece root ginger, peeled and chopped", "¼ red pepper, seeds removed, chopped", "1 pak choi, leaves separated", "2 raw tiger prawns, shells removed, deveined", "1 tsp soy sauce", "1 tbsp honey", "85g/3oz cooked udon noodles", "1 tbsp chopped fresh coriander", "1 lime, quartered"], "instructions": ["Heat the oil in a wok or large frying pan and stir fry the garlic, chilli and ginger for one minute.", "Add the red pepper and pak choi and stir fry for a further minute.", "Add the prawns, soy sauce, honey and noodles and cook for 2-3 minutes, or until the prawns have turned pink and are cooked through.", "To serve, place into a serving dish, sprinkle over the coriander and garnish with lime wedges."]}, "Nigel Slater's shepherd's pie with spiced parsnip mash": {"ingredients": ["900g/2lbs large parsnips, peeled and cut into large chunks", "2 onions, sliced", "50g/2oz butter", "large pinch ground cumin", "1 tbsp freshly ground coriander seeds", "1 tbsp garam masala", "about 50g/2oz butter ", "salt and freshly ground black pepper", "2 leeks or onions, chopped", "1 carrot, diced", "3 tbsp dripping or butter", "4 chestnut mushrooms, sliced", "450g/1lb leftover roast lamb, chopped, or raw lamb mince", "1 tbsp flour", "1 tbsp tomato purée", "250ml/9 oz hot lamb or chicken stock", "1 bay leaf ", "1 sprig thyme", "1 tbsp Worcestershire sauce"], "instructions": ["Simmer the parsnips in salted water until tender - about 15 to 20 minutes.", "While they are cooking, fry the onions in the butter over a moderate heat until soft and translucent.", "Stir in the spices and continue cooking for a further two minutes, until fragrant.", "Drain the parsnips. Mash them with a potato masher, stirring in the butter, salt and freshly ground black pepper, then the sliced onions. Set aside.", "In a large pan, cook the chopped leeks (or onions) and the diced carrot with the dripping or butter, until they are meltingly soft and golden - don't worry if they have caught slightly at the edges.", "Add the sliced mushrooms and cook for a further five minutes, then stir in the minced meat. The meat must brown a little here and there, so do not stir it too often. Leave to cook for five minutes or so, breaking it up as necessary.", "Add the flour and the tomato purée. Continue to cook, stirring regularly, for three or four minutes - tomato purée is bitter if not thoroughly cooked.", "Pour on the hot stock, add a bay leaf and a sprig of thyme and bring to the boil.", "Turn down the heat and leave to simmer very gently for 25-30 minutes. ", "Preheat the oven to 190C/375F/Gas 5.", "Season the filling with salt, Worcestershire sauce and a few grinds of black pepper - be generous.", "Scoop the mixture into a large baking dish and spoon dollops of mashed parsnip over the top. Bake for about 25 minutes until the topping is golden brown."]}, "Nigella's bread sauce": {"ingredients": ["1 day-old loaf unsliced white bread", "1 litre/2 pints full-fat milk", "1 onion, peeled and quartered", "4 cloves", "2 fresh bay leaves", "1 tsp white peppercorns", "2 blades fresh mace or heaped ¼ tsp ground mace", "2 tsp salt", "30g/1oz butter", "2 tbsp double cream, optional", "1 fresh nutmeg, for grating"], "instructions": ["Remove the crust from the bread and tear the stripped loaf into a mound of rough chunks or cubes about 2cm/¾in in size. You should end up with 175-200g (6¼-7¼oz) of cubes.  If the bread is not slightly stale already, leave the pieces out on a wire rack to dry out.", "Pour the milk into a saucepan.  Press a clove into each quarter of the onion.", "Add the onion quarters, bay leaves, peppercorns and the blades of mace (or sprinkle the ground mace into the pan) along with the salt and bring to the mixture almost to its boiling point. ", "Remove the pan from the heat.  Cover the pan with a lid and let the ingredients infuse for at least half an hour, though you can leave it for a few hours if that helps with your cooking schedule. ", "After the mixture has infused, place the pan back on a very low heat.  Using a slotted spoon, remove the onions, peppercorns, cloves, bay leaves and the blades of mace.  ", "Add the bread to the saucepan and cook for about 15 minutes, stirring every now and then, by which time the sauce should have become thick and warm. ", "Just before serving the bread sauce, add the butter to the saucepan and stir until the butter has melted and combined with the sauce and season, to taste, with salt. ", "Add the cream (if using). Grate over quite a bit of nutmeg, adding more once you have poured the bread sauce into a warmed bowl or gravy boat."]}, "Neapolitan-style pizza": {"ingredients": ["500g/1lb 2oz strong plain flour ", "1 tsp salt ", "1 tsp fresh yeast ", "325ml/11fl oz lukewarm water ", "300g canned plum tomatoes ", "salt and freshly ground black pepper ", "4 tbsp extra virgin olive oil ", "30g/1oz Parmesan, freshly grated  ", "a few fresh basil leaves or some dried oregano ", "140g/5oz mozzarella, roughly chopped ", "extra virgin olive oil, for drizzling ", "1 garlic clove, finely chopped", "1 rosemary sprig, chopped", "30g/1oz taleggio, grated", "2 slices speck", "½ courgette, sliced", "¼ aubergine, sliced", "1 slice prosciutto", "handful rocket leaves"], "instructions": ["Preheat the oven to 250C/500F/Gas 9.  ", "In a large bowl, place the flour and salt together.  Dissolve the yeast in the lukewarm water and gradually add to the flour.  Mix well until you obtain a dough.  If you  find the dough too sticky, just add a little flour.  ", "Shape the dough into a ball and leave to rest covered with a cloth for 5 minutes.  After this time, you will find the dough much more pliable to work with.  Knead the  dough and split into two.  Knead each piece for a couple of minutes each and form into balls.  Sprinkle some flour on a clean kitchen cloth and place the dough on it  covering with a slightly damp cloth.  Leave to rise in a warm place for 30 minutes.  ", "Place the tomatoes in a bowl and squash them slightly, add salt and pepper and mix well.  ", "Sprinkle some flour on a clean work surface and with your fingers spread the dough into a roughly round shape with a border.  Make the dough as thin as a pancake  but beware not to split the dough.  Sprinkle some breadcrumbs on two large flat baking sheets and place the pizza bases on them.  ", "Spread a little of the tomato evenly over each base  -  not put too much as the pizza will go soggy.  Drizzle with olive oil, sprinkle with parmesan cheese, add a few  basil leaves or sprinkle some oregano and top with pieces of mozzarella cheese.  Then add topping of your choice.", "Place in the hot oven for 7 minutes (a couple of minutes longer if you prefer your pizza crispy).  Remove from the oven, drizzle with some olive oil and eat immediately - pizzas are not very nice cold or reheated!"]}, "New York cheesecake": {"ingredients": ["150g/5½oz digestive biscuits", "75g/2½oz butter, plus extra for greasing", "900g/2lb full-fat cream cheese", "200g/7oz caster sugar", "200ml/7fl oz soured cream", "3 tbsp plain flour", "3 free-range eggs, plus 1 egg yolk, lightly beaten", "2 tsp vanilla extract"], "instructions": ["Preheat the oven to 180C/350F/Gas 4. Grease and line the base of a 23cm/9in spring form cake tin.", "Place the biscuits in a plastic bag and crush with a rolling pin to fine crumbs.", "Melt the butter and add the biscuit crumbs, stir to combine. Place in the base of the cake tin and spread in an even layer, then flatten (use your fingers or a potato masher).", "Bake in the oven for 10 minutes until golden. Remove and leave to cool while you prepare the filling. ", "Reduce the oven to 160C/315F/Gas 2. ", "In a large bowl, beat together the cream cheese and sugar until smooth then add the sour cream and flour and beat again. Gradually add the eggs and vanilla essence beating well between each addition (beat in rather than whisk as you don’t want to incorporate too much air as this will affect the smooth surface of the cheesecake).", "Pour the cream cheese mix on to the biscuit base then bake in the oven for 45 minutes. The cheesecake should be just set with a slight wobble and should still be cream on top with just a slight golden hint around the edges.", "Once the cheesecake is cooked, turn off the oven and prop open the door so that it is slightly ajar and leave the cheesecake to cool in the oven – this prevents the top from cracking.", "Once the oven is cool you can remove the cheesecake to cool completely before removing from the tin."]}, "Norwegian tuna pasta bake": {"ingredients": ["30g/1oz unsalted butter", "½ tsp caraway seeds", "30g/1oz plain flour", "500ml/17fl oz full-fat milk", "100g/3½oz cream cheese", "salt and freshly ground black pepper", "½ onion, peeled, finely chopped", "130g/4½oz tinned tuna, drained, flaked", "160g/5½oz pasta (such as macaroni, penne or fusilli), cooked according to packet instructions, drained", "60-80g dried breadcrumbs", "6-8 anchovy fillets, cut in half lengthways"], "instructions": ["Preheat the oven to 200C/400F/Gas 6.", "Heat the butter in a frying pan over a medium heat. When the butter is foaming, add the caraway seeds and fry for 1-2 minutes, or until fragrant.", "Add the flour and whisk to a smooth paste. Continue to cook, stirring vigorously, for a further 3-4 minutes, then pour in 125ml/4½fl oz of the milk. Whisk the milk and flour mixture together to a smooth paste. ", "When the mixture is bubbling, add another 125ml/4½fl oz of milk and whisk until it is bubbling and incorporated into the mixture.", "Repeat the process with the remaining 250ml/9fl oz of milk. Continue to whisk and simmer until the sauce is smooth and thick enough to coat the back of a spoon. Remove the pan from the heat and stir in the cream cheese. Season, to taste, with salt and freshly ground black pepper.", "Add the onion, tuna and cooked pasta to the cheese sauce and stir until well combined. ", "Pour the mixture into an ovenproof dish. Sprinkle over the breadcrumbs and lay the anchovy fillets on top. Bake in the oven for 30 minutes, or until the breadcrumbs are crisp and golden-brown and the sauce is bubbling."]}, "No-churn rum and raisin ice cream with glazed pineapple": {"ingredients": ["150g/5½oz raisins", "50ml/2fl oz dark rum ", "300ml/½ pint pouring double cream", "1 x 397g tin full-fat condensed milk ", "1 medium ripe pineapple", "3 tbsp light muscovado sugar ", "3 tbsp rum ", "½ lime, juice only"], "instructions": ["For the ice cream, put the raisins in a saucepan. Add the rum and gently heat until just boiling. Spoon into a bowl, then cover and leave to soak overnight until all the raisins are plump and the rum has been absorbed. ", "Pour the cream into a large bowl and whisk using an electric hand whisk until soft peaks form when the whisk is removed from the bowl. Carefully fold in the condensed milk, then the raisins and any excess rum and mix well. ", "Spoon into a 1 litre/1¾-pint freezer-proof container or eight ramekins, and freeze for a minimum of 12 hours or overnight. ", "For the glazed pineapple, remove the base and top of the pineapple with a sharp knife and slice off the skin. Cut the pineapple lengthways into eight wedges, then remove and discard the core.", "Heat a large griddle pan until very hot. Use a heavy-based frying pan if you don’t have a griddle pan.", "Mix the sugar and rum together in a small bowl. Brush the rum glaze all over the pineapple wedges, then place in the pan and chargrill for 1 minute on each side or until golden and with griddle marks on the fruit – you just want to glaze the pineapple, not cook it, as it should still be firm when you eat it.", "Serve scoops of ice cream and the glazed pineapple drizzled with lime juice and any extra rum syrup."]}, "No bake fridge cake": {"ingredients": ["300g/10oz dark chocolate (or chocolate of your choice), chopped into squares", "150g/5oz unsalted butter, cubed", "2 tbsp golden syrup (or honey or maple syrup)", "225g/8oz mix of biscuits, roughly broken", "50g/2oz corn flakes", "200g/7oz mix of small chocolates or sweets such as malted balls or mini marshmallows", "colourful sprinkles, mini chocolate stars and mini meringues, to decorate"], "instructions": ["Grease and line a 23cm/9in square baking tin. ", "In a medium heatproof bowl, add the chocolate, butter and golden syrup. Put the bowl into a microwave and cook on a medium heat 30 seconds, stir and repeat 3–4 times or until it has melted. Make sure to keep an eye on your chocolate because it can burn quite easily. (See the tips box below if you don’t have a microwave.)", "Add the broken biscuits, cornflakes, chocolates and sweets, stirring after each addition. ", "Spoon the mixture to the lined tin. Using a spatula or wooden spoon, press the mixture down to make it flat and even. Top with sprinkles, chocolate stars and mini meringues. ", "Place the tin into the fridge for about an hour, or until the chocolate has set. Cut into squares and serve."]}, "Nigel Slater's gazpacho ": {"ingredients": ["½ cucumber, peeled, roughly chopped", "1 large yellow pepper, de-seeded, roughly chopped", "1 large red pepper, de-seeded, roughly chopped", "6 ripe tomatoes, roughly chopped", "2 banana shallots, roughly chopped", "3 garlic cloves, roughly chopped", "100g/3½oz stale white bread, soaked in a little cold water", "3 tbsp olive oil", "2 tbsp sherry vinegar"], "instructions": ["Blend most of the cucumber, peppers, tomatoes and shallots to a rough purée in a food processor, reserving a couple of chunks of each vegetable for the garnish. ", "Add the garlic, soaked bread, olive oil and sherry vinegar to the food processor and blend again until smooth, or to a more textured consistency if desired. ", "Transfer the soup to a jug, cover with cling film and chill for at least 20 minutes, or until cold.", "Cut the reserved vegetables into small cubes. When ready to serve, pour the gazpacho into bowls and garnish with the vegetables."]}, "New York chicken and apple salad": {"ingredients": ["2 crunchy red apples, such as Red Delicious or Cox’s, cored and cut into 1.5cm/⅝in slices", "½ lemon, juice only", "1 level tsp runny honey", "150g/5½oz red and green seedless grapes, halved", "2 celery sticks, thinly sliced", "4 spring onions, thinly sliced", "1 Little Gem, leaves separated, roughly torn", "2 x 150g/5½oz cooked chicken breasts, skin removed, roughly torn", "1–2 tbsp chopped toasted walnuts", "3–4 sprigs fresh dill, to garnish", "200g/7fl oz fat-free natural yoghurt", "1 garlic clove, crushed", "1 tbsp cider vinegar", "1 level tbsp wholegrain mustard", "2–3 tbsp chopped fresh dill", "salt and freshly ground black pepper"], "instructions": ["Put the apples in a wide salad bowl and toss with the lemon juice and honey. Add the grapes, celery, spring onion, lettuce and chicken and toss.", "To make the dressing, whisk the yoghurt, garlic, vinegar, mustard and dill together and season. Spoon over the salad and toss well.", "Scatter with the walnuts, garnish with dill and serve."]}, "Nasi goreng (Indonesian-style fried rice)": {"ingredients": ["2 garlic cloves, peeled", "pinch nutmeg ", "¼ tsp freshly ground black pepper ", "½ tsp ground turmeric ", "2 shallots, peeled", "25g/1oz unsalted peanuts ", "1 tsp salt ", "3 birds'-eye chillies, seeds removed ", "1 tbsp palm sugar ", "1-2 tbsp vegetable oil, or more if necessary", "2 tbsp vegetable or groundnut oil, plus extra for frying the eggs", "2 chicken breasts, skin removed, cut into thin strips ", "200g/7oz prawns, heads and shells removed and de-veined ", "110g/4oz fine green beans, trimmed and sliced into 1cm/½in pieces", "4 spring onions, sliced ", "275g/10oz cooked long-grain rice (this must be cold)", "splash light soy sauce", "splash ketjap manis (Indonesian soy sauce)", "4 free-range eggs", "½ cucumber, peeled, seeds removed, finely diced", "1 tbsp roughly chopped coriander", "50g/2oz peanuts ", "1 lime, cut into wedges", "handful crispy fried shallots ", "Asian-style chilli oil, to serve"], "instructions": ["For the spice paste, blend all of the spice paste ingredients together in a food processor. Add enough oil to bring the mixture together as a loose paste. Set aside.", "For the stir-fry, heat the oil in a wok over a high heat until shimmering hot, then add the chicken and fry for a minute or so, then add the spice paste and prawns and stir well, cooking for a good 4-5 minutes.", "Add the beans and spring onions and fry for another minute, keeping everything moving. ", "Add the cooked rice and stir until it's all been incorporated - you can add a few tablespoons of water at this point if it becomes a little dry and starts to stick. Season with soy sauce and ketjap manis, to taste.", "Heat a little of the oil in a large frying pan over a medium heat and fry the eggs until crisp at the edges and cooked to your liking.", "To serve, divide the stir-fry between two bowls, place two eggs on top and sprinkle over the garnish ingredients. Serve with the chilli oil on the side, for drizzling."]}, "Nachos": {"ingredients": ["1 tbsp olive oil ", "1 onion, finely chopped", "250g/9oz beef mince", "1 tsp hot smoked paprika ", "1 tsp ground cumin", "½ tsp chilli powder", "½ 400g tin black beans, drained", "200g/7oz lightly salted corn tortilla chips", "150g/5½oz cheddar, grated", "100g/3½oz cherry tomatoes, quartered ", "salt and freshly ground black pepper ", "4 spring onions, finely chopped ", "coriander (optional)", "sliced chillies (optional)", "lime wedges", "soured cream"], "instructions": ["Preheat the oven to 200C/180C Fan/Gas 6.  Heat the oil in a frying pan over a medium heat, add the onion and cook for 3–5 minutes until soft and translucent.", "Increase the heat and add the beef, paprika, cumin and chilli powder. Cook for 5-10 minutes, stirring occasionally, until the beef is browned. ", "Reduce the heat to medium and add the black beans, stirring gently, until the beans are heated through. Season with salt and pepper. ", "Line the base of a 1.5 litre/2¾ pint ovenproof dish or baking tray with a single layer of tortilla chips, then top with half of the beef mixture, then half the cheddar and half the cherry tomatoes. Add a second layer of tortilla chips, then top with the remaining beef and cheese. Transfer to the oven and cook for 8–10 mins, until the cheese has melted. ", "Remove the nachos from the oven and top with the remaining cherry tomatoes, spring onions, coriander and chilli, if using. Serve hot with the soured cream and lime wedges.  "]}, "Neck of lamb with lemon and thyme": {"ingredients": ["2 tbsp olive oil", "1kg/2¼lb scrag end of neck of lamb, on the bone, or chops from the neck end, or both", "juice of 1½  lemons, plus a little thinly pared rind", "6-8 sprigs of thyme", "a wine glass of water, or lamb stock", "salt and fresh ground black pepper", "white bread", "Greek-style tomato and onion salad"], "instructions": ["Heat the oil in a heavy-based saucepan. Add the lamb and allow it to sizzle and spit, turning occasionally until lightly browned all over. ", "Add the lemon juice, thyme, water or stock, a little salt and plenty of pepper. Bring to the boil then turn down the heat to a gentle simmer and place a lid on the pan. Cook gently, turning the meat over occasionally, for about 50 minutes, until the meat is tender.", "Serve with plenty of good white bread and a perhaps a simple Greek style tomato and onion salad."]}, "Navajo lamb stew": {"ingredients": ["2 tbsp oil or lard", "1kg/2lb 4oz lamb or mutton neck fillet, cut into chunks", "2 onions, roughly chopped", "2 garlic cloves, roughly chopped", "1 tbsp coriander seeds, lightly crushed", "1 tbsp dried thyme ", "2 tbsp tomato purée", "3 celery sticks, trimmed and cut into large chunks", "4 carrots, peeled and cut into large chunks", "2 large potatoes, peeled and cut into chunks", "½ pointed or hispi cabbage, cut into wedges or chunks", "250g tin sweetcorn or hominy, drained and rinsed", "salt and freshly ground black pepper", "finely chopped celery leaves, to garnish", "125g/4½oz medium fine cornmeal or polenta", "125g/4½oz plain flour", "1 tsp baking powder", "1 tsp dried thyme or oregano (optional)", "50g/1¾oz butter, chilled and diced", "125ml/4fl oz milk", "salt and freshly ground black pepper"], "instructions": ["Heat the oil in a large casserole over a high heat. Season the meat with plenty of salt and pepper, then add the lamb to the casserole and sear on all sides until it has developed a rich brown crust. You will probably need to do this in two batches. Remove from the casserole and add the onion. Fry until lightly browned, then stir in the garlic, coriander seeds, thyme and tomato purée. Continue to cook for a few minutes, stirring constantly, and then pour in 1 litre/1¾ pint water.", "Return the lamb to the casserole and bring to the boil. Turn down the heat, cover and leave to simmer for 1 hour. Add the celery, carrots, potatoes and cabbage, cover and cook for another hour.  ", "While the vegetables are cooking, make the dumplings. Mix the cornmeal, flour, baking powder and thyme, if using, in a bowl and season with plenty of salt and pepper. Add the butter and rub it in until you have a mixture resembling fine breadcrumbs. Gradually add the milk and work until you have a dough. Divide the dough into six dumplings.", "Add the sweetcorn to the casserole and push down into the liquid. Place the dumplings on top, cover and cook for around 20 minutes, until the dumplings are well risen and cooked through. "]}, "Nigerian stew and cauliflower fried ‘rice’": {"ingredients": ["1 red pepper, deseeded and chopped", "1 brown onion, roughly chopped", "4 garlic cloves, finely chopped or grated", "4cm/1½in piece fresh root ginger, peeled and finely grated", "generous pinch red chilli flakes, plus extra if desired", "2 tbsp vegetable oil", "1 brown onion, finely chopped", "2 garlic cloves, finely chopped", "¼ tsp chilli powder", "½ tsp smoked paprika", "½ bay leaf", "1 tsp caster sugar", "¼ tsp allspice", "1 heaped tbsp tomato purée", "400g tin chopped tomatoes", "salt and freshly ground black pepper", "small handful chopped fresh basil, to garnish", "1 cauliflower, cut into florets", "2 tbsp olive oil", "4 smoked bacon rashers (back or streaky), chopped (optional)", "2 garlic cloves, finely chopped ", "1 brown onion, finely chopped", "2.5cm/1in piece fresh root ginger, finely grated", "1 yellow pepper, deseeded and finely chopped", "½ vegetable stock cube ", "salt and freshly ground black pepper"], "instructions": ["For the paste, put all the ingredients in a food processor and pulse to form a smooth paste.", "For the sauce, heat the oil in a large non-stick frying pan and fry the onion and garlic for 6–8 minutes, or until softened, stirring frequently. Add the paste and fry for a further 1–2 minutes. Stir in the chilli powder, paprika, bay leaf, sugar, allspice, ½ tablespoon salt and a generous pinch pepper. Fry for 1–2 minutes until the spices are aromatic. Stir in the tomato purée and then add the chopped tomatoes. Pour in around 100ml/3½fl oz water. Stir well and cook over a low heat for 35–40 minutes, stirring occasionally. Add a splash of water if it looks too dry. Check and season with salt and pepper if needed and add additional chilli flakes to reach your desired heat. Remove and discard the bay leaf. ", "Meanwhile, for the cauliflower rice, coarsely grate the raw cauliflower into a bowl (or use a food processor to pulse in batches until it resembles fine crumbs or rice). Season with salt and pepper. ", "Heat the oil in a large non-stick frying pan over a medium–high heat and fry the bacon, garlic, onion and ginger for a few minutes, stirring frequently. When the bacon is crisp, add the cauliflower ‘rice’ and yellow pepper. Fry for a couple of minutes to soften.", "Crumble in the stock cube and pour in 75–100ml/2½–3½fl oz boiling water. Stir to dissolve the stock cube. Cook for 5 minutes, stirring occasionally, until the mixture is dry and has a fluffy texture. Season with salt and pepper if needed. ", "To serve, divide the cauliflower rice between serving plates and spoon the sauce on top. Scatter with chopped basil to garnish."]}, "Nigella's mince pies": {"ingredients": ["240g/8oz plain flour", "60g/2oz vegetable shortening", "60g/2oz cold butter, cut into small cubes", "1 orange, juice only", "pinch salt", "350g/12oz Christmas mincemeat", "icing sugar, for dusting", "You will need a miniature tart tray, each indent 4.5cm/1¾in diameter, a 5.5cm/2¼in round fluted biscuit cutter and a 4cm/1½in star-shaped pastry cutter."], "instructions": ["Sift the flour into a shallow freezer-proof bowl, then add small mounds of vegetable shortening. ", "Add the butter, shake to cover it, then place into the freezer to chill for 20 minutes. (This will make the pastry tender and flaky.)", "Mix the orange juice and salt in a separate bowl. Cover and leave in the fridge to chill.", "After the 20 minutes, empty the chilled flour and shortening mixture into the bowl of a food processor and pulse to make porridge-like crumbs.", "Gradually add the chilled salted orange juice, pulsing until the mixture is just coming together as a dough. Stop just before it comes together (even if some orange juice is left). If all the juice is used up before the dough has begun to come together, add some iced water.", "Turn the mixture out onto a clean, floured work surface and, using your hands, knead the mixture to form a dough.", "Divide and shape into three equal-sized discs (you'll need to make the mince pies in three separate batches of 12, unless you've got enough tart tins to make all 36 pies at once).", "Wrap each disc in cling film and place into the fridge to rest for 20 minutes.", "Preheat the oven to 220C/425F/Gas 7.", "Remove a pastry disc from the fridge and roll out on a floured work surface thinly, but so that it will be sturdy enough to support the dense mincemeat filling.", "Using a fluted pastry cutter, cut out 12 circles a little wider than the moulds in the tart tins. Press the circles gently into the moulds.", "Place a teaspoon of mincemeat into each pastry case.", "Reroll any remaining dough to a similar thickness, then using a star-shaped cutter, cut out 12 stars and place each lightly onto the mincemeat filling.", "Transfer to the oven and bake for 10-15 minutes, or until the pastry is golden-brown. Keep an eye on them as they don't take very long to cook.", "Remove from the oven, prising out the little pies straight away and placing onto a wire rack to cool. Allow the empty tray to cool down before repeating the steps from step 10. Repeat until you have made 36 mince pies.", "Dust the mince pies with icing sugar and serve."]}, "No-churn strawberry ice cream": {"ingredients": ["200ml/7fl oz double cream", "100g/3½oz natural yoghurt", "400g/14oz strawberries, hulled", "2 tbsp icing sugar", "1 tbsp lemon juice", "4 free-range eggs, 2 whole, 2 yolks ", "100g/3½oz granulated sugar", "fine salt"], "instructions": ["Whisk the cream in a bowl until soft peaks form when you lift up the whisk. Gently fold in the yoghurt and set aside. ", "Put the strawberries, icing sugar and lemon juice in a food processor or blender and blitz to a smooth purée. Set aside.", "Mix the whole eggs, egg yolks, granulated sugar and a pinch of salt in a heatproof bowl. Set over a pan of gently simmering water (do not let the base of the bowl touch the water) and stir constantly until it reaches 70C/160F. Remove from the heat and using an electric whisk, beat the egg mixture until pale, thick and at least tripled in volume. ", "Set aside 100ml/3½fl oz of the strawberry purée into a small bowl. Mix the remaining purée into the beaten egg mixture until combined.", "Stir one third of the egg mixture into the whipped cream to loosen, then gently fold in the remaining mixture. Pour into a lidded freezable container.", "Drizzle the reserved strawberry purée over the cream and swirl a spoon through it a few times to make a ripple. Put the lid on the container and freeze for at least 4 hours, or until firm.", "Remove from the freezer and leave to stand at room temperature for 10–15 minutes before serving."]}, "No-churn cheesecake ice cream with cherries jubilee": {"ingredients": ["175g/6oz condensed milk", "250ml/9fl oz double cream", "1½ tbsp lemon juice", "1½ tbsp lime juice", "3 tbsp advocaat", "400g/14oz frozen cherries", "50g/1¾oz caster sugar", "3 tbsp lemon juice", "4 tbsp kirsch, cherry brandy, brandy or rum"], "instructions": ["To make the ice cream, stir the condensed milk into the cream and whisk until soft peaks form, then carry on whisking as you add the lemon and lime juice and the advocaat. Spoon into 2 x 500ml/18fl oz tubs and freeze for 6 hours or overnight. Remember to take it out of the freezer 10–20 minutes before serving.", "To make the cherries jubilee, put the frozen cherries, sugar and lemon juice in a wide, heavy-based saucepan, put the lid on and cook for 3 minutes over medium–low heat, then remove the lid and carry on cooking gently until the cherries are hot, and have exuded a pool of deep red juice.", "Now for a spot of flambéing. Turn off the heat under the pan, measure out the kirsch or your chosen liqueur and then put the bottle safely away from the hob. Throw the liqueur into the pan and quickly, using a long match and standing at arm’s length, set fire to the surface where you’ve just added the alcohol, and swirl the pan. It will flame only briefly, but when the last of the fire has flickered out, pour the cherries and their juices into a heatproof bowl, and let people spoon this over ice cream."]}, "Nigel Slater's apple crumble": {"ingredients": ["1kg/2lb 3½oz Bramley apples", "pinch sugar, to taste", "1 tbsp water or apple juice", "100g/3½oz plain flour", "75g/2½oz butter", "50g/2oz rolled oats", "100g/3½oz demerara sugar"], "instructions": ["Preheat the oven to 200C/400F/Gas 6.", "Wipe the apples and cut them into quarters, then remove the cores and slice each piece in two. Put them into a pan, taste a slice for sweetness and add a sprinkling of sugar accordingly. Add a tablespoon of water or apple juice and cook over a medium heat for about five minutes, until the apples start to soften.", "Transfer the apple mixture to a shallow ovenproof pie dish.", "Blend the flour and butter in a food processor for a few seconds, until the mixture looks like breadcrumbs.", "Stir in the oats and the brown sugar and sprinkle over the cooked apples in the pie dish. Transfer to the oven to bake for 30 minutes or until crisp and golden-brown on top."]}, "Nadiya's Russian honey cake": {"ingredients": ["80g/2¾oz unsalted butter ", "270g/9¾oz runny honey ", "120g/4½oz golden caster sugar ", "2 free-range eggs, lightly beaten ", "1 tsp bicarbonate of soda ", "500g/1lb 2oz plain flour, sifted, plus extra for dusting ", "fresh berries, to serve ", "600ml/20fl oz soured cream ", "80g/2¾oz icing sugar ", "250ml/9fl oz double cream ", "65g/2½oz runny honey ", "1 tsp vanilla bean paste ", "100g/3½oz roasted hazelnuts, finely chopped", "½ tsp salt "], "instructions": ["Put the butter in a small saucepan, bring to the boil, then reduce the heat and cook until starting to brown. As soon as the little grains of milk solids become dark, take off the heat. Add the honey and sugar and heat until the sugar has dissolved. Tip into a large bowl and leave to cool for 15 minutes. Add the eggs and mix well. Add the bicarbonate of soda and the flour and mix until a smooth dough forms. Cover and chill in the fridge for at least 2 hours. ", "Roll the dough into a sausage shape and divide into 8 equal pieces. You can weigh them if you want to be exact. Dust a surface and your hands generously with flour and shape the 8 pieces into balls. ", "Line 2 baking trays with baking paper and preheat the oven to 180C/160C Fan/Gas 4. Find or create an 18cm/7in round template, using a plate or the base of a cake tin, for example. ", "Dust a ball of dough with flour, then place between 2 sheets of baking paper and roll out to about 3mm thick. Use the template to cut out a circle, making sure to keep all of the scraps. Repeat with all 8 balls. Pop the circles onto the baking trays (however many will fit) and bake for just 5 minutes. As soon as they are baked, take off the tray, transfer to a wire rack and repeat until you have done all 8. Arrange the scraps in an even layer across the 2 trays and bake for about 5 minutes until they are really crisp and golden. Set aside. ", "To make the filling, mix together the soured cream and icing sugar really well in a bowl. Place the double cream in a separate large bowl and whip to soft peaks. Fold in the soured cream mixture, honey and vanilla. ", "It is best to assemble this cake directly on a serving plate (one that can fit in the fridge). Use a dab of the cream filling to secure the first circle onto the serving dish. Drop about 3 tablespoons of the cream mixture on top and carefully spread evenly all over. Put the next circle on and repeat until you have done all 8 layers. You should still have enough cream to cover the top and sides, so do exactly that and smooth over as best you can. It doesn’t have to be perfect, because we are going to really cover this up. ", "Put the baked scraps in a food processor and blitz to a fine crumb. Mix in the roasted hazelnuts and salt. For extra decoration, I like to create a heart-shaped template that just fits the top of the cake and lay that on top, but choose whatever shape you like – even use a doily, if you can find one or know what one is! If you don’t want to use a template, just mark a heart (or other shape) on the icing with a cutlery knife and use that as a guide for where to stick the crumbs. ", "Take the crumb mixture and gently press onto the sides and the top around your template, before removing it. You might have to pipe more filling onto your shape to neaten up the edges. Transfer to the fridge to set and chill. Serve with the fresh berries."]}, "Nonnettes": {"ingredients": ["80g/2¾oz salted butter", "200ml/7fl oz honey", "100ml/3½fl oz milk", "90g/3¼oz dark brown sugar", "250g/9oz plain flour", "50g/1¾oz rye flour", "2 tsp baking powder", "1 tsp bicarbonate of soda", "pinch ground cinnamon", "pinch Chinese five-spice powder", "pinch ground ginger", "pinch freshly grated nutmeg ", "pinch mace", "150g/5½oz marmalade", "fine orange zest", "icing sugar"], "instructions": ["Preheat the oven to 200C/180C/Gas 6 and grease a 6-hole muffin tin. ", "Mix the butter, honey, milk, sugar and 100ml/3½fl oz of water together in a pan over a medium heat to dissolve the sugar and melt the butter.", "Sift the flours with the baking powder, bicarbonate of soda, cinnamon, Chinese five-spice powder, ginger, nutmeg and mace in a bowl. ", "Stir the melted liquid mixture into the flour and spices while still warm and mix well. ", "Fill 8 of the muffin holes halfway then add a spoon of marmalade and top up each hole with the remaining mixture.", "Bake for 20 minutes. Remove, cool and sprinkle over the orange zest and dust with icing sugar to decorate."]}, "No-knead black bread ": {"ingredients": ["500ml/18fl oz Irish stout, such as Guinness, opened in advance if possible", "1 large free-range egg, at room temperature, separated", "30g/1oz dark muscovado sugar", "2 tbsp extra virgin olive oil", "2 tbsp black treacle", "300g/10½oz dark rye flour", "300g/10½oz strong white bread flour", "25g/1oz cocoa", "1 tsp activated charcoal (optional)", "4 tsp nigella seeds, plus 1 tsp for sprinkling ", "4 tsp caraway seeds", "4 tsp fennel seeds", "¼ tsp (1g, but it’s hard to get it to register on the scales) fast-action dried yeast", "1¼ tsp fine sea salt", "vegetable oil, for greasing ", "smoked salmon ", "few dill fronds"], "instructions": ["Pour the stout into a large measuring jug to come up to 400ml/14fl oz; you will need to wait for the frothing to subside. If you think about it ahead of time, it might be wise to open the bottle a bit earlier. Don’t drink the remaining 100ml/3½fl oz yet, as you may need some of it shortly. When the beer’s calmed down enough to be measured clearly, add the egg white (reserving the yolk in a little covered bowl in the fridge for the egg wash the next day), followed by the sugar, the oil, and then the treacle. Stir or whisk gently to mix, as it may fizz up a bit. ", "Mix the flours, cocoa, activated charcoal (if using), seeds, yeast and salt in a large bowl. ", "Give your jug of dark liquid another stir, then pour a third into the bowl and mix. Repeat until all the liquid is used up. You may still need to use more liquid, so slowly stir in as much of the remaining stout as you need to form a sticky mixture. It won’t look very dark: until it’s baked, it has the buff colour of cookie dough, unless you’re adding activated charcoal, in which case it will be cowpat brown. Cover with cling film (or a shower cap) and leave it in the kitchen for 16–20 hours, until it has increased in volume, has a slightly spongy texture and is bubbly on top.", "Grease a sturdy 2lb/900g loaf tin and line the base with baking parchment. Scrape the bread dough into the tin, smoothing it very gently out to the edges and on top. Drape a clean tea towel over the tin and leave for 2 hours. It will rise a little, but not much. Towards the end of this time preheat the oven to 220C/200C Fan/Gas 7.", "Add a teaspoon of cold water to the reserved egg yolk and mix with a little whisk or a fork, then dab a pastry brush into the yellow goo and lightly paint the surface of the bread. I can’t honestly say you use much of this yolk; if, like me, you find waste difficult, then keep it to add to a couple of eggs for scrambling.", "Sprinkle the teaspoon of nigella seeds on top and put the tin into the oven, immediately turning the heat down to 200C/180C Fan/Gas 6. Bake for 40 minutes, then (wearing oven gloves, and perhaps giving a nudge around the edges with a small palette knife) slip it out of its tin. It will feel almost cooked, but it is a dense, weighty loaf: don’t expect white-bread lightness; even when fully cooked, this loaf feels as heavy as a brick. Give the loaf a knock underneath: it probably won’t sound hollow, but register the sound.", "Put the loaf, out of its tin, back into the oven directly on the shelf for 10–15 minutes, by which time it will feel firm, but still with a bit of give at the sides and, when you knock it underneath, it will sound, if not exactly hollow, then hollower than it did before. Allow to cool completely on a wire rack before even thinking of cutting into it. ", "Serve slices topped with smoked salmon and dill."]}, "Nutty toffee apples": {"ingredients": ["6 Cox apples", "6 small wooden ice lolly sticks ", "225g/8oz granulated sugar", "110ml/4fl oz water", "30g/1oz butter", "2 tbsp golden syrup", "4 tbsp finely chopped mixed nuts"], "instructions": ["Push the wooden sticks halfway into the apples at the stalk end.", "Dissolve the sugar and water in a thick-bottomed pan over a gentle heat.", "Add the butter and syrup to the mixture and bring to the boil. Continue to boil, without stirring, until the toffee reaches 140C/275F (use a sugar thermometer to measure this).", "Remove the pan from the heat and gently stir in the nuts.", "Carefully dip each apple into the toffee, making sure each apple is well coated, and set aside to harden on a baking try lined with non-stick parchment."]}, "Non-alcoholic Bloody Mary": {"ingredients": ["1 litre/1¾ pint tomato juice", "1 bunch celery leaves (washed and picked from ½ a bunch of celery)", "dash Tabasco sauce (to taste)", "dash creamed horseradish", "dash HP sauce (to taste)", "2 limes, juice only", "crushed ice (optional)"], "instructions": ["Put everything in a big jug and mix", "Add a handful of crushed ice if you like but Ben has his without!"]}, "Nourishing mixed seafood broth": {"ingredients": ["1 tbsp yellow miso paste", "2 tbsp grated fresh root ginger", "100g/3½oz cooked Somen noodles ", "2 large handful of baby pak choi (white stem variety), washed, leaves separated", "150g/5½oz fresh medium-sized tiger prawns, shelled with head off, tail on, cleaned and deveined", "100g/3½oz baby squid, tentacles separated, body sliced to give squid rings", "100g/3½oz mussels, preferably Greenland mussels, cleaned and de-bearded (discard any shells that are broken, or open and do not close when tapped sharply on the work surface)", "2 tbsp Shaoxing (Chinese rice wine) or dry sherry", "2 tsp low-sodium light soy sauce or tamari", "salt, to taste", "2 pinches ground white pepper", "2 small handfuls of coriander, roughly chopped, to garnish "], "instructions": ["Pour 1 litre/1¾pints water into a medium wok and bring to the boil.", "Add the miso paste and ginger and cook on a medium heat for 5 minutes. ", "Add the somen noodles, pak choy and all of the seafood. Cook for 1 minute until the mussel shells have opened. Discard any mussels that remain closed. Season with the rice wine, soy sauce, salt and pepper.", "Transfer to deep bowls, garnish with the coriander and eat immediately."]}, "Nutty chicory canapes": {"ingredients": ["1 head of chicory, divided into 6 individual leaves", "55g/2oz goats' cheese, crumbled", "55g/2oz cooked new potatoes, chopped", "55g/2oz cooked peas", "30g/1oz walnuts, roughly chopped", "3 tbsp olive oil", "1 tbsp balsamic vinegar", "1 tbsp clear honey", "1 tsp wholegrain mustard", "salt and freshly ground black pepper"], "instructions": ["Place the six chicory leaves on a serving plate.", "In a small bowl, mix the goats' cheese, potatoes, peas and walnuts together until combined.", "For the dressing, in a small bowl whisk together all the dressing ingredients and mix in the goats' cheese and potato mixture.", "Spoon the goats' cheese mixture into the chicory leaves and season with salt and freshly ground black pepper.", "Chill until required and serve."]}, "Noodle and broccoli stir-fry": {"ingredients": ["2 tbsp olive oil", "6 long stemmed broccoli florets", "4 spring onions, chopped", "½ mango, peeled and sliced", "110g/4oz egg noodles, cooked according to packet instructions", "¼ scotch bonnet chilli, finely chopped", "2 tbsp fresh chopped herbs", "1 tbsp olive oil"], "instructions": ["Heat two tablespoons of olive oil in a large non-stick frying pan. Add the  broccoli florets and sauté for 3-4 minutes, to soften.", "Add the spring onions and sauté for a further 1-2 minutes. ", "Stir in the mango slices and then add the cooked noodles. ", "Stir in the chilli and continue to stir-fry for a further 3-4 minutes.", "Finally add the herbs with a tablespoon of olive oil. Heat for another minute and transfer to a serving plate to serve."]}, "Nasi lemak": {"ingredients": ["400ml tin coconut milk", "thumb-sized piece fresh root ginger, peeled and finely chopped    ", "1 lemongrass stalk", "350g/12oz basmati rice ", "salt", "1 piece pandan leaf, tied in a knot, to serve", "2 tbsp vegetable oil", "1 onion, thinly sliced", "1 garlic clove, finely chopped", "1 tsp shrimp paste", "1–2 tsp red chilli paste", "250g/9oz dried anchovies, soaked in water and drained ", "1 tbsp caster sugar ", "250ml/9fl oz tamarind paste mixed with 400ml/13fl oz water", "1 free-range egg", "vegetable oil for deep frying", "handful small dried white anchovies ", "handful peanuts, skin-on if possible", "½ cucumber, thinly sliced "], "instructions": ["Put the coconut milk, ginger, lemongrass, rice and a pinch of salt in a large saucepan. Add 400ml/14fl oz water, stir and cook over a medium heat for 10–15 minutes, or until the rice is cooked and all the liquid has been absorbed. ", "To make the sambal, heat the oil in a frying pan and sweat the onion and garlic for 5–7 minutes, until soft. Add the shrimp paste, chilli paste and most of the soaked anchovies and stir. Add the sugar and a pinch of salt and pour in the tamarind water. Simmer until it reduces to a thick paste. Set aside.", "Meanwhile, to prepare the garnish, boil the eggs in water for 7–10 minutes; the yolks should be firm. When they are cool enough to handle, peel off the shells and cut the eggs in half. Preheat the oil in a deep-fat fryer to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.) Deep-fry the dried white anchovies for 3 minutes, or until crispy. Toast the peanuts in a dry frying pan.", "Pick the lemongrass out of the rice and discard. Put the rice in a small bowl and press down until it is compacted. Upturn the rice in the middle of the pandan leaf. Arrange the egg, peanuts, cucumber and remaining anchovies around the rice and scatter over the crispy anchovies. "]}, "No pastry savoury pie": {"ingredients": ["vegetable oil, for greasing", "1 free-range egg", "150g/5½ oz ricotta", "25g/1oz leek, finely sliced", "1 large rasher cooked bacon, chopped"], "instructions": ["Preheat the oven to 200C/400F/Gas 6. Grease six holes of a muffin tray with vegetable oil.", "Beat the egg and ricotta together in a bowl until smooth. Stir in the leek and bacon.", "Divide the mixture between the muffin holes and bake in the oven for 30 minutes or until just cooked through."]}, "Noodle salad": {"ingredients": ["1 tsp soy sauce", "1 tsp sesame oil", "1 tsp sesame seeds", "1 tsp honey", "½ tsp dried chilli flakes", "100g/3½oz rice noodles, cooked according to packet instructions", "½ red onion, finely chopped", "50g/1¾oz rocket", "1 orange, peeled and segmented", "salt and freshly ground black pepper"], "instructions": ["Place the soy sauce, sesame oil, sesame seeds, honey and chilli flakes into a large bowl and whisk together.", "Add the noodles, onion, rocket and orange segments and toss together and season, to taste, with salt and freshly ground black pepper.", "To serve, place the noodle salad into the centre of a dish."]}, "Noodles with mushrooms and deep-fried spring onions": {"ingredients": ["3 tbsp vegetable oil", "150g/5¼oz cooked noodles ", "3 spring onions, finely chopped", "juice of one lime", "75g/2¾oz mixed mushrooms, chopped", "2 tbsp chives, chopped", "2 tbsp coriander, chopped ", "2 tbsp mint, chopped ", "2 tbsp soy sauce", "250ml oil for deep-frying", "6 spring onions, white part only", "100g/3½oz self-raising flour ", "50ml water"], "instructions": ["In a wok heat the oil and add the noodles, spring onions, mushrooms and lime juice. Cook for five minutes.", "Add the chives, coriander, mint and soy and remove from the heat.", "In a bowl mix the flour and water to a smooth paste.", "Coat the spring onions in this batter. ", "Heat the oil in a heavy-bottomed pan (CAUTION: hot oil can be dangerous, do not leave unattended). Fry the spring onions in the hot oil for two minutes or until golden then remove and drain of excess oil on kitchen paper.", "To serve, place the noodles and mushrooms in a bowl and garnish with the deep fried onions."]}, "New potatoes with beans and olives": {"ingredients": ["1 tbsp olive oil", "25g/1oz butter", "200g/7oz cooked new potatoes, quartered", "100g/3½oz green beans, trimmed", "75g/2¾ oz black olives, pits removed, chopped", "salt and freshly ground black pepper"], "instructions": ["Heat the oil and butter in a frying pan and fry the potato quarters until they turn golden-brown. ", "Add the green beans to the pan and cook for 4-5 minutes, until the beans are tender. ", "Stir in the olives and salt and freshly ground black pepper. Serve as a side dish."]}, "Norfolk dumplings with mince and boiled potatoes": {"ingredients": ["3 tbsp olive oil", "3 onions, finely chopped", "2½ beef stock cubes, preferably organic", "2kg/4lb 2oz beef mince", "1 tbsp Worcestershire sauce", "1 litre/1¾ pints water", "2 tbsp gravy browning powder", "salt and freshly ground black pepper ", "1.5kg/3lb 4oz self-raising flour, plus extra for dusting", "6 tbsp chopped fresh parsley leaves", "salt and freshly ground black pepper ", "500-750ml/18fl oz-1 pint 6fl oz cold water", "3kg/6lb 8oz white potatoes, peeled, cut into equal-sized pieces", "150g/5oz butter", "600g/1lb 5oz young carrots, scrubbed, trimmed"], "instructions": ["For the mince, heat the oil in a large casserole dish over a high heat. Add the onions and fry for 3-4 minutes, or until softened.", "Add the stock cubes and stir well to dissolve them in the oil. Fry for a further minute.", "Add the mince, in batches, and fry for 6-8 minutes, stirring, or until browned all over. Remove the cooked mince and set aside on a plate. Repeat the process with the remaining mince.", "Return the cooked mince to the casserole, then add the Worcestershire sauce and water and bring the mixture to a simmer.", "Add the gravy browning powder and season, to taste, with salt and freshly ground black pepper. Cover the casserole with a lid and simmer for three hours, stirring occasionally, or until the cooking liquid has thickened and the meat is tender. ", "Meanwhile, for the dumplings, in a large mixing bowl, mix together the flour and chopped parsley. Season, to taste, with salt and freshly ground black pepper.", "Gradually add the water in a thin stream, stirring well, until the mixture comes together as a firm dough. (NB: You may not need to use all of the water.)", "Turn the dough out onto a lightly floured work surface and knead lightly until smooth. Pinch off golf ball-sized pieces of the dough and roll into balls.", "Boil the potatoes in a pan of salted water for 10-15 minutes, or until tender. ", "As the potatoes are cooking, carefully lower the dumplings into the boiling water. When all the dumplings have been added to the pan, reduce the heat until the mixture is simmering, then cover the pan with a lid and simmer for 12-15 minutes, or until the dumplings have risen and the potatoes are just tender. ", "Remove the dumplings from the pan using a slotted spoon and set aside to drain on kitchen paper, then drain the potatoes and return them to the pan. Add half of the butter and stir until the butter melts and coats the potatoes. ", "Meanwhile, bring a pan of salted water to the boil, add the carrots and cook for 4-5 minutes, or until tender. Drain well, then return the carrots to the pan and stir in the remaining butter. Season, to taste, with salt and freshly ground black pepper.", "To serve, spoon the dumplings into the centre of each of 12 serving plates. Spoon over the mince. Serve the buttered potatoes and carrots alongside."]}, "Non-alcoholic mulled cider": {"ingredients": ["3½pts/2L fresh apple juice", "2 apples, studded with 3 cloves each", "2 cinnamon sticks", "5 allspice berries", "zest of 1 orange", "slices of apple for garnish"], "instructions": ["Combine all ingredients in a large saucepan and simmer gently for 30 minutes - do not boil. ", "Transfer to a heatproof bowl and ladle into glass mugs. Garnish with apple slices to serve."]}, "Noodles and Vegetable Kabab": {"ingredients": ["Boiled noodles 2 cups", "Carrots 1 cut into tiny cubes and boiled", "Capsicum 1 cut into tiny cubes", "Cabbage 1 cup cut into tiny cubes", "Crushed red pepper 1 Â½ tsp", "Green chilies chopped 2", "Coriander leaves chopped 2 tbsp", "Potatoes boiled and mashed 2 cup", "Salt 1 Â½ tsp", "Cumin roasted and crushed 1 tsp", "Chat masala 1 tsp", "Fresh bread crumbs 1 Â½ cup", "Egg 1 to 2"], "instructions": ["Boil noodles and boil carrots, boil potatoes and mashed, mix all together except egg and crumbs, make into Pattie shape, make a hole in center like waras, dip in eggs, roll in crumbs, deep fry."]}, "Nawabi Handi": {"ingredients": ["Â 500 gm Chicken boneless", "Â as per taste salt", "Â 1 tsp Garlic Paste", "Â 1 tsp Ginger Paste", "Â 1 Lemon Juice", "Â 2 Green Chili chopped", "Â 1/2 cup Yogurt", "Â 1 tsp Red Chili Powder", "Â 1 tsp all spices Powder", "Â 1 tsp Cumin Powder", "Â 1 tsp Coriander Powder", "Â 4 tbsp Oil", "1/4 cup oil", "1tsp p green cardamom", "2 – Â½ onion paste", "4 tbsp Cream", "1/4 c capsicum Julian", "3 tbsp Almond, Cashew, Pistachio"], "instructions": ["<strongMethod:</strong"]}, "Nacho Supreme": {"ingredients": ["Tortilla chips 2 large packets", "Grated cheese 1 cup", "Iceberg lettuce sliced 1 cup", "Olives as required", "Jalapeno peppers as required", "Onion finely chopped Â½ cup", "Tomato chopped 1", "Coriander leaves chopped 2 tbsp", "Green chilies 2", "Thin chili sauce Â½ cup", "Lemon juice 2 tbsp", "Salt 1 tsp", "Ketchup 2 tbsp", "Tetra pack cream 1 packet", "Salt Â½ tsp", "Lemon juice 1 tbsp", "Coriander leaves chopped 1 tsp", "Cream Â½ packet", "Milk Â½ cup", "Grated cheddar cheese Â½ cup", "Thin chili sauce 4 tbsp", "Method for sar cream", "Mix all together."], "instructions": ["<strongTo assemble:</strong<br /In a oven proof platter, put 1 big packet of doritos, drizzle nacho sauce, then grated cheese, put in oven for 5 mins on 180 d till cheese melts, remove, spread with finely sliced iceberg lettuce, prepared salsa, dot with sar cream, sliced olives, sliced jalapenos, serve immediately."]}, "Nuggets Kung Pao with Fried Rice": {"ingredients": ["Chicken nuggets 8-10", "Oil 1-2 tbsp", "Chopped garlic 2-3", "Dry chilies 4-5", "Soy sauce 3- 4 tbsp", "Honey or sugar 1 tbsp", "White pepper Â¼ tsp", "Salt as required", "Chicken powder Â½ tsp", "Corn flour as required", "Roasted Peanuts 12 – 14", "Capsicum julienned 1/2", "Oil for fry", "Boiled rice 1 cup", "Oil 2 – 3 tbsp", "Egg 1 – 2", "Yellow food color few drops", "Carrot chopped Â¼ cup", "Spring onion chopped Â¼ cup", "White pepper as required", "Salt as required", "Chicken powder Â½ tsp", "Sugar Â½ tsp"], "instructions": ["To make kungpao heat oil in a pan, add garlic and dry chilies and fry", "Then add soya sauce, honey, salt, chicken powder, white pepper, and a little water and cook for 1 minutes", "Then add capsicum, nuggets", "Cook until sauce boils", "Finally add cornflour and thicken the sauce", "To make fried rice, heat oil in a pan and fry eggs", "Then add carrots and fry", "Then add boiled rice and all spices and mix", "&#8211; Finally add green onions, mix and serve"]}, "Nauratan Biryani": {"ingredients": ["Rice soaked and boiled 750 gm", "Brown onion 1 cup", "Carrots cut in cubes 2", "Potatoes cut in big cubes 2", "Peas 1 cup", "Brinjal 1 cut in cubes", "Beans 1 cup", "Fenugreek small 4 bunches chopped", "Spinach finely chopped 1 Â½ cup", "Ginger garlic paste 1 tbsp heaped", "Chili powder 2 Â½ tsp", "Roasted &crushed cumin 1 Â½ tsp", "Coriander powder 2 tsp", "Tomatoes chopperized 4", "Coriander leaves Â½ cup", "Green chilies 4", "Mint leaves Â½ cup", "Lemon juice 2 tbsp", "Allspice 1 tsp", "Screw pine essence in yellow color 1tbsp", "Oil Â¾ cup", "Salt 1- Â½ tsp"], "instructions": ["Boil rice with whole spices and 2 tbsp salt till ¾ done", "Heat oil, add ginger garlic paste, choti methi chopped with all the dry seasonings, chopperised tomatoes with ½ cup water, cover and cook till tomatoes tender, add all the chopped vegetables except brinjals and green chilies, add 1 cup water, cover and cook till vegetables done", "Lastly add brinjals, green chilies mixed spices, leave it on dum", "In a pan layer half the rice, put the vegetable mixture, top with chopped greens, left over boiled rice, top with kewra and yellow color, leave it on dum, mix and serve with burhani."]}, "Nizami Boti": {"ingredients": ["Undercut Â½ kg", "Ginger garlic 1 tsp heaped", "Salt 1 tsp heaped", "Grated cheddar cheese 2 tbsp", "Egg white 1", "Cream 4 tbsp", "White pepper Â½ tsp", "Black pepper Â½ tsp", "Tamarind pulp 1 tbsp", "Cardamom powder Â¼ tsp", "Almonds grinded 1 tbsp heaped", "saffron Pinch", "Green chilies finely minced 1 tsp", "Melted butter 2 tbsp"], "instructions": ["Marinate chicken with all the given ingredients for 2 hours, put on skewers and bbq brushing with melted butter, serve hot with salad and chatni."]}, "Nepali Daal Bhat": {"ingredients": ["Oil or clarified butter 3 tbsp", "Ground coriander 2 tsp", "Cumin 1 tsp", "Red chili powder 1tsp", "Turmeric 1/2 tsp", "Onion, chopped 1", "Green chili chopped 1", "Tomatoes, chopped 1 cup", "Orange lentils 1/2 cup", "Water 2 cups", "Salt to taste", "Coriander, chopped 1/2 bunch", "Ground coriander 1 tbsp", "Cumin 1 tsp", "Turmeric 1/2 tsp", "Oil as required", "Onion chopped 1", "Garlic ginger past 1tsp", "Chili powder 1tsp", "Tomatoes, chopped 2", "Potatoes, cubed 2", "Cauliflower chopped 1", "Water 1 cup", "Salt and pepper to taste", "Cilantro, chopped 1/2 bunch", "Lemon scut into wedges 2", "Rice as required", "Pickle as required", "Papad as required"], "instructions": ["<strongFor tarkari:</strong<br /Heat the oil in a pot over medium flame", "Add the coriander, cumin and turmeric and stir for about 30 seconds to lightly toast", "Then immediately stir in the onion, garlic and ginger", "Saute until the onion is well cooked, now Add the tomatoes and cook for a minute or two", "Next add in the potatoes and cauliflower and Stir in the water and season with salt and pepper, Bring to a boil, then reduce heat to medium low and simmer until the vegetables are cooked through and tender, about 10 to 15 minutes", "Adjust seasoning with salt and pepper and stir in the chopped cilantro", "Finally serve with rice, pickled and pappdi"]}, "Noor Mahal Pulao": {"ingredients": ["Chicken 1 kg 12 pieces", "Milk 1 cup", "Water 1 cup", "Onion 1 chopped", "Ginger 1 inch piece chopped", "Garlic crushed 1 tsp", "Coriander seeds 1 tsp", "Black cardamom 1 crushed", "Cloves 3", "Black pepper 6", "Green cardamom 3", "Cinnamon 2 sticks", "Salt 1 Â½ tsp", "Oil Â½ cup", "Brown onion Â½ cup", "Ginger garlic paste 1 tsp", "Almonds blanched and grinded 2 tbsp", "Cream Â½ cup", "Kewra water 1 tbsp", "Rice Â½ kg soaked for 30 minutes"], "instructions": ["Boil chicken with milk, water, chopped onion, whole spices, salt and ginger garlic chopped till chicken half done, strain the stock and remove the chicken and discard the rest."]}, "Nawabi Mewa Naan": {"ingredients": ["Flour 2 cups", "Semolina 2 tbsp", "Milk Â½ cup", "Clarified butter 4 tbsp", "Caster sugar 4 tbsp", "Salt 2 pinch", "Yeast 1 tbsp", "Baking powder 1 tsp", "Dried milk 4 tbsp", "Caster sugar 1 tbsp", "Desiccated coconut 2 tbsp", "Mix dry fruits (finely cut) Â½ cup", "Raisins 2 tbsp", "White sesame seeds 1 tbsp", "White sesame seeds for garnishing", "Butter for garnishing"], "instructions": ["<strongMethod:</strong<br /All dough ingredients mix and knead soft dough and leave for 2 hours for rise .now for filling all ingredients mix .after this make medium size balls and fill the filling .now bake in preheated oven for 10 minutes .finally garnish with butter and white sesame seeds and serve."]}, "Nargisi Biryani": {"ingredients": ["Boiled mutton 750 gm", "Salt 1 tsp heaped", "Black pepper 1 tsp heaped", "Oil Â¾ cup", "Boiled eggs 4", "Brown onion 1 cup", "Saffron Â½ tsp soaked", "Milk Â½ cup", "Kewra 1 tbsp", "Beaten yogurt 1 cup", "Ginger garlic 2tsp", "Whole spices mixed 1 tbsp", "Allspice 1 tsp", "Coconut milk powder 2 tbsp heaped", "Boiled rice Â½ kg"], "instructions": ["Heat oil, add whole spices, ginger garlic paste and boiled mutton for 5 mins, remove from heat, add yogurt, mix with coconut milk powder, salt, pepper, allspice, brown onion, stir well, spread boiled rice on top of it, pour 2 tbsp oil or ghee on top of rice, sprinkle with saffron, milk and kewra mixture, cover and cook for 5 mins on fast flame, lower flame and cook for another 10 mins."]}, "Nizami Roll": {"ingredients": ["Chicken (boneless strips) Â½ kg", "Ginger Garlic 1 tbsp heaved", "Chili Powder 1Â½ tsp", "Coriander Powder 1 tsp", "Cumin Powder 1 tsp", "All Spice 1 tsp", "Turmeric Â½ tsp", "Lemon Juice 1 tbsp", "Tandoori Color a pinch", "Salt 1 tsp", "Yogurt Â½ cup", "Oil Â¼ cup", "Coal For dum", "Ingredients for paratha:", "Flour 3 cups", "Oil Â¼ cup", "Yogurt 2 tbsp", "Milk (for dough) as required", "Baking Powder Â½ tsp", "Salt Â½ tsp", "Sugar 1 tbsp", "Ingredients for serving:", "French fries as required", "Onions 1 sliced", "Coriander (chopped) as required", "Green Chilies (chopped) as required", "Mint Leaves (chopped) as required", "Tamarind Chutney as required"], "instructions": ["Marinate chicken with all the ingredients for 30 mins."]}, "Nargisi Koftay": {"ingredients": ["Beef mince Â½ kg", "Egg 1", "Onions 2", "Green chilies 4", "Boiled eggs 4", "Ginger garlic paste 1 tsp", "Salt 1 tsp", "Coconut 1 tbsp", "Poppy seeds 1 tbsp", "Red chili powder 2 tsp", "Chickpeas (roasted) 4 tbsp", "Oil as required", "Onion (grinded) 250 gm", "Yogurt 250 gm", "Oil Â½ cup", "Red chili powder 1 tsp", "Coriander powder 1 tsp", "All spice powder 1 tsp", "Turmeric powder Â½ tsp", "Fenugreek seeds Â½ tsp", "Fresh coriander, green chili, ginger for garnish", "Salt to taste"], "instructions": ["<strongMethod:</strong<br /In a chopper, add beef mince, green chilies and onions", "Grind it well", "Then add egg, salt, red chili powder, coconut, ginger garlic paste, roasted chickpeas and poppy seeds", "Mix well", "Now coat with boiled eggs", "Then heat oil and fry on a medium heat", "Once it is golden brown remove and set aside", "Now heat oil and fry fenugreek seeds", "Then add grinded onion and fry well", "Now add red chili powder, coriander powder, salt and turmeric powder", "Also add whipped yogurt and cook properly until the water gets dry", "Then add 1 cup water and cook well for 10 minutes", "Now pour the gravy in the serving dish and place fried eggs on top", "Lastly garnish with fresh coriander, green chili and ginger", "Also sprinkle all spice powder and serve hot."]}, "No Yeast Chili Cheese Naan": {"ingredients": ["Flour 2 cup", "Baking powder Â¾ tsp", "Baking soda Â½ tsp", "Salt 1-1/4 tsp", "Oil 4 tbsp", "Yogurt Â¾ cup", "Chadder cheese Â½ cup", "Cottage cheese Â½ cup", "Crushed red chili 1 tsp", "Nigella Savita Â½ tsp", "Finely chopped green coriander 2 tbsp", "Chopped onion 4 tbsp", "Black sesame seeds for garnishing", "Green coriander for garnishing", "Butter for garnishing"], "instructions": ["<strongMethod:</strong<br /All dough ingredients mix and knead soft dough then leave for 1/2hour .after this all filling mix .now make balls .then roll out and fill the filling and again roll out .now sprinkling black sesame seeds and bake in preheat oven till then color .finally chili cheese naan garnish with butter and green coriander and serve ."]}, "New York Cold Surprise": {"ingredients": ["Vanilla ice cream 2 scoops", "Milk 1 cup", "Caramel sauce 2 tbsp", "Ice cubes 5- 6"], "instructions": ["<strongMETHOD:</strong<br /Blend all ingredients in blender."]}, "No Fry Dahi Baray": {"ingredients": ["Yellow lentils Â¾ cup", "White lentils Â¾ cup", "Dry mint 1 tsp", "Crushed black pepper Â¾ tsp", "Salt as required", "Oil 2 tbsp", "Fruit salt Â½ tsp", "Yogurt Â½ kg", "Salt as required", "Chaat masala as required", "Green chutney as required", "Roasted cumin as required", "Green coriander as required"], "instructions": ["<strongMethod:</strong<br /Yellow lentils and white lentils soaked in water for 3 to 4 hours and grind it fine .now dried mint ,salt ,oil ,crushed black pepper and fruit salt mix and blend .then in muffin try grace and pour the mixture and covered with the foil .now steam it and remove then dip in water .and remove for few minutes", "And press with the hand after this add yogurt, salt and blend well and pour on baray .finally add green chutney ,roasted cumin ,chaat masala and green coriander and serve ."]}, "Nepali Mixed Daal": {"ingredients": ["Brown chickpeas 1/4 cup", "Chickpeas 1/4 cup", "Kidney beans 1/4 cup", "Black eyed peas 1/4 cup", "Split green gram 1/4 cup", "Split chickpeas 1 tbsp", "Pigeon peas 1 tbsp", "Tomatoes, chopped 3", "Onion, chopped 1", "Tomato puree 2 tbsp", "Green chilies 1 tsp", "Garlic, minced 1 tbsp", "Ginger, minced 1 tbsp", "Ginger, sliced 1 inch", "Garlic, sliced 1 clove", "Dried red chilies 3", "Carom seeds 1/2 tsp", "Cumin seeds 1 tsp", "Turmeric powder 1/2 tsp", "Red chili powder or paprika 1 1/2 tsp", "Clarified butter or oil 3 tbsp", "Lemon juice 1 tbsp", "Salt to taste"], "instructions": ["<strongMethod:</strong<br /In a pressure cooker, add the soaked lentils, salt, 1/2 the turmeric, sliced ginger, sliced garlic, and 3 cups water", "Cook till done", "Heat clarified butter, add cumin seeds, carom seeds and dried red chilies and sauté for a minute", "Add the minced ginger, garlic, and green chilies and sauté", "Add chopped onions and sauté till translucent", "Add tomatoes, tomato puree, the remaining turmeric and 1/4 cup water", "Simmer until the tomatoes are tender", "Open the pressure cooker and give the lentils a mix", "Add this into the pan with the tomato mixture", "Simmer for 10 minute on low flame add lemon juice and garnish with coriander."]}, "Nutty Banana Fritters": {"ingredients": ["Almonds ground 1/3 cup", "cold water Â¼ cup", "ripe bananas, peeled, cut 4 large", "Oil as required", "Custard to serve"], "instructions": ["<strongMethod:</strong<br /Spread the ground almonds on a plate", "Use a pastry brush to brush bananas evenly with water", "Roll the bananas in the ground almonds to evenly coat", "Heat the oil", "Add the bananas and cook for 3-4 minutes each side or until golden brown", "Drain on paper towel", "Place bananas in serving bowls and serve with custard."]}, "Nocolato Hazelnut Tart": {"ingredients": ["Butter 94 grams", "Egg 1/2", "Salt 1 pinch", "Icing sugar 47 grams", "Flour 140 grams", "Vanilla essence few drops", "Nocolato Hazelnut spread as required"], "instructions": ["<strongMETHOD:</strong<br /In a mixing bowl add butter and icing sugar to mix well", "Then add egg, vanilla essence and salt add and mix", "after this mix flour", "Now grease the tart pan, spread the dough and bake in preheated oven at 150 degree for 14 to 15 minutes", "Then remove and cool it", "Finally fill with Nocolato Hazelnut spread on the top and serve."]}, "Nan-e Berenji": {"ingredients": ["1 tsp. baking powder", "1 tsp. ground cardamom", "¼ tsp. kosher salt", "2¾ cups (320 g) rice flour (preferably Bob’s Red Mill), plus more for dusting", "1 cup (2 sticks) unsalted butter, room temperature", "1 cup (110 g) powdered sugar", "1 large egg", "1 large egg yolk", "1 Tbsp. rose water", "Poppy seeds, black sesame seeds, finely ground pistachios, finely ground freeze-dried raspberries, and/or colored sanding sugar (for decorating)", "A 2\"-diameter cookie cutter; cookie stamp (optional)"], "instructions": ["Whisk baking powder, cardamom, salt, and 2¾ cups (320 g) rice flour in a medium bowl. Process butter and powdered sugar in a food processor until very smooth and creamy. Add egg, egg yolk, and rose water and pulse until smooth. Add about half of dry ingredients; pulse just to combine. Add remaining dry ingredients and pulse until a soft dough forms. It should be moist but firm. Pat into a disk about 1\" thick. Wrap in plastic and chill at least 4 hours and up to 1 day.", "Let dough sit at room temperature 20 minutes. Place racks in upper and lower thirds of oven; preheat to 300°.", "Roll out dough on a lightly floured piece of parchment paper to about ¼\" thick, dusting with more rice flour as needed to keep from sticking. If using stamp, dip in flour and press into dough, then punch out cookies with lightly floured cutter. Arrange on 2 parchment-lined baking sheets, spacing 1\" apart. Sprinkle with toppings as desired.", "Bake cookies, rotating baking sheets top to bottom and front to back halfway through, until set around the edges, 8–10 minutes. Let cool on baking sheets.\nDo ahead: Cookies can be baked 1 day ahead. Store airtight at room temperature."]}, "Nhoam Trey Mhasamout (Grilled Halibut Salad)": {"ingredients": ["1 12-oz. fillet halibut or haddock", "1 tsp. vegetable oil", "Kosher salt", "1 Tbsp. finely chopped lemongrass", "1 Tbsp. finely chopped ginger", "1 Tbsp. finely chopped galangal or ginger", "2 limes", "2 Tbsp. fish sauce", "2 Tbsp. vegetable oil", "1 Tbsp. shrimp paste", "½ tsp. Diamond Crystal or ¼ tsp. Morton kosher salt", "½ tsp. freshly ground black pepper", "1 pomelo or 3 small or 2 large white grapefruits, peeled, segments torn into 1\" pieces", "3 medium tomatoes (about 1 lb.), cut into wedges", "1 bunch scallions, thinly sliced on a diagonal", "1 small bunch cilantro, leaves with tender stems picked, torn", "1 small bunch mint, leaves picked, torn", "3 cups coarsely chopped purple or green cabbage (about 1\" pieces)", "2 medium shallots, thinly sliced", "1 red or green Thai chile, thinly sliced", "¼ cup crispy fried onions", "¼ cup puffed rice, preferably wild (optional)"], "instructions": ["Prepare a grill for medium-high heat. Rub halibut all over with oil, then season with salt. Grill, turning halfway through, until just cooked through, about 5 minutes total. Transfer to a plate.", "Pound lemongrass, ginger, and galangal in a mortar and pestle to a paste. (Alternatively, you can pulse in a food processor.) Transfer to a small bowl and finely grate zest from limes into paste. Halve limes and squeeze in juice; mix well. Add fish sauce, oil, shrimp paste, salt, and pepper and mix again to combine.", "Gently toss pomelo, tomatoes, scallions, cilantro, mint, and cabbage in a large bowl to combine. Flake grilled halibut into bowl and add any accumulated juices on plate. Pour dressing over salad and gently toss to coat.", "Divide salad among plates. Top with shallots, chile, crispy fried onions, and puffed rice (if desired)."]}, "Nasi Lemak": {"ingredients": ["3½ oz. dried paper lantern chiles, dried bird chiles, or dried chiles de árbol", "2 cups vegetable oil", "½ cup red-skin Spanish peanuts", "2½ cups small dried anchovies", "2 medium shallots, halved", "3 garlic cloves", "2 Holland chiles, stems removed, halved lengthwise", "4½ tsp. sugar", "1½ tsp. tamarind concentrate", "2 cups jasmine rice", "1 tsp. kosher salt", "3 pandan leaves (optional)", "½ cup light unsweetened coconut milk", "4 large eggs", "½ English hothouse cucumber, cut in half lengthwise, thinly sliced crosswise", "Soy sauce (for serving)", "Paper lantern chiles can be found at Asian markets and themalamarket.com. Tamarind concentrate, often labeled “concentrate cooking tamarind,” can be found at Asian and Thai markets."], "instructions": ["Chop paper lantern chiles into ½\" pieces, discarding most of the seeds that fall out. Place in a small bowl and pour in boiling water to cover. Let sit 30 minutes to soften, then drain.", "Meanwhile, bring oil and peanuts to a gentle simmer in a small saucepan over medium heat; cook, adjusting heat as needed, until peanuts are golden brown, 6–8 minutes. Using a slotted spoon, transfer nuts to paper towels to drain; set aside for serving. Immediately add anchovies to oil and cook until golden brown and crisp, about 2 minutes. Transfer to fresh paper towels; let cool. Set ¼ cup oil aside.", "Pulse shallots, garlic, and ¼ cup fried anchovies (save remaining anchovies for serving) in a food processor until a smooth paste forms. Transfer to a medium bowl. Add paper lantern and Holland chiles to food processor (no need to clean) and pulse until very smooth and no visible pieces of dried chile remain. Transfer chile purée to a small bowl.", "Heat reserved oil in a medium skillet over medium-high until shimmering. Add shallot mixture and cook, stirring, until slightly darkened in color and fragrant, about 2 minutes. Mix in chile purée and cook, stirring often, until it starts to stick to bottom of skillet, about 3 minutes. Reduce heat to low. Add sugar, tamarind concentrate, and ¼ cup water and cook, stirring often, until sambal is much darker in color and thickened, 25–35 minutes.", "Do Ahead: Sambal ikan bilis can be made 1 week ahead. Let cool; cover and chill.", "Place rice in a medium saucepan and pour in cold water to cover; swirl with your hands to rinse away some of the starch. Drain and repeat process 2 more times. Water should be just slightly cloudy at this point. Place rinsed rice back into saucepan and cover with 2½ cups cold water; stir in salt. Gather pandan leaves (if using) together and tie into a knot; add to pan. Bring rice to a simmer over medium-high heat. Cover pan and reduce heat to low; cook 18 minutes. Remove lid and stir in coconut milk. Cover, remove from heat, and let sit 5 minutes.", "Meanwhile, bring a small saucepan of water to a boil. Carefully lower eggs into water. Cook 10 minutes, then transfer to a bowl of ice water and let cool. Peel eggs and cut in half lengthwise.", "Combine sambal ikan bilis, reserved fried peanuts, and reserved fried anchovies in a medium bowl and toss to evenly coat. Scoop a generous ½ cup sambal mixture into a 12-oz. bowl. Top with 1½ cups rice and pack into bowl with a rubber spatula to compress. The bowl should be filled to the rim. Place a slightly larger bowl upside down over bowl of rice. Invert so larger bowl is now on the bottom; lift off smaller bowl. You should have a dome of rice and anchovy mixture nestled in the center of the larger bowl. Arrange 8 cucumber slices around rice dome, overlapping slightly to make a semicircle. Add 2 egg halves to side of rice with no cucumber slices; season yolks lightly with soy sauce. Repeat with remaining rice, sambal mixture, cucumbers, and eggs to make 3 more bowls."]}, "Noodle Kugel": {"ingredients": ["12 oz. extra-wide egg noodles", "2 tsp. kosher salt, plus more", "½ cup (1 stick) unsalted butter, plus more for pan", "8 large eggs", "½ cup sugar", "1 lb. full-fat cottage cheese", "1 lb. full-fat sour cream", "2 tsp. vanilla extract", "1 tsp. ground cinnamon"], "instructions": ["Preheat oven to 350°. Cook 12 oz. extra-wide egg noodles in a large pot of boiling salted water, stirring occasionally, until al dente, about 4–5 minutes. Drain, leaving a little bit of water clinging to the noodles.", "Generously butter a 13x9\" baking dish (we prefer glass for even heating, but metal is okay, too).", "Make the creamy sauce: Cut 1 stick butter into a few big pieces and transfer to a small heatproof bowl. Microwave until butter is melted, about 1 minute. Let cool slightly. Whisk 8 large eggs and ½ cup sugar in a large bowl until sugar is dissolved and eggs are frothy, 1–2 minutes. Add 1 lb. full-fat cottage cheese, 1 lb. full-fat sour cream, 2 tsp. vanilla extract, 1 tsp. ground cinnamon, and remaining 2 tsp. salt to egg mixture. Whisk vigorously to combine. Pour in melted butter and whisk again to combine.", "Add hot noodles to bowl and toss to coat with a spoon or spatula.", "Transfer noodle mixture to prepared baking dish, tipping dish to evenly distribute. For a really crispy top, pull a few noodles to the surface so that they’re poking out over the sauce.", "Bake kugel, rotating pan halfway through, until custard has souffléed, top is browned, and noodles on the surface are crispy, 50–55 minutes.", "Let cool at least 20 minutes before slicing. Fight over those almost-burnt noodles on top."]}, "Nut Butter Granola Bars": {"ingredients": ["2 cups raw nuts (such as almonds, walnuts, pistachios, pecans, and/or blanched hazelnuts)", "½ cup raw pumpkin seeds", "3 Tbsp. extra-virgin olive oil, plus more for pan", "2 cups old-fashioned oats, divided", "1¼ cups dried fruit (such as tart cherries, raisins, currants, dates, apricots, and/or blueberries)", "¾ cup natural peanut butter (unsalted or low-salt)", "½ cup plus 2 Tbsp. honey", "2 tsp. kosher salt", "2 tsp. vanilla extract", "1 large egg white"], "instructions": ["Preheat oven to 350°. Spread nuts and pumpkin seeds in a 13x9\" baking pan and roast until darkened in color and toasty smelling, 10–12 minutes. Transfer nuts and seeds to a food processor and let sit until cool enough to handle.", "Reduce oven temperature to 300°. Lightly oil 13x9\" pan and line with parchment paper, leaving overhang on both long sides. Lightly oil parchment.", "Add 1 cup oats to nut mixture in food processor and pulse until nuts are broken down to a sandy mixture and no whole oats remain. Transfer to a large bowl.", "Pulse any dried fruit larger than a raisin in food processor (no need to wipe out) until finely chopped, about the size of chocolate chips. Transfer to bowl with nut mixture. Add remaining 1 cup oats and stir to combine, breaking up any fruit that is stuck together. Add 3 Tbsp. oil and stir to coat. Add peanut butter, but don’t stir it in.", "Bring honey, salt, and vanilla to a boil in a medium saucepan (honey will bubble up) over medium heat. Reduce heat to medium-low and simmer, stirring occasionally, until honey is foaming vigorously and smells like caramel, about 3 minutes.", "Immediately pour honey syrup over peanut butter in reserved bowl (it will melt the peanut butter). Stir to combine, making sure to aggressively break up any clumps of nut butter.", "Stir egg white with a fork or whisk in a small bowl to liquefy. Add to oat mixture and stir until egg white is no longer visible.", "Transfer oat mixture to prepared pan and press firmly into an even layer. (Be sure to really compact the mixture into the pan—it helps to use the bottom of a heavy glass or metal measuring cup.)", "Bake granola bars until deep golden brown and no longer sticky or wet, 30-35 minutes. Let cool 5 minutes, then lightly score into 16 long rectangles (1 cut lengthwise and 8 cuts crosswise will make bars that are about 6½x1\"). Let cool completely in pan, then use parchment to hoist bars out onto a cutting board. Using a sharp chef’s knife, cut along marks to separate bars.", "Do Ahead: Bars can be made 1 week ahead. Store airtight at room temperature."]}, "No-Flip Blueberry Oven Pancake": {"ingredients": ["1 cup all-purpose flour", "⅓ cup cornmeal (not coarse, medium- or fine-grind works)", "2 large eggs", "¼ cup sugar", "1 Tbsp. baking powder", "½ tsp. baking soda", "2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt", "1½ cups buttermilk, divided", "4 Tbsp. unsalted butter, melted, divided, plus more room temperature for serving", "1 cup fresh blueberries", "1 Tbsp. vegetable oil", "Pure maple syrup (for serving)"], "instructions": ["Preheat oven to 375°. Whisk 1 cup all-purpose flour and ⅓ cup cornmeal in a small bowl.", "Whisk 2 large eggs, ¼ cup sugar, 1 Tbsp. baking powder, 2 tsp. Diamond Crystal or 1¼ tsp. Morton kosher salt, and ½ tsp. baking soda in a medium bowl until eggs are lightened and smooth, about 30 seconds.", "Add ¾ cup buttermilk and half of the dry ingredients and whisk very gently just to barely combine.", "Add 2 Tbsp. melted butter, remaining ¾ cup buttermilk, and remaining dry ingredients and whisk just to combine (some lumps are okay). Adding the dry ingredients in two batches, rather than all at once, lessens the risk of over-mixing (which would deflate and toughen the batter).", "Using a wooden spoon, fold in 1 cup fresh blueberries. We're using conventional blueberries—the kind you pick up at the grocery store—because they're so easy to find. But if you have access to those teeny-tiny, burst-in-your-mouth wild blueberries (what, are you in Maine or something?), by all means, use those.", "Heat 1 Tbsp. vegetable oil and 2 Tbsp. melted butter in a large oven-safe nonstick skillet (make sure it's at least 8 inches in diameter) over medium-high. We're using a combination of oil and butter because butter adds a lot of flavor but has a low smoke point (which means that it burns easily); mixing it with oil raises that smoke point so that we can have the best of both worlds.", "When foaming subsides, scrape in batter and use the back of a spoon to gently nudge it all the way to the edges.", "Reduce heat to medium and cook, shaking pan back and forth occasionally to ensure pancake will eventually slide out freely, until bubbles appear across surface of pancake, 5–6 minutes (it will still look quite wet and uncooked in the center, but you should see some browning around the outer edge).", "Transfer pan to oven and cook until pancake is puffed and set, 10–12 minutes. Invert pancake onto a large plate or platter. Admire the crispy, burnished top—its pock-marked surface contains all of your lacey-edged pancake fantasies.", "Cut into wedges and serve with room-temperature butter and maple syrup."]}, "Napa Cabbage and Cucumber Slaw": {"ingredients": ["6 cups thinly shaved or sliced cucumbers and/or Napa cabbage", "¼ red or white onion, very thinly sliced", "¼ cup seasoned rice vinegar", "2 Tbsp. extra-virgin olive oil"], "instructions": ["Combine vegetables and onion in a medium bowl; season generously with salt. Let sit until they start to release their water, 8–10 minutes, then begin to massage, gently at first so they don’t break, then harder as they begin to expel their liquid, until softened to about the texture of coleslaw. Pour off all excess liquid and add vinegar and oil; toss to coat. Taste and season with more salt if needed.", "Do Ahead: Slaw can be made 3 days ahead. Cover and chill."]}, "New-Standard Vinaigrette": {"ingredients": ["1½ cups extra-virgin olive oil", "¾ cup any combination red wine vinegar, white wine vinegar, and/or apple cider vinegar", "1 Tbsp. Dijon mustard", "1 Tbsp. honey", "Kosher salt"], "instructions": ["Combine oil, vinegars, mustard, and honey in a large resealable jar or airtight container; cover and shake vigorously until emulsified, about 30 seconds. Season with salt.", "Do Ahead: Vinaigrette can be made 1 month ahead. Cover and chill."]}, "Naked Apple Tart": {"ingredients": ["1 tsp. sugar", "½ tsp. kosher salt", "1 cup plus 2 Tbsp. all-purpose flour, plus more for dusting", "½ cup (1 stick) chilled unsalted butter, cut into 6 pieces", "All-purpose flour (for surface)", "4 Tbsp. chilled unsalted butter", "2 lb. firm sweet-tart apples, such as Pink Lady (3–4 medium/large apples)", "1 Tbsp. fresh lemon juice", "2 tsp. sugar", "Pinch of kosher salt", "Crème fraîche, sour cream, whipped cream, or vanilla ice cream (for serving; optional)", "A 9\"-diameter tart pan with removable bottom, with or without fluted edges"], "instructions": ["Toss sugar, salt, and 1 cup plus 2 Tbsp. flour in a large bowl with your fingers to combine. Add butter and toss to coat with dry ingredients.", "Turn out mixture onto a lightly floured surface. Using a rolling pin, flatten butter pieces into long, thin sheets. This may take a few passes to achieve; flour pin as needed and use a bench scraper or metal spatula to loosen any butter pieces that want to stick to the surface.", "Once all of the mixture is in flexible, thin pieces, use bench scraper to gather it up and return to bowl. Drizzle 3 Tbsp. ice water over. Using a fork, mix in water until evenly dispersed. The dough may break into smaller pieces as you do this, which is fine.", "Turn out dough back onto surface and loosely gather into a rectangular shape with a short end toward you. Roll out dough until it flattens. Because dough will be moist, more of it may stick to the pin this time. Scrape pin clean when this happens, and lightly dust pin, surface, and dough with flour as needed.", "Using bench scraper to help you, bring top third of dough up and over middle section, then bring bottom third up and over the middle as well (like folding a letter). The dough will be a floury, crumbly mess; you just want to achieve a loose stack at this point.", "Rotate dough 90° and repeat rolling out and folding, gathering loose bits into the center to incorporate. The dough should be a little more manageable now, but will still be very dry and crumbly on the long sides. Rotate dough 90° and repeat rolling out and folding a third time. The dough should be mostly together by now and will look smooth, matte, and creamy almost everywhere, though the edges may still be dry and crumbly. If needed, repeat one more roll-and-fold. Form dough into a disk, wrap in plastic, and chill at least 30 minutes.", "Do Ahead: Dough can be made 2 days ahead. Keep chilled, or freeze up to 3 months. Thaw overnight in the refrigerator before using.", "Preheat oven to 400°. Roll out dough on a lightly floured surface to a round about ⅛\" thick. Roll onto pin, brushing excess flour from underside if needed, then unfurl into tart pan. Working around the circumference, lift up dough, then press lightly into pan, working into corners and making sure dough is making good contact across bottom surface. Using your fingers, press dough against sides of pan, letting excess hang over. Roll pin across top of pan edges to shear extra dough cleanly off. (Dust dough scraps with sugar and bake into little misshapen cookies, if you want!) Chill crust until ready to use.", "Cook butter in a small saucepan over medium heat until butter foams, then browns, 3–5 minutes. Set brown butter aside.", "Core apples and slice crosswise into rings (do not peel them unless you absolutely insist).\n\nTransfer to a medium bowl. Add lemon juice, sugar, and salt and toss to coat. Arrange apples into chilled crust in rough concentric circles without making a big mound in the center (they should come up about ½\" over top of pan; snack on any extra pieces left in the bowl). Brush or drizzle brown butter over apples (use all of it). Place tart on a rimmed baking sheet and bake, rotating pan halfway through, until crust is deep golden brown and apples on surface are softened and starting to take on a little color at edges, 55–65 minutes. Do not underbake. Let tart cool on baking sheet until warm, then remove ring and cut into wedges.", "Serve each wedge with a spoonful of crème fraîche, if desired."]}, "Napa Cabbage Salad": {"ingredients": ["1 28-oz. Napa cabbage, tough outer leaves removed, halved, leaves torn into 3\"–4\" pieces", "1½ tsp. flaky sea salt, plus more", "½ cup coarsely chopped raw pistachios", "1 tsp. plus 2 Tbsp. extra-virgin olive oil; plus more for drizzling", "½ tsp. freshly ground black pepper, plus more", "1 sprig thyme", "½ tsp. finely grated orange zest", "½ tsp. sugar", "2 Tbsp. apple cider vinegar", "2 tsp. honey, preferably wildflower", "1 cup parsley leaves with tender stems", "1 Tbsp. thinly sliced chives", "3 oz. Parmesan, shaved, plus more for serving"], "instructions": ["Preheat oven to 350°. Place cabbage in a large bowl and sprinkle with 1½ tsp. salt. Toss, massaging with your hands, to soften a bit; set aside.", "Toss pistachios and 1 tsp. oil on a rimmed baking sheet; season with salt and pepper. Roast, tossing once, until golden brown, about 5 minutes. Transfer to a small bowl. Add thyme, orange zest, and sugar and toss to combine. Let cool; discard thyme sprigs.", "Whisk vinegar, honey, and ½ tsp. pepper in a small bowl to combine; season with a pinch of salt. Drizzle over cabbage and add parsley, chives, 3 oz. Parmesan, ¼ cup pistachios, and 2 Tbsp. oil. Toss to combine, then taste and season with more salt and pepper if needed.", "Transfer cabbage salad to a platter and top with more Parmesan and remaining pistachios. Season with pepper and drizzle with some more oil.", "Do Ahead: Cabbage can be massaged up to 3 hours in advance. Cover and keep chilled."]}, "Not Your Average French Dip": {"ingredients": ["2 pounds beef knuckle bones", "Kosher salt, freshly ground black pepper", "1 tablespoon kosher salt", "1 1/2 teaspoons sugar", "1 teaspoon ground black pepper", "1 teaspoon shichimi togarashi (found in Japanese grocery stores; substitute with 2 teaspoons orange zest, 3/4 teaspoon cayenne pepper, 1/2 teaspoon black sesame seeds)", "2 tablespoons olive oil", "1-3 pounds beef top round roast, tied and at room temperature", "6 Persian cucumbers, thinly sliced into rounds", "Kosher salt", "1 tablespoon yellow mustard seeds", "1 teaspoon red chili flakes", "1 teaspoon turmeric", "2 cups distilled white vinegar", "1 cup sugar", "6 tablespoons unsalted butter", "1 small onion, thinly sliced", "1 pound oyster mushrooms, trimmed", "Kosher salt", "Sliced roast beef, for serving", "Heinz® Mayonnaise, for serving", "8 buns, split", "2 cups frisée"], "instructions": ["For the jus : Preheat oven to 450°. Roast bones in oven until caramelized, turning occasionally, about 30 minutes. Transfer bones to a medium stock pot, cover with 8 cups water, and bring to a boil. Simmer bones on medium-low, uncovered, until the broth is reduced by three-quarters, about 2 1/2 hours. Season with salt and pepper", "For the roast beef : Preheat oven to 375°. Whisk together salt, sugar, black pepper, and togarashi in a small bowl. Rub beef with salt mixture and oil. Transfer beef roast in roasting pan and roast until an instant-read thermometer inserted into the thickest part registers 120°, 20 to 25 minutes. Transfer roast to a cutting board and let rest 15 minutes before removing kitchen twine and slicing.", "To slice the beef, use a very sharp slice knife or deli slicer, and cut very thin slices of roast beef. Divide sliced beef into 8 portions.", "For the pickles : Toss cucumbers and 2 teaspoons salt in a large bowl; let stand 30 minutes. Drain and squeeze well to remove as much excess moisture as possible. Transfer salted cucumbers into a large glass jar and add mustards seeds, turmeric, and chili flakes. Bring vinegar, sugar, and 1 cup water to a boil in a medium saucepan, stirring to dissolve sugar. Remove from heat and let cool. Carefully pour into jar, filling all the way to the top. Seal jar and chill at least 1 day.", "Sandwich Assembly : Melt 4 tablespoons butter in large skillet over medium. Add onions and cook, stirring occasionally, until onions are softened and browned in spots, 15 to 20 minutes. Add mushrooms and cook 5 to 7 minutes. Season with salt. Melt remaining butter in large skillet or on a griddle over medium. Toast buns, cut-side down, until golden brown, 2 to 3 minutes", "Spread Heinz® Mayonnaise on both sides of each bun, top with sliced roast beef, oyster mushrooms & onions, pickles and frisée."]}, "Niçoise Toast": {"ingredients": ["4 large eggs", "Juice from 1 lemon", "1 lb. tomatoes, cut into bite-size pieces", "1 medium shallot, thinly sliced", "A pinch of sugar", "Kosher salt", "½ cup mayonnaise", "1 small garlic clove, finely grated", "1½ tsp. sherry vinegar or red wine vinegar", "½ tsp. hot smoked Spanish paprika", "4 Tbsp. extra-virgin olive oil, plus more for drizzling", "4 slices sourdough bread", "2 6–7-oz. jars oil-packed tuna, drained", "Flaky sea salt", "Freshly ground black pepper", "½ cup torn mixed tender herbs (such as dill, parsley, basil, and/or tarragon)", "¼ cup oil-cured black olives, pitted, flesh torn"], "instructions": ["Bring a medium saucepan of water to a boil. Gently lower eggs into pot with a slotted spoon and cook 8 minutes. Transfer to a bowl of ice water and let cool. Peel eggs; set aside.", "Toss lemon juice, tomatoes, shallot, sugar, and a pinch of kosher salt in a medium bowl.", "Whisk mayonnaise, garlic, vinegar, and paprika in a small bowl; season with kosher salt.", "Heat 2 Tbsp. oil in a large skillet over medium until shimmering. Add 2 slices of bread and cook, adjusting heat as needed, until bottoms are deeply browned, about 3 minutes. Transfer to a platter and sprinkle fried side with kosher salt. Repeat with another 2 Tbsp. oil and remaining slices of bread.", "Spread mayonnaise mixture over toasted side of bread. Top with tuna and tomato mixture; spoon some of the juices over. Tear each egg into 3 or 4 pieces and arrange on top; season with sea salt and pepper. Scatter herbs and olives over; drizzle with oil.", "Do Ahead: Paprika mayonnaise can be made 2 days ahead. Cover and chill."]}, "Nori, Almond, and Chile Sprinkle": {"ingredients": ["½ cup almonds", "1 toasted nori sheet", "2 tablespoons black sesame seeds", "1 teaspoon urfa pepper or crushed red pepper flakes", "Kosher salt", "A spice mill or mortar and pestle"], "instructions": ["Preheat oven to 350°. Toast almonds on a rimmed baking sheet, tossing halfway through, until golden brown, 8–10 minutes. Let cool, then crush with a flat-bottomed cup or mug. Coarsely grind nori in spice mill or with mortar and pestle.", "Mix crushed almonds, ground nori, sesame seeds, and urfa pepper in a small bowl; season lightly with salt.", "Do Ahead: Dukkah can be made 5 days ahead. Store airtight at room temperature."]}, "No-Cook Peach Mousse": {"ingredients": ["¼ cup chilled bourbon", "1 packet unflavored powdered gelatin", "1 pound ripe peaches (about 4 medium), or 12 ounces frozen sliced peaches, thawed, plus 2 more peaches for garnish", "⅔ cup plus ¼ cup peach or apricot jam", "¼ cup mint leaves, plus sprigs for serving", "3 tablespoons fresh lemon juice, divided", "1½ cups cold heavy cream", "Pinch of kosher salt"], "instructions": ["Pour ¼ cup bourbon into a small saucepan and sprinkle 1 packet gelatin over. Let soak to soften gelatin, about 10 minutes.\n→  Wait, what is gelatin, anyways?", "Meanwhile, score skins of 1 lb. peaches with a sharp knife in a large “X” pattern on pointy (non-stem) end and place in a colander in sink. (If you’re using frozen peaches, skip this and proceed with step 5.)", "Heat a kettle (or saucepan) full of water until water boils, then pour over peaches to loosen skin. Rinse peaches in cold water.", "Slip blade of a paring knife underneath loosened cross-hatched peach skin and peel back to remove. If peels are stubbornly stuck, use a vegetable peeler. Cut peaches into wedges; discard pits.", "Blend peach flesh, ⅔ cup jam, ¼ cup mint leaves, and 2 Tbsp. lemon juice in a blender on highest speed until smooth. Leave blender jar on the base because you’re about to come back to it.", "Gently heat saucepan with gelatin mixture over low, swirling, just until granules dissolve and mixture is translucent. Don’t blast the heat because this can destroy the setting power of the gelatin and it might ignite the bourbon! Keep it low.", "Stream gelatin mixture into blender with the motor on low speed.", "Transfer peach mixture to a large bowl and chill in freezer, stirring with a spatula every 5 minutes, until mixture is thick enough that you can see the bottom of bowl as you stir (be sure to scrape against sides and bottom of bowl with spatula where mixture has become more solid), 15–20 minutes total. As it cools, gelatin will start to set and mixture will thicken.", "While peach mixture hangs out in freezer, whip 1½ cups cream and a pinch of salt in another large bowl with a whisk. You can do this in a mixer, but in a large bowl starting with cold cream, it should only take a few minutes by hand. Work in a vigorous figure-eight pattern, switching hands if needed, until cream firmly holds marks of whisk and gently slumps into a soft, cloud-like peak as it falls off whisk. Chill cream as you wait for peach mixture to thicken.\n→  Want to make perfect whipped cream every time? We got you.", "When peach mixture is ready, place it next to bowl of whipped cream on your work surface. Whisk about one-third of cream into peach mixture until incorporated.", "Scrape peachy cream back into bowl with plain cream. Using spatula, fold it all together until barely any streaks remain. At this point you want to work fairly quickly so cream doesn’t deflate and mousse stays nice and light.", "Spoon mixture into serving glasses, cover loosely with plastic wrap, and chill until gelatin is completely set, at least 4 hours.", "About 15 minutes before serving, slice 2 peaches into thin wedges and toss in a medium bowl with remaining ¼ cup jam and 1 Tbsp. lemon juice.", "Spoon peach wedges and their jammy juices over set mousse and garnish with mint sprig.", "Do Ahead: Mousse can be made 2 days ahead. Keep covered and chill."]}, "Nectarines and Peaches with Lavender Syrup": {"ingredients": ["½ cup pecans", "3 tablespoons honey", "2 tablespoons plus ¼ cup sugar", "1 sprig rosemary", "1 tablespoon dried lavender buds", "Kosher salt", "3 ripe white or yellow nectarines, cut into wedges", "3 ripe white or yellow peaches, cut into wedges", "2 teaspoons finely grated lemon zest", "½ cup crumbled Gorgonzola, divided", "Dried lavender can be found at farmers’ markets, many natural foods stores, and some supermarkets."], "instructions": ["Preheat oven to 350°. Toast pecans on a rimmed baking sheet, stirring once, until slightly darkened in color and fragrant, 10–12 minutes. Let cool.", "Meanwhile, bring honey, 2 Tbsp. sugar, and 3 Tbsp. water to a simmer in a small saucepan over medium-high heat, swirling occasionally until sugar is dissolved. Add rosemary and lavender and remove from heat. Let sit 5 minutes. Remove rosemary and let syrup cool.", "Bring a pinch of salt, remaining ¼ cup sugar, and 1 Tbsp. water to a boil in another small saucepan, stirring to dissolve sugar. Cook (without stirring) until sugar turns a light amber color, about 2 minutes. Add pecans and cook, stirring constantly, until nuts are coated and caramel is a dark amber color, about 2 minutes. Immediately scrape out onto a parchment-lined baking sheet and spread out into a single layer; let cool. Break into smaller pieces.", "Toss nectarines, peaches, lemon zest, and ¼ cup syrup in a large bowl to coat. Let sit 5 minutes. Gently toss in half of Gorgonzola and half of candied pecans; taste and season with salt if needed. Transfer to a platter. Top with remaining Gorgonzola and candied pecans.", "Do Ahead: Syrup can be made 1 month ahead; cover and chill. Pecans can be candied 1 day ahead; store airtight at room temperature."]}, "New Potatoes with Parmesan, Black Pepper, and Gribiche Dressing": {"ingredients": ["1 pound new or other small waxy potatoes, halved if large", "2 tablespoons olive oil", "Kosher salt, freshly ground pepper", "1 ounce finely grated Parmesan (about 1 cup), divided", "Gribiche Dressing (for serving)"], "instructions": ["Preheat oven to 425°. Drizzle potatoes with oil on a large rimmed baking sheet and toss to coat; season with salt and pepper. Roast, tossing once, until golden brown and tender, 20–25 minutes. Remove potatoes from oven and scatter half of Parmesan over top. Roast until cheese is melted, about 1 minute. Remove from oven and toss just to evenly coat potatoes.", "Transfer potatoes to a platter and top with remaining Parmesan; season with pepper. Spoon dressing over top."]}, "No-Nut Granola": {"ingredients": ["3 cups old-fashioned oats and/or kamut flakes", "2 cups mixed seeds, such as pumpkin seeds (pepitas), sunflower seeds, sesame seeds, flaxseeds, and/or hemp seeds", "½ cup cacao nibs", "½ cup coconut flakes", "½ cup olive oil", "½ cup pure maple syrup", "1 teaspoon (or more) kosher salt", "1½ cups mixed dried fruits, such as golden berries, mulberries, figs, dates, raisins, dried sour cherries, apricots, and/or dried mangoes"], "instructions": ["Preheat oven to 350°. Line a rimmed baking sheet with parchment paper or foil.", "Toss oats, seeds, cacao nibs, and coconut flakes in a large bowl. Add oil and syrup and stir until nicely coated. Season with 1 tsp. salt. Scrape onto prepared sheet, reserving bowl, and bake, stirring and rotating sheet from front to back every 10–15 minutes, until golden brown, 25–35 minutes.", "Meanwhile, cut dried fruit into small pieces (a pair of kitchen shears is great for sticky ingredients like dates and apricots). Transfer to same large bowl.", "Let granola cool 5 minutes, then carefully transfer to bowl with dried fruit, reserving baking sheet. Toss well to combine, then transfer back to sheet and let cool completely (granola will crisp as it cools). Taste and season with more salt, if desired.", "Do Ahead: Granola can be made 2 weeks ahead; store airtight at room temperature, or freeze up to 3 months."]}, "Navy Bean and Escarole Stew with Feta and Olives": {"ingredients": ["1 head of garlic, cloves separated, divided", "6 tablespoons olive oil, divided, plus more for serving", "1 medium onion, chopped", "1 small fennel bulb, chopped", "Kosher salt", "1 tablespoon finely grated lemon zest", "2 teaspoons finely chopped rosemary", "¾ teaspoon crushed red pepper flakes, plus more for serving", "2 bay leaves", "2 cups dried navy beans, soaked overnight, drained", "8 ounces feta, preferably in brine, brine reserved, cheese crumbled", "4 large sprigs basil, plus leaves for serving", "1 cup Castelvetrano olives, pitted, torn", "1 head of escarole, leaves torn into 2-inch pieces", "3 tablespoons fresh lemon juice", "4 1-inch-thick slices country-style bread"], "instructions": ["Slice 1 garlic clove in half crosswise and set aside; smash remaining garlic cloves with the flat side of a chef’s knife.", "Heat 4 Tbsp. oil in a large Dutch oven or other heavy pot over medium. Cook smashed garlic, stirring often, until golden, about 5 minutes. Add onion and fennel and season lightly with salt. Cook, stirring often, until onion is translucent and fennel and onion are browned around the edges, 8–10 minutes. Add lemon zest, rosemary, and ¾ tsp. red pepper flakes and cook, stirring often, until rosemary is very fragrant, about 3 minutes. Add bay leaves, beans, feta brine (if using; anywhere between ½–1 cup is fine), a couple generous pinches of salt, and 8 cups water and bring to a simmer. Partially cover pot, reduce heat to low, and gently simmer stew until beans are creamy and tender all the way through, 60–70 minutes.", "Add basil sprigs and olives to stew, then add escarole in batches, letting wilt slightly before adding more; simmer just until escarole is tender, about 3 minutes. (If stew is too thick, add more water to reach desired consistency.) Stir in lemon juice; taste and season with more salt if needed. Pluck out bay leaves; partially cover pot and keep stew warm over low while you make the toast.", "Heat broiler. Drizzle 2 Tbsp. oil total over both sides of bread and place on a rimmed baking sheet; season with salt. Broil until bread is golden and toasted, about 2 minutes per side. Let cool slightly, then rub with the cut sides of reserved garlic clove.", "To serve, slice toast in half and divide among shallow bowls; ladle stew over. Top with feta, basil leaves, and more red pepper flakes and drizzle with oil.", "Do Ahead: Stew can be made 3 days ahead. Let cool; cover and chill. Reheat covered over low."]}, "Neo-Neapolitan Bombe": {"ingredients": ["2 pints coconut ice cream (not dairy-free)", "2 pints pistachio ice cream", "2 pints strawberry ice cream", "¾ cup freeze-dried strawberries, finely chopped", "¾ cup raw pistachios, finely chopped"], "instructions": ["Line a large bowl with a curved bottom (at least 12-cup capacity; the stainless-steel bowl of a stand mixer is perfect) with plastic wrap, leaving generous overhang, and place in freezer. Peel away sides of containers from coconut ice cream. Cut ice cream into 2\" pieces and place in a medium bowl. Repeat with pistachio and strawberry ice creams, placing each in a separate medium bowl. Let sit until slightly softened, about 5 minutes, then stir each with a clean wooden spoon or large rubber spatula until the consistency of thick cake batter.", "Remove chilled bowl from freezer. Scoop about ½ cup of each ice cream into another medium bowl and fold a couple of times with a rubber spatula to swirl together (do not overmix; you want fat, marbled ribbons). Scrape into chilled bowl and press down to mold into bowl. Repeat process until you’ve used all of the ice cream (if it starts to melt, freeze until firm, about 5 minutes, before proceeding). Smooth top, then bring plastic up and over bombe, pressing against ice cream to compact. Freeze until hard, at least 12 hours.", "Combine freeze-dried strawberries and pistachios in a fine-mesh sieve and shake over a bowl to remove any dust or tiny particles; set aside larger pieces for topping. Remove bombe from freezer and remove plastic from over top of bowl of ice cream. Set a small plate or cake round over bowl opening and invert bowl onto plate. Lift off bowl and peel off plastic from bombe. Sprinkle reserved strawberry-pistachio mixture over bombe, covering all exposed ice cream and pressing to adhere.", "Cut bombe into wedges with a hot dry knife to serve (run knife under hot water and wipe dry between slices).", "Do Ahead: Bombe (without strawberry-pistachio coating) can be made 1 week ahead. Keep frozen."]}, "Nutty Chocolate Toffee Bark": {"ingredients": ["Nonstick vegetable oil spray", "½ cup (1 stick) unsalted butter", "¾ cup granulated sugar", "½ cup (packed) light brown sugar", "½ teaspoon kosher salt", "1 teaspoon vanilla extract", "¼ teaspoon baking soda", "4 ounces bittersweet chocolate, melted", "½ cup unsalted, roasted nuts (such as almonds, pecans, and/or pistachios), chopped", "¼ cup seeds (such as flax, sesame, and/or sunflower)", "½ teaspoon flaky sea salt", "A candy thermometer"], "instructions": ["Lightly coat a large rimmed baking sheet with nonstick spray. Combine butter, granulated and brown sugars, kosher salt, and 2 Tbsp. water in a large heavy saucepan fitted with candy thermometer. Cook over medium-high heat, swirling pan occasionally, until thermometer registers 300° (toffee should be a deep golden brown), 7–9 minutes.", "Remove toffee from heat and carefully stir in vanilla. Sprinkle baking soda evenly over surface and stir just until incorporated (be careful not to overmix). Quickly scrape mixture onto prepared baking sheet and tilt from side to side to spread mixture slightly; let cool 10 minutes.", "Drizzle chocolate over toffee and spread evenly with an offset spatula or large metal spoon. Scatter nuts and seeds over top, then sprinkle with sea salt. Let sit until chocolate is firm, at least 2 hours. Break into large shards.", "Do Ahead: Toffee can be made 3 days ahead. Store airtight at room temperature."]}, "No-Bake Chocolate Cream Pie with Toasted Meringue": {"ingredients": ["9 tablespoons unsalted butter", "6 ounces chocolate wafer cookies", "Kosher salt", "8 ounces bittersweet chocolate, melted, divided", "4 large egg yolks", "3 tablespoons cornstarch", "1½ cups heavy cream", "2 tablespoons unsweetened cocoa powder", "1½ cups whole milk", "¾ cup sweetened condensed milk", "4 large egg whites", "½ cup granulated sugar", "¾ cup powdered sugar, sifted", "A kitchen torch (optional)"], "instructions": ["Cook butter in a small saucepan over medium heat, stirring often, until butter foams, then browns (be careful not to let it burn), 5–8 minutes. Remove from heat.", "Meanwhile, process cookies in a food processor until finely ground. (Alternatively, place cookies in a large resealable bag and crush to fine crumbs with a rolling pin or heavy pot.) Transfer to a medium bowl.", "Add 5 Tbsp. brown butter and a pinch of salt to cookie crumbs and mix until well blended (mixture should resemble wet sand). Transfer to a 9\" pie dish and press evenly into bottom and up sides of dish with a measuring cup (make sure to come up all the way to the top lip of the pie dish). Chill 20 minutes.", "Brush the bottom of crust with 2 oz. melted chocolate; return to refrigerator.", "Whisk egg yolks and cornstarch in a medium bowl. Whisk cream and cocoa powder in a medium saucepan until no lumps remain; whisk in milk and sweetened condensed milk and bring to a bare simmer over medium heat. Whisking constantly, gradually add milk mixture to egg mixture, then, still whisking, pour egg mixture into pan. Cook over medium heat, still whisking, until mixture is considerably thickened with the occasional bubble rising to the surface (think chocolate pudding), about 4 minutes. Add remaining 6 oz. chocolate to custard and remaining 4 Tbsp. brown butter; whisk until smooth. Scrape into chilled crust and chill until custard is cold and set, at least 2 hours.", "Using an electric mixer on high, beat egg whites until loose and foamy, about 2 minutes. With motor running, gradually add granulated sugar and beat until stiff, shiny peaks form, about 5 minutes. Gradually add powdered sugar and beat another 2 minutes (meringue will deflate slightly when you add the powdered sugar but will regain volume).", "Spoon meringue over pie, swirling decoratively. Use a kitchen torch to toast meringue, if desired.", "Do Ahead: Pie with meringue can be made 1 day ahead. Chill."]}, "Negroni": {"ingredients": ["2 tablespoons gin", "2 tablespoons Campari", "2 tablespoons sweet vermouth", "1 orange twist", "Prosecco (optional)"], "instructions": ["Combine gin, Campari, and sweet vermouth in an ice-filled Old Fashioned glass; stir gently and garnish with an orange twist. More-formal types prefer it straight up in a Martini glass. My wife likes it topped with Prosecco for something a bit more celebratory."]}, "Nana's Brownies": {"ingredients": ["½ cup (1 stick) salted butter, plus more for pan", "1 cup all-purpose flour, plus more for pan", "1½ cups chopped walnuts (optional)", "2 tablespoons unsweetened cocoa powder", "1 teaspoon kosher salt", "¾ teaspoon baking powder", "3 ounces bittersweet chocolate (preferably 72% cacao)", "1½ cups sugar", "3 large eggs", "1 teaspoon vanilla extract", "3 ounces bittersweet chocolate (preferably 72% cacao)", "4 tablespoons (½ stick) salted butter", "1 tablespoon dark rum", "1 tablespoon unsweetened cocoa powder", "1 teaspoon vanilla extract", "¼ teaspoon kosher salt", "½ cup walnuts, coarsely chopped (optional)"], "instructions": ["Preheat oven to 350°. Butter and flour an 8x8\" baking dish, shaking out excess flour. Toast walnuts, if using, on a rimmed baking sheet, tossing occasionally, until golden brown, 8–10 minutes; let cool. Increase oven temperature to 375°.", "Whisk cocoa, salt, baking powder, and 1 cup flour in a medium bowl to combine and work out any lumps. Heat chocolate, sugar, and ½ cup butter in a large heatproof bowl set over a saucepan of simmering water (bowl should not touch water), stirring constantly, until smooth. Remove from heat and add eggs one at a time, beating vigorously with a wooden spoon to blend after each addition. Mix in vanilla, then add dry ingredients and mix until just combined. Fold in reserved walnuts (do not overmix).", "Scrape batter into prepared pan; smooth top. Bake until a tester inserted into the center comes out clean, 30–40 minutes. Let cool.", "Heat chocolate, butter, rum, cocoa powder, vanilla, and salt in a heatproof bowl set over a saucepan of simmering water (bowl should not touch water), stirring constantly, until smooth.", "Pour glaze over brownies and top with walnuts, if using. Chill until glaze is set, at least 1 hour. Slice into 12 brownies.", "Do Ahead: Brownies can be made 1 day ahead. Keep chilled."]}, "New-New Bloody Mary": {"ingredients": ["4 cups prepared tomato juice (preferably Sacramento)", "1 cup dill pickle juice (from a 32-ounce jar)", "¼ cup fresh lemon juice", "1 tablespoon prepared horseradish", "2 teaspoons hot sauce (such as Tabasco)", "2 teaspoons Worcestershire sauce", "1 teaspoon kosher salt", "1 teaspoon freshly ground black pepper", "½ teaspoon celery seeds", "⅛ teaspoon cayenne pepper", "2 cups vodka", "8 small celery heart stalks with leaves (for serving)", "8 lemon wedges (for serving)"], "instructions": ["Combine tomato juice, pickle juice, lemon juice, horseradish, hot sauce, Worcestershire sauce, salt, pepper, celery seeds, and cayenne in a large pitcher. Cover and chill at least 8 hours.", "Just before serving, stir vodka into tomato base and pour into tall ice-filled glasses. Garnish each with a celery stalk and a lemon wedge.", "Do Ahead: Tomato base can be made 4 days ahead; keep chilled."]}, "Nasturtium Butter": {"ingredients": ["3 tablespoons chopped nasturtium flowers (red, yellow, and/or orange)", "½ teaspoon kosher salt", "½ cup (1 stick) unsalted butter, room temperature", "Freshly ground black pepper"], "instructions": ["Mix nasturtium flowers and salt into butter in a small bowl. Season with pepper.", "Place on parchment or waxed paper and roll up into a log. Chill until firm, 1 hour.", "Do Ahead: Butter can be made 2 days ahead. Keep chilled."]}, "Norwegian Lefse": {"ingredients": ["2 large russet potatoes, scrubbed", "¼ cup heavy cream", "2 tablespoons unsalted butter, room temperature, cut into ½-inch pieces", "½ teaspoon kosher salt", "1¼ cups all-purpose flour, plus more"], "instructions": ["Place a rack in middle of oven; preheat to 400°. Prick potatoes all over with a fork and bake directly on the rack until yielding when pressed, about 1 hour. When cool enough to handle, scoop flesh into a large bowl; discard skins (or nibble on them with butter and salt—we won’t judge). Mash potato with a fork until only a few lumps remain. Let cool.", "Mix in cream, butter, salt, and 1¼ cups flour with a fork until a shaggy ball forms. Turn out on a lightly floured surface and knead, working in more flour a tablespoonful at a time, until dough is smooth, elastic, and soft, about 3 minutes. Cover loosely and let rest 10 minutes. Divide dough into 12 portions.", "Heat a dry griddle or large skillet, preferably cast iron, over medium heat. Working with 1 portion at a time and keeping others covered, roll out dough on a floured surface as thinly as possible to make an irregular 8”-diameter round (perfection is overrated). Cook until dough looks dry and is browned in spots, about 2 minutes per side. Transfer lefse to a wire rack; let cool.", "Do Ahead: Lefse can be made 2 days ahead. Store tightly wrapped at room temperature."]}, "Nori Salt": {"ingredients": ["2 toasted nori sheets, torn", "1 tablespoon kosher salt"], "instructions": ["Pulse nori in a spice mill to a powder. Mix with salt in a small prep bowl until well combined."]}, "Nana’s Butter Cookies with Milk-Jam Filling": {"ingredients": ["1½ cups (3 sticks) unsalted butter, room temperature", "⅔ cup powdered sugar", "2 teaspoons vanilla extract", "2 tablespoons whole milk", "2 teaspoons kosher salt", "2½ cups all-purpose flour, plus more", "1 large egg", "1 qt. goat’s milk or cow’s milk", "1¼ cups granulated sugar", "¾ teaspoon baking soda", "½ vanilla bean, halved lengthwise", "Powdered sugar (optional; for serving)"], "instructions": ["Using an electric mixer on high speed, beat butter, powdered sugar, and vanilla in a medium bowl until light and fluffy, about 4 minutes. Reduce speed to low; add milk, salt, and 2½ cups flour and mix just to combine. Form dough into a ½”-thick disk and wrap in plastic. Chill until firm, at least 1 hour.", "Preheat oven to 325°. Let dough sit at room temperature to soften slightly, about 5 minutes. Roll dough out between 2 sheets of parchment paper until about ⅛” thick. Cut out rounds with a floured 2½”-diameter cookie cutter. Cut out a circle in half of the rounds with a ¾”-diameter cookie cutter and transfer to 2 parchment-lined baking sheets, spacing 1” apart.", "Whisk egg and 1 tsp. water in a small bowl and brush tops of cookies with egg wash. Bake cookies, rotating halfway through, until golden brown, 12–15 minutes. Transfer baking sheets to wire racks and let cookies cool.", "DO AHEAD: Dough can be made 5 days ahead. Keep chilled.", "Combine milk, sugar, and baking soda in a large saucepan; scrape in vanilla seeds and add pod. Bring just to a boil over medium heat, stirring to dissolve sugar. Reduce heat and simmer, whisking occasionally, until mixture is reduced to about 1¼ cups (it will darken and separate, with little bits visible), 80–90 minutes. Strain milk jam through a fine-mesh sieve into a medium bowl and let cool.", "Spoon a small amount of milk jam onto flat side of a cookie without a hole and sandwich with a cookie with a hole. Repeat with remaining cookies and filling. Dust with powdered sugar, if desired.", "DO AHEAD: Milk jam can be made 1 week ahead. Cover and chill."]}, "Nashville-Style Hot Chicken": {"ingredients": ["2 3½–4-lb. chickens, each cut into 10 pieces (breasts halved)", "1 tablespoon freshly ground black pepper", "2 tablespoons plus 4 tsp. kosher salt", "4 large eggs", "2 cups buttermilk or whole milk", "2 tablespoons vinegar-based hot sauce (such as Tabasco or Texas Pete)", "4 cups all-purpose flour", "Vegetable oil (for frying; about 10 cups)", "6 tablespoons cayenne pepper", "2 tablespoons dark brown sugar", "1 teaspoon chili powder", "1 teaspoon garlic powder", "1 teaspoon paprika", "White bread and sliced pickles (for serving)", "A deep-fry thermometer"], "instructions": ["Toss chicken with black pepper and 2 Tbsp. salt in a large bowl. Cover and chill at least 3 hours.", "Whisk eggs, buttermilk, and hot sauce in a large bowl. Whisk flour and remaining 4 tsp. salt in another large bowl.", "Fit a Dutch oven with thermometer; pour in oil to measure 2”. Heat over medium-high heat until thermometer registers 325°. Pat chicken dry. Working with 1 piece at a time, dredge in flour mixture, shaking off excess, then dip in buttermilk mixture, letting excess drip back into bowl. Dredge again in flour mixture and place on a baking sheet.", "Working in 4 batches and returning oil to 325° between batches, fry chicken, turning occasionally, until skin is deep golden brown and crisp and an instant-read thermometer inserted into thickest part of pieces registers 160° for white meat and 165° for dark, 15–18 minutes. Transfer to a clean wire rack set inside a baking sheet. Let oil cool slightly.", "Whisk cayenne, brown sugar, chili powder, garlic powder, and paprika in a medium bowl; carefully whisk in 1 cup frying oil. Brush fried chicken with spicy oil. Serve with bread and pickles.", "DO AHEAD: Chicken can be seasoned 1 day ahead. Keep chilled."]}, "Nachos with All the Fixings": {"ingredients": ["Nonstick vegetable oil spray", "3 9-ounce bags tortilla chips", "Beer-Braised Carnitas (click recipe)", "2 15-ounce cans black beans, rinsed", "1 large white onion, chopped", "3 pounds shredded cheese (such as sharp cheddar and Monterey Jack)", "8 ounces Cotija cheese or feta, crumbled", "1 bunch radishes, thinly sliced", "1 bunch cilantro leaves", "Charred Tomatillo Salsa (click for recipe)", "Dried Chile Salsa (click for recipe)", "Pickled jalapeños (click for recipe)", "Pico de gallo", "Guacamole", "2 cups sour cream, thinned with 1/3 cup water", "Hot pepper sauce"], "instructions": ["Preheat oven to 350°. Coat 2 large rimmed baking sheets with nonstick spray. Arrange half of chips on prepared sheets and top with half of carnitas, beans, onion, and shredded cheese. Repeat layers with remaining chips, carnitas, beans, and shredded cheese. DO AHEAD: Nachos can be assembled up to 1 hour before baking.", "Working with 1 sheet at a time, bake until cheese is melted, 20-25 minutes. Sprinkle with Cotija cheese, radishes, and cilantro. Serve with desired toppings."]}, "Nuoc Cham": {"ingredients": ["1 (or more) Thai chile, with seeds, thinly sliced", "2 cloves garlic, finely chopped", "2 teaspoons grated peeled ginger", "2½ teaspoons sugar", "⅓ cup fresh lime juice", "¼ cup fish sauce (such as nam pla or nuoc nam)"], "instructions": ["Combine chile, garlic, ginger, sugar, lime juice, and fish sauce in a small bowl. Season with more chile and sugar, if desired, or add water by the tablespoon if needed to soften flavors."]}, "Noodle Salad with Chicken \u2028and Chile-Scallion Oil": {"ingredients": ["2 scallions, thinly sliced", "2 garlic cloves, thinly sliced", "2 star anise pods", "2 tablespoons crushed red pepper flakes", "1 tablespoon chopped fresh ginger", "1 teaspoon Sichuan peppercorns", "½ cup vegetable oil", "6 oz. Japanese wheat noodles (such as ramen, somen, or udon)", "2 tablespoons reduced-sodium soy sauce", "2 tablespoons unseasoned rice vinegar", "2 teaspoons sugar", "1 teaspoon toasted sesame oil", "2 cups shredded cooked chicken", "2 scallions, thinly sliced", "½ large English hothouse cucumber, halved lengthwise, thinly sliced", "4 radishes, trimmed, thinly sliced", "1 cup cilantro leaves or any sprout"], "instructions": ["Cook all ingredients in a small saucepan over medium heat, swirling pan occasionally, until scallions and garlic are just golden brown, about 3 minutes. Let cool; transfer oil to a jar.", "DO AHEAD: Chile oil can be made 4 days ahead. Cover and chill.", "Cook noodles in a large pot of boiling water according to package directions; drain. Rinse noodles under cold water, then shake off as much water as possible.", "Whisk soy sauce, vinegar, sugar, and oil in a medium bowl until sugar dissolves. Add noodles, chicken, and scallions; toss to coat.", "Toss with cucumber, radishes, and cilantro and drizzle with chile oil just before serving.", "DO AHEAD: Noodles can be cooked the night before. Toss with 1 tsp. oil; cover and chill. Store noodles with chicken; store vegetables and dressing separately."]}, "Nutty Crunch Cookies": {"ingredients": ["1 cup blanched hazelnuts", "½ cup unsalted, roasted almonds", "½ cup (packed) light brown sugar", "1 teaspoon kosher salt", "½ vanilla bean, split lengthwise, or 1 teaspoon pure vanilla extract", "1½ cups all-purpose flour", "1 cup (2 sticks) chilled unsalted butter, cut into pieces"], "instructions": ["Preheat oven to 350°. Toast hazelnuts on a rimmed baking sheet, tossing occasionally, until golden brown, 8–10 minutes. Let cool.", "Combine almonds, brown sugar, salt, and ½ cup hazelnuts in a food processor. Scrape in seeds from vanilla bean; reserve pod for another use. Pulse until finely ground, then pulse in flour just to combine. Add butter; process until dough just comes together.", "Roll dough into 1” balls and place on parchment-lined baking sheets, spacing 2” apart. Flatten cookies to a little less than ½” thick. Coarsely chop remaining ½ cup hazelnuts and press gently into cookies.", "Bake, rotating sheets halfway through, until cookies are golden brown, 15–18 minutes. Transfer baking sheets to wire racks and let cookies cool completely.", "DO AHEAD: Cookies can be baked 5 days ahead. Store airtight at room temperature."]}, "Norwegian Waffles": {"ingredients": ["1 1/2 cups all-purpose flour", "2 tablespoons sugar", "1/2 tsp kosher salt", "3 large eggs, separated, room temperature", "1 cup sour cream, room temperature", "1 tsp vanilla extract", "1/2 cup (1 stick) unsalted butter, melted, slightly cooled, plus more for waffle iron", "Brown cheese (Gjetost), crème fraîche, strawberry jam, and/or unsalted butter (for serving)"], "instructions": ["A Norwegian heart-shaped waffle iron", "Whisk flour, sugar, and salt in a medium bowl. Whisk egg yolks, sour cream, vanilla, 1/2 cup butter, and 1/3 cup water in another medium bowl; add to dry ingredients and whisk until smooth. With an electric mixer, beat egg whites to stiff peaks and gently fold into batter.", "Heat waffle iron until very hot and lightly brush with butter. Working in batches, cook waffles until golden brown and crisp. Stack waffles and serve with desired toppings."]}, "Nacho Vidal": {"ingredients": ["2 limes, halved", "¾ cup apple cider vinegar", "¾ cup sugar", "2 tablespoons honey", "1½ teaspoon crushed red pepper flakes", "2 cups tequila blanco", "1½ cups Campari", "¾ cup fresh lemon juice", "¾ cup fresh lime juice", "8 lime wedges (for serving)"], "instructions": ["Bring all ingredients to a boil in a medium saucepan. Reduce heat; simmer until slightly reduced, 8–10 minutes. Let cool, then strain into a jar. Cover and chill.", "Combine tequila, Campari, lemon juice, lime juice, and shrub in a large pitcher.", "Place 1½ cups tequila mixture in a cocktail shaker; fill with ice. Shake until frosty, about 30 seconds. Divide between 2 rocks glasses filled with ice; garnish each with a lime wedge. Repeat 3 more times.", "DO AHEAD: Tequila mixture can be made 6 hours ahead. Cover and chill."]}, "Nutty Grain and Oat Bars": {"ingredients": ["Nonstick vegetable oil spray", "6 large Medjool dates, pitted, chopped", "1 cup pure maple syrup", "2 tablespoons unsalted butter or virgin coconut oil", "2 cups old-fashioned oats", "½ cup raw almonds, hazelnuts, pecans, walnuts, or cashews", "½ cup shelled pumpkin seeds (pepitas)", "½ cup shelled sunflower seeds", "2 tablespoons amaranth", "½ teaspoon kosher salt"], "instructions": ["Sesame seeds (for amaranth)", "Preheat oven to 350°. Lightly coat an 8½x4” loaf pan with nonstick spray and line with parchment paper, leaving an overhang on long sides; spray parchment.", "Bring dates and maple syrup to a boil in a small saucepan, reduce heat to medium-high, and boil, stirring often, until dates are very soft and maple syrup is slightly reduced, 8–10 minutes. Remove date mixture from heat and stir in butter until it is melted. Mash dates with a potato masher or fork until as smooth as possible. (If you have an immersion blender, it will work, too.) You should have about 1 cup.", "Toss oats, almonds, pumpkin seeds, sunflower seeds, amaranth, and salt in a large bowl. Mix in date mixture until evenly coated. Scrape half of oat mixture into prepared pan and press very firmly and evenly with a rubber spatula to compress it as much as possible. Add remaining oat mixture and press until very tightly packed into pan.", "Bake, tenting with foil if browning too quickly, until loaf is darkened in color and firm around the edges, and center gives just slightly when pressed, 45–50 minutes. Transfer pan to a wire rack and let loaf cool in pan before turning out (it can even sit overnight). Cut into ½”-thick slices with a serrated knife.", "For crisp bars, lay slices on a baking sheet and bake at 350° until golden brown, 8–10 minutes, or toast as desired in a toaster oven.", "Loaf can be made 5 days ahead. Keep tightly wrapped at room temperature."]}, "New York Sour": {"ingredients": ["1 large egg white*", "4 ounces rye whiskey", "1½ ounces fresh lemon juice", "1 ounce simple syrup", "1 ounce full-bodied red wine"], "instructions": ["Shake egg white, whiskey, lemon juice, and simple syrup in a cocktail shaker until frothy, about 1 minute. Fill shaker with ice and shake until outside is frosty, about 30 seconds. Strain into 2 coupe glasses. Gently pour ½ oz. wine over the back of a spoon held just above each drink’s surface so wine floats on top.", "*Raw egg is not recommended for infants, the elderly, pregnant women, people with weakened immune systems…or people who don't like raw egg."]}, "No-Cook Mint Syrup": {"ingredients": ["2 cups (packed) fresh mint leaves", "3/4 cup sugar"], "instructions": ["Rub mint leaves and sugar in a medium bowl until mint sugar is the texture of wet sand. Transfer to a jar and add 1 cup cold water. Cover and shake until sugar is dissolved. Let sit at room temperature 1 hour. Strain into a clean jar. Cover and chill at least 1 hour and up to 2 weeks."]}, "No-Brainer Pancakes": {"ingredients": ["2½ cups Biscuit Mix (click for recipe)", "3 large eggs", "1¼ cups whole milk", "Unsalted butter (for cooking)"], "instructions": ["Place BA Biscuit Mix in a large bowl and set aside. Separate eggs, placing yolks in a medium bowl and whites in a large bowl. Add milk to the yolks; whisk to combine. Whisk egg whites until medium peaks form. Working quickly, stir milk mixture into dry ingredients until just combined. Fold in egg whites. Cook in batches in a buttered skillet or on a griddle."]}, "No-Boil Mac and Cheese": {"ingredients": ["1/2 cup (1 stick) unsalted butter, divided", "1/4 cup all-purpose flour", "3 cups whole milk", "1 tablespoon kosher salt plus more", "1/2 teaspoon freshly ground black pepper plus more", "1 pound elbow macaroni", "2 cups shredded cheddar, divided", "2 garlic cloves, chopped", "1 cup panko (Japanese breadcrumbs)", "2 tablespoons chopped flat-leaf parsley"], "instructions": ["Preheat oven to 400°. Melt 1/4 cup butter in a large saucepan over medium-high heat. Add flour; cook, whisking constantly, for 1 minute. Whisk in milk and 3 cups water. Bring to a boil, reduce heat to a simmer, and cook, whisking often, until a very thin, glossy sauce forms, about 10 minutes. Stir in 1 tablespoon salt and 1/2 teaspoon pepper. Remove sauce from heat.", "Toss pasta and 1 1/2 cups cheese in a 13x9x2-inch or other shallow 3-quart baking dish. Pour sauce over (pasta should be submerged; do not stir) and cover with foil. Bake until pasta is almost tender, about 20 minutes.", "Meanwhile, melt remaining 1/4 cup butter in a large skillet over medium heat. Add garlic, panko, and parsley and toss to combine. Season with salt and pepper.", "Remove foil from dish. Sprinkle with remaining 1/2 cup cheese, then panko mixture. Bake until pasta is tender, edges are bubbling, and top is golden brown, about 10 minutes longer. Let sit 10 minutes before serving."]}, "New England Clam Chowder": {"ingredients": ["8 pounds cherrystone clams, scrubbed", "1 tbsp unsalted butter", "8 ounces bacon, cut into 1/2-inch pieces", "2 celery stalks, minced", "1 large onion, minced", "1 garlic clove, minced", "2 1/2 pounds Yukon Gold potatoes, peeled, cut into 1/2-inch pieces", "1 tablespoon chopped fresh thyme", "1 bay leaf", "2 tablespoons cornstarch", "2 cups heavy cream", "Kosher salt, freshly ground pepper", "Chopped fresh chives", "Oyster crackers or Vermont Common Crackers"], "instructions": ["Bring clams and 4 cups water to a boil in a large pot over high heat. Cook until clams just open, 8-10 minutes (discard any that do not open). Using a large slotted spoon, transfer clams to a large rimmed baking sheet; set broth aside. Let clams cool slightly, then pull meat from shells; discard shells.", "Chop clams into bite-size pieces. Strain broth through a fine-mesh sieve set over a large bowl. Add water if needed to measure 6 cups. DO AHEAD: Clams and broth can be made 1 day ahead. Cover separately and chill.", "Melt butter in a large heavy pot over medium heat. Add bacon and cook, stirring occasionally, until fat is rendered and bacon begins to brown, about 8 minutes. Add celery, onion, and garlic and cook, stirring often, until onion is translucent, about 10 minutes. Add reserved broth (or 6 cups bottled clam juice), potatoes, thyme, and bay leaf. Bring chowder base to a simmer; cook until potatoes are tender, 20-25 minutes. Stir cornstarch and 2 tablespoons water in a small bowl to form a slurry. Stir slurry into chowder base; return to a boil to thicken. DO AHEAD: Base can be made 1 day ahead. Let cool; cover and chill. Keep clams chilled. Bring base to a simmer before continuing.", "Remove base from heat. Discard bay leaf. Stir in reserved clams (or two 10-ounce cans baby clams) and cream. Season with salt, if needed (clams' brininess varies), and pepper.", "Divide chowder among bowls. Garnish with chives and oyster crackers."]}, "Nectarine and Blue Cheese Salad with Plum Vinaigrette": {"ingredients": ["2 black plums, halved, pitted, chopped", "1/2 cup extra-virgin olive oil", "4 teaspoons ume plum vinegar or red wine vinegar", "Kosher salt, freshly ground pepper", "12 cups (lightly packed) mixed greens (such as arugula and frisée)", "4 nectarines or peaches, halved, pitted, cut into eighths", "8 ounces firm blue cheese, such as Cabrales, sliced", "1/2 cup almonds, preferably Marcona"], "instructions": ["Bring plums and 3/4 cup water to a boil in a small saucepan. Reduce heat to medium-high and simmer, stirring occasionally and mashing plums with the back of a spoon, until plums have completely broken down, about 15 minutes.", "Pour plum mixture through a fine-mesh sieve set over a small bowl, pressing on solids to extract as much purée as possible; discard solids in sieve. Let purée cool.", "Add oil, vinegar, and 2 Tbsp. water to purée; whisk to blend. Season dressing to taste with salt and pepper. DO AHEAD: Dressing can be made 1 week ahead. Cover and chill.", "Divide greens among plates. Scatter nectarines, cheese, and almonds over, dividing equally, and drizzle some of dressing over. Season with salt and pepper."]}, "Nicoise Toasts": {"ingredients": ["4 large hard-boiled eggs, peeled, coarsely chopped", "3/4 cup low-fat cottage cheese", "3 tablespoons olive oil, divided", "2 tablespoons chopped flat-leaf parsley plus 1 cup leaves", "2 tablespoons (or more) fresh lemon juice, divided", "1 tablespoon coarsely chopped capers", "1 scallion, thinly sliced", "Kosher salt, freshly ground pepper", "1 cup halved cherry tomatoes", "1/4 cup quartered pitted mixed olives", "4 ounces tuna packed in olive oil (preferably pole-caught), drained, broken into pieces", "4 1/2-inch-thick slices rustic bread", "1 garlic clove, halved"], "instructions": ["Combine eggs, cottage cheese, 1 Tbsp. oil, 2 Tbsp. chopped parsley, 1 Tbsp. lemon juice, capers, and scallion in a medium bowl. Using a potato masher or large fork, mash until a coarse paste forms. Season with salt and pepper.", "Toss 2 Tbsp. oil, 1 cup parsley leaves, 1 Tbsp. lemon juice, tomatoes, and olives in a medium bowl. Season with salt, pepper, and more lemon juice, if desired. Gently fold in tuna (don't overmix; keep it chunky).", "Toast bread; rub 1 side with cut end of garlic. Spread egg salad on top of each slice, dividing equally. Top with tuna mixture."]}, "Nutty Whole Wheat Pancakes": {"ingredients": ["1 cup whole wheat pastry flour or whole wheat flour", "1/2 cup flaxseed meal", "1/2 cup oat flour", "2 tablespoons raw sugar", "1 tablespoon baking powder", "1/4 teaspoon kosher salt", "2 cups buttermilk", "3 large eggs, beaten to blend", "1/4 cup (1/2 stick) unsalted butter, melted, cooled", "Nonstick vegetable oil spray", "Honey or agave syrup (nectar; optional)"], "instructions": ["Whisk first 6 ingredients in a large bowl. Whisk buttermilk, eggs, and butter in a medium bowl; add buttermilk mixture to dry ingredients and whisk just to combine (do not overmix; small clumps are okay).", "Heat a medium nonstick skillet over medium heat. Lightly coat bottom of skillet with nonstick spray. Working in batches, use a 1/4-cup measure to spoon batter into skillet. Cook until pancake bottoms are golden brown and bubbles begin to form and pop on top, about 3 minutes. Flip pancakes and cook until golden brown and just cooked through, 1–2 minutes longer. Divide among serving plates and serve with honey or agave, if desired."]}, "New Potatoes with Dill Butter": {"ingredients": ["1/4 cup (1/2 stick) unsalted butter, room temperature", "2 tablespoons (packed) coarsely chopped fresh dill plus more for garnish", "Kosher salt, freshly ground pepper", "2 pounds new potatoes or other small potatoes", "1 tablespoon crushed toasted caraway seeds (optional)"], "instructions": ["Mash butter and 2 Tbsp. dill in a small bowl. Season dill butter with salt and pepper. DO AHEAD: Can be made 1 week ahead. Cover and chill.", "Place potatoes in a large pot. Cover with cold water by 1 inch; season with salt. Bring to a boil; reduce heat to medium and simmer gently until tender, 10–12 minutes. Drain.", "Transfer hot potatoes to a medium bowl; add dill butter and 1 Tbsp. water. Toss, adding water by teaspoonfuls as needed, until butter lightly coats potatoes with a glossy sauce. Season with salt and pepper and transfer to a serving bowl. Garnish with more dill and caraway seeds, if desired."]}, "No-Knead Pizza Dough": {"ingredients": ["7 1/2 cups all-purpose flour (1000 grams) plus more for shaping dough", "4 teaspoons fine sea salt", "1/2 teaspoon active dry yeast"], "instructions": ["Whisk flour, salt, and yeast in a medium bowl. While stirring with a wooden spoon, gradually add 3 cups water; stir until well incorporated. Mix dough gently with your hands to bring it together and form into a rough ball. Transfer to a large clean bowl. Cover with plastic wrap and let dough rise at room temperature (about 72°) in a draft-free area until surface is covered with tiny bubbles and dough has more than doubled in size, about 18 hours (time will vary depending on the temperature in the room).", "Transfer dough to a floured work surface. Gently shape into a rough rectangle. Divide into 6 equal portions. Working with 1 portion at a time, gather 4 corners to center to create 4 folds. Turn seam side down and mold gently into a ball. Dust dough with flour; set aside on work surface or a floured baking sheet. Repeat with remaining portions.", "Let dough rest, covered with plastic wrap or a damp kitchen towel, until soft and pliable, about 1 hour.", "DO AHEAD: Can be made 3 days ahead. Wrap each dough ball separately in plastic wrap and chill. Unwrap and let rest at room temperature on a lightly floured work surface, covered with plastic wrap, for 2–3 hours before shaping.", "During the last hour of dough's resting, prepare oven: If using a pizza stone, arrange a rack in upper third of oven and place stone on rack; preheat oven to its hottest setting, 500°–550°, for 1 hour. If using a baking sheet, arrange a rack in middle of oven and preheat to its hottest setting, 500°–550°. (You do not need to preheat the baking sheet.)", "Working with 1 dough ball at a time, dust dough generously with flour and place on a floured work surface. Gently shape dough into a 10\"–12\" disk.", "When ready to bake, increase oven heat to broil. Sprinkle a pizza peel or rimless (or inverted rimmed) baking sheet lightly with flour. Place dough disk on prepared peel and top with desired toppings.", "Using small, quick back-and-forth movements, slide pizza from peel onto hot pizza stone. Broil pizza, rotating halfway, until bottom of crust is crisp and top is blistered, 5–7 minutes.", "Using peel, transfer to a work surface to slice. Repeat, allowing pizza stone to reheat under broiler for 5 minutes between pizzas.", "Arrange dough disk on baking sheet; top with desired toppings. Bake pizza until bottom of crust is crisp and top is blistered, about 10 minutes. Transfer to a work surface to slice. Repeat with remaining pizzas."]}, "Nonna Consuelos's Bolognese Sauce": {"ingredients": ["1 1/2 cups coarsely chopped sweet onion (about 1/2 large onion)", "1 cup coarsely chopped peeled carrots (3–4 small carrots)", "1 cup coarsely chopped celery (1–2 stalks)", "4 tablespoons olive oil, divided", "1 pound lean ground beef", "1 cup beef broth made from bouillon plus additional bouillon (optional)", "1 28-ounce can crushed tomatoes", "3 sprigs basil", "2 large garlic cloves", "1 teaspoon dried oregano", "Kosher salt and freshly ground black pepper", "Sugar"], "instructions": ["Pulse onion, carrots, and celery in a food processor until finely chopped; set aside.", "Heat 1 Tbsp. oil in a large deep skillet over medium-high heat. Add ground beef and cook, stirring often, until brown and cooked through, 4–5 minutes. Scrape into a medium bowl and set aside.", "Wipe skillet clean and add remaining 3 Tbsp. oil; heat over medium heat. Add reserved onion mixture and cook, stirring often and lowering heat if starting to brown, until softened, about 20 minutes. Add broth and 1 cup water. Stir in reserved meat, tomatoes, basil, garlic, and oregano. Let simmer, stirring occasionally, until flavors meld and sauce thickens 1–1 1/2 hours.", "Remove garlic; crush with the back of a spoon and stir back into sauce. Season sauce to taste with salt, pepper, sugar, and more bouillon, if desired."]}, "North Carolina-Style Pulled Pork with Vinegar Sauce": {"ingredients": ["2 tablespoons (packed) dark brown sugar", "4 teaspoons Hungarian sweet paprika", "1 tablespoon kosher salt", "1 teaspoon English mustard powder", "1 teaspoon freshly ground black pepper", "1 teaspoon onion powder", "3 pounds boneless pork shoulder, cut into 1-inch-thick slices", "2 tablespoons olive oil", "2 cups low-salt chicken broth", "1 cup beer (such as lager, Pilsner, or amber)", "1 1/2 cups apple cider vinegar", "3/4 cup ketchup", "1 tablespoon Worchestershire sauce", "4 teaspoons (packed) dark brown sugar", "2 teaspoons kosher salt", "1/2 teaspoon crushed red pepper flakes", "1/2 teaspoon Dijon mustard"], "instructions": ["Mix first 6 ingredients in a medium bowl. Add pork and toss to coat. Cover and refrigerate overnight.", "Press Warm; set timer for 30 minutes (add or subtract time as needed) and press Start to heat the pressure cooker. Heat oil in pot. Working in batches, add pork and cook until browned; transfer to plate. Add broth, beer, and browned pork, with any juices from the plate, to pot. Lock lid in place, making sure vent is sealed. Press Warm; set timer for 42 minutes and press Start to cook.", "Release pressure manually by opening vent. Remove lid. Transfer pork to a platter and let cool. Discard cooking liquid.", "Combine all ingredients in the cleaned pot. Press Warm; set timer for 15 minutes and press Start. Bring to a simmer; cook for 15 minutes. Meanwhile, shred pork with your fingers. Serve with vinegar sauce."]}, "Natchitoches Meat Pot Pie": {"ingredients": ["1 tablespoon vegetable oil", "1 pound ground beef", "1 pound ground pork", "2 small yellow onions, diced", "2 celery stalks, diced", "1 green bell pepper, seeded, diced", "1 red bell pepper, seeded, diced", "2 medium jalapeños, seeded, diced", "2 garlic cloves, finely grated on a Microplane", "3 bay leaves", "1 1/2 tablespoons Creole seasoning", "1 tablespoon all-purpose flour plus more for dusting", "1 teaspoon Worcestershire sauce", "6 plum tomatoes, diced", "1 cup beef broth", "3/4 cup thinly sliced scallions", "1/2 cup chopped flat-leaf parsley", "2 sheets store-bought refrigerated pie dough or 2 sheets frozen puff pastry (17.3-ounce package)", "1 large egg", "Kosher salt"], "instructions": ["Heat oven to 375°. Heat oil in a large wide pot over medium-high heat. Add beef and pork and stir, breaking up with the back of a spoon, until golden brown and liquid is evaporated, about 12 minutes. Mix in onions, celery, bell peppers, and jalapeños and cook, stirring often, until vegetables are tender, about 10 minutes. Add garlic, bay leaves, Creole seasoning, flour, and Worcestershire sauce; cook, stirring occasionally, for 2 minutes. Add tomatoes and broth; bring to a boil. Reduce heat and simmer, stirring constantly, for 5 minutes. Stir in scallions and parsley and let filling cool completely.", "Remove bay leaf from filling; discard. Divide filling equally among ramekins. Roll out dough on a lightly floured surface and cut out into six 8\" rounds. Whisk egg and 1 Tbsp. water in a small bowl. Brush egg wash around edges of each ramekin; place dough rounds on top. Trim each dough round so it extends only 1/2\" beyond surface of ramekin. Crimp dough over sides, pressing to adhere. Brush tops of dough with egg wash and cut 3 slits across the top with a pairing knife. Sprinkle kosher salt over. Place ramekins on a rimmed baking sheet and bake until crusts are golden brown and fillings are bubbling, 35–40 minutes."]}, "New-Look Bloody Mary": {"ingredients": ["4 cups tomato juice (preferably Campbell's)", "1 cup dill pickle juice", "1/4 cup fresh lemon juice", "1 tablespoon prepared horseradish", "2 teaspoons Worcestershire sauce", "2 teaspoons curry powder", "1 teaspoon Sriracha", "1 teaspoon kosher salt", "1/2 teaspoon celery seeds", "1/4 teaspoon black pepper", "2 cups vodka", "8 celery stalks", "8 lemon wedges"], "instructions": ["Combine first 10 ingredients in a large pitcher. Chill overnight.", "Add vodka to pitcher; stir well. Fill tall glasses with ice. Divide Bloody Mary cocktail among glasses. Garnish each with a celery stalk and a lemon wedge."]}, "Nori-Sesame Butter": {"ingredients": ["1/2 cup (1 stick) unsalted butter, room temperature", "2 teaspoons toasted white sesame seeds", "2 teaspoons toasted black sesame seeds", "1/2 sheet toasted nori, finely chopped", "Kosher salt"], "instructions": ["Put butter on a work surface and sprinkle sesame seeds and nori over butter. Season with salt. Using a knife, finely chop together until well combined. Transfer butter mixture to a sheet of parchment paper, wax paper, or plastic wrap, placing on edge closest to you. Fold paper over and roll into a cylinder, twisting the ends; wrap airtight in foil. Chill until solid. Butter will keep refrigerated for up to 2 weeks or frozen for up to 3 months."]}, "New York-Style Crumb Cake": {"ingredients": ["1 cup (packed) dark brown sugar", "½ cup sugar", "1½ tablespoons ground cinnamon", "½ teaspoon salt", "1 cup (2 sticks) unsalted butter, melted, warm", "2½ cups all purpose flour", "2½ cups all purpose flour", "1 teaspoon baking soda", "¾ teaspoon baking powder", "½ teaspoon salt", "¾ cup (1½ sticks) unsalted butter, room temperature", "1½ cups sugar", "2 large eggs", "1⅓ cups sour cream", "1 teaspoon vanilla extract"], "instructions": ["Mix both sugars, cinnamon, and salt in medium bowl and whisk to blend. Add warm melted butter and stir to blend. Add flour and toss with fork until moist clumps form (topping mixture will look slightly wet). Set aside.", "Position rack in center of oven and preheat to 350°F. Butter 13x9x2-inch glass baking dish. Sift flour, baking soda, baking powder, and salt into medium bowl. Using electric mixer, beat room-temperature butter in large bowl until smooth. Add sugar and beat until light and fluffy. Add eggs 1 at a time, beating until well blended after each addition. Add sour cream and vanilla extract and beat just until blended. Add flour mixture in 3 additions, beating just until incorporated after each addition. Transfer cake batter to prepared baking dish; spread batter evenly with rubber spatula or offset spatula. Squeeze small handfuls of topping together to form small clumps. Drop topping clumps evenly over cake batter, covering completely (topping will be thick).", "Bake cake until tester inserted into center comes out clean and topping is deep golden brown and slightly crisp, about 1 hour. Cool cake in dish on rack at least 30 minutes.", "DO AHEAD Can be made 1 day ahead. Cool completely. Cover and let stand at room temperature.", "Cut cake into squares and serve slightly warm or at room temperature."]}, "Negroni Chicken with Braised Blood Oranges": {"ingredients": ["4 quarts cold water", "3/4 cup coarse kosher salt", "1/4 cup sugar", "4 chicken breast halves with skin and bones (21/2 to 3 pounds total)", "6 whole cloves", "8 garlic cloves, smashed", "1/4 cup sweet (red) vermouth", "3 large fresh thyme sprigs, chopped", "1 teaspoon ground cinnamon", "1 teaspoon grated blood orange peel", "1/2 teaspoon dried crushed red pepper", "4 tablespoons extra-virgin olive oil, divided", "3 tablespoons unsalted butter, divided", "4 cups thinly sliced onions (about 2 large)", "6 juniper berries, ground in spice mill", "1 cup low-salt chicken broth", "1 teaspoon red wine vinegar", "1 teaspoon chopped fresh marjoram", "Braised Blood Oranges (click for recipe)", "Fresh marjoram sprigs (for garnish)"], "instructions": ["Stir 4 quarts water, 3/4 cup coarse salt, and sugar in large pot until salt and sugar dissolve. Add chicken in single layer. Chill 11/2 hours. Remove from brine; pat dry.", "Toast cloves in skillet over medium heat until beginning to smoke, about 4 minutes. Cool; grind finely. Transfer cloves to 13x9x2-inch glass baking dish. Whisk in next 6 ingredients, then 3 tablespoons oil. Add chicken. Cover and chill overnight, turning chicken occasionally.", "Preheat oven to 450°F. Sprinkle chicken with salt and pepper. Heat 1 tablespoon oil in large ovenproof skillet over medium-high heat. Add chicken, skin side down. Cook until skin is deep brown, 3 to 4 minutes. Using tongs, turn chicken, skin side up. Place skillet in oven. Roast chicken until cooked through, 20 to 25 minutes.", "Melt 2 tablespoons butter in heavy skillet over medium-low heat. Add onions and ground juniper. Sauté until onions are deep brown, about 45 minutes. Add broth. Boil until juices thicken, about 3 minutes. Mix in vinegar and chopped marjoram, then 1 tablespoon butter. Season sauce to taste with salt and pepper.", "Divide Braised Blood Oranges and chicken among plates. Spoon some sauce over. Garnish with marjoram sprigs."]}, "New York Strip Roast with Madeira Pan Sauce": {"ingredients": ["1 teaspoon coarse kosher salt", "1 teaspoon freshly ground black pepper", "1/2 teaspoon ground allspice", "1 3- to 4-pound New York strip roast, fat trimmed to 1/4 inch", "1 tablespoon canola oil", "2 medium shallots, minced", "2/3 cup high-quality Madeira", "2 cups low-salt chicken broth", "1/4 cup (1/2 stick) unsalted butter, cut into 1/2-inch cubes and frozen"], "instructions": ["Mix coarse salt, pepper, and allspice in bowl. Sprinkle spice mixture over roast. Let stand at room temperature 1 hour.", "Preheat oven to 375°F. Heat oil in large wide ovenproof skillet over medium-high heat until nearly smoking. Add roast, fat side down, to skillet; cook until well browned on bottom, 3 to 4 minutes. Turn roast, fat side up, and transfer skillet to oven. Roast until instant-read thermometer inserted into center of meat registers 130°F for medium-rare, about 50 minutes. Transfer to platter; let rest while preparing sauce.", "Pour off all but 2 tablespoons drippings from skillet and heat over medium-high heat. Add shallots to skillet and sauté until soft, about 3 minutes. Add Madeira; boil 1 minute. Add broth and boil until liquid is reduced by about 1/3, stirring occasionally, about 8 minutes. Add any accumulated juices from meat to skillet; boil 1 minute longer. Turn off heat; add frozen butter and swirl skillet until butter is blended into sauce. Season sauce with salt and pepper. Transfer sauce to small pitcher. Cut meat against grain into 1/3- to 1/2-inch slices and arrange on platter. Serve sauce alongside.", "A Napa Valley Cabernet Sauvignon. We like the blackberry and blueberry flavors and the subtle cocoa and spice of the 2005 Ladera ($39)."]}, "New York Strip and Fall Vegetable Roast with Mustard Cream Sauce": {"ingredients": ["1/2 cup crème fraîche or sour cream", "2 tablespoons Dijon mustard", "1 teaspoon fresh lemon juice", "Coarse kosher salt", "1 tablespoon unsalted butter, room temperature", "2 garlic cloves, pressed", "1 teaspoon finely chopped fresh rosemary", "3/4 teaspoon coarse kosher salt", "1/2 teaspoon freshly cracked black pepper", "1 3-pound boneless beef loin New York strip roast", "1 pound assorted mushrooms (such as button, crimini, and oyster), large mushrooms halved", "1 pound turnips (about 2 medium), peeled, cut into 2x1/2x1/2-inch strips", "12 ounces carrots (about 4 medium), peeled, quartered lengthwise, cut crosswise into 1 1/2- to 2-inch pieces", "1 12-ounce celery root (about 1 medium), peeled, cut into 2x1/2x1/2-inch strips", "5 large shallots (about 12 ounces total), peeled, cut crosswise into 1/4-inch-thick slices", "5 tablespoons extra-virgin olive oil", "1 1/2 tablespoons chopped fresh rosemary", "Coarse kosher salt"], "instructions": ["Rinse kale. Whisk crème fraîche, mustard, and lemon juice in small bowl. Season with coarse salt. DO AHEAD Can be made 1 day ahead. Cover and chill.", "Mix first 5 ingredients in small bowl. Place beef, fat side up, in 13x9x2-inch roasting pan. Spread butter mixture over top of roast. DO AHEAD Can be made 1 day ahead. Cover and chill.", "Let beef stand at room temperature 1 hour before roasting.", "Position 1 rack in bottom third and 1 rack in top third of oven; preheat to 450°F. Combine mushrooms, turnips, carrots, celery root, shallots, oil, and rosemary in large bowl. Sprinkle with coarse salt and pepper; toss to coat. Transfer vegetables to large rimmed baking sheet, spreading out in even layer.", "Place vegetables on lower rack in oven and beef on upper rack in oven. Roast 20 minutes. Toss vegetable mixture. Reduce oven temperature to 350°F. Continue roasting until vegetables are tender and beginning to brown and instant-read thermometer inserted into thickest part of meat registers 130°F for medium-rare, 30 to 35 minutes longer. Transfer roast to platter and let rest 10 minutes. Spoon fat from top of drippings in roasting pan. Drizzle drippings over vegetable mixture; toss to coat. Season to taste with salt and pepper.", "Spoon vegetable mixture around roast. Serve mustard cream sauce alongside."]}, "No-Bake Chocolate-Raspberry Cream Pie": {"ingredients": ["7 ounces chocolate wafer cookies (about 32), coarsely broken", "1/2 cup bittersweet chocolate chips", "6 tablespoons (3/4 stick) butter, cut into 1/2-inch cubes", "1/4 cup sugar", "1 14-ounce can sweetened condensed milk", "1/4 cup crème fraîche", "1/4 cup fresh lemon juice", "1 teaspoon finely grated lemon peel", "2 1/2 cups fresh raspberries (two 6-ounce containers)"], "instructions": ["Place broken cookies in processor. Using on/off turns, process until finely ground. Place chocolate chips, butter, and sugar in microwave-safe bowl. Microwave on high at 15-second intervals until melted, stirring occasionally. Add chocolate mixture to processor and blend until combined. Press crumb mixture onto bottom and up sides of 9-inch glass pie dish (do not pack firmly). Chill crust while preparing filling.", "Whisk condensed milk, crème fraîche, lemon juice, and lemon peel in large bowl to blend. Add half of raspberries. Stir, pressing gently on some raspberries, until raspberries begin to break apart and filling turns pink. Transfer filling to crust. Chill until filling is set, about 2 hours.", "Scatter remaining raspberries over pie. Cut into wedges and serve.", "The filling firms as it chills, creating nice clean slices of pie—but it doesn't contain any thickeners. The secret? Lemon juice. When it reacts with the other ingredients, it helps thicken the filling."]}, "Nectarine-Blackberry Crisp": {"ingredients": ["1 cup all purpose flour", "6 tablespoons (packed) golden brown sugar", "1 teaspoon finely grated lemon peel", "1/2 teaspoon salt", "1/2 cup (1 stick) unsalted butter, melted", "1 teaspoon vanilla extract", "2 large eggs", "1 cup crème fraîche or sour cream", "1 teaspoon vanilla extract", "1 tablespoon plus 1/2 cup all purpose flour", "3 cups blackberries (two 5.6- to 6-ounce packages)", "4 medium nectarines (about 18 ounces total), pitted, cut into 1 1/2-inch cubes", "1/4 cup sugar", "Vanilla ice cream"], "instructions": ["Whisk flour, golden brown sugar, lemon peel, and salt in medium bowl to blend. Add melted butter and vanilla; stir until evenly moistened but crumbly. DO AHEAD Can be made 4 hours ahead. Let stand at room temperature.", "Whisk eggs in large bowl to blend. Whisk in crème fraîche and vanilla. Add 1 tablespoon flour; whisk to blend. DO AHEAD Can be made 4 hours ahead. Cover and chill. Rewhisk before continuing.", "Preheat oven to 375°F. Butter 8x10-inch oval ceramic dish. Place berries and nectarines in large bowl. Sprinkle remaining 1/2 cup flour and sugar over; toss to coat. Transfer to prepared dish. Pour egg mixture evenly over fruit. Using fingers, crumble topping over fruit, distributing evenly.", "Bake crisp until custard is set and topping is golden brown, about 55 minutes. Let cool at least 10 minutes and up to 1 hour before serving.", "Scoop crisp into bowls. Serve with vanilla ice cream."]}, "Nutmeg-Scented Scones": {"ingredients": ["2 cups all purpose flour", "1/3 cup golden brown sugar", "2 teaspoons baking powder", "1 1/4 teaspoons freshly grated whole nutmeg or ground nutmeg", "1/2 teaspoon baking soda", "1/2 teaspoon salt", "6 tablespoons (3/4 stick) chilled unsalted butter, cut into 1/2-inch cubes", "1 cup sour cream", "1 egg white, beaten to blend with 2 teaspoons water (for glaze)", "2 teaspoons sugar"], "instructions": ["Preheat oven to 425°F. Combine flour, brown sugar, baking powder, 1 teaspoon nutmeg, baking soda, and salt in processor; blend 10 seconds. Using on/off turns, cut in butter until mixture resembles coarse meal. Add sour cream. Using on/off turns, blend until moist clumps form. Turn dough out onto floured work surface. Knead 4 turns to form ball. Roll out dough to 8-inch square (about 3/4 inch thick). Cut square into 8 wedges. Brush with egg-white glaze; sprinkle with 2 teaspoons sugar and 1/4 teaspoon nutmeg. Transfer to baking sheet, spacing 2 inches apart.", "Bake scones until tops are golden brown and tester inserted into center comes out clean, about 20 minutes. Transfer scones to rack and cool slightly. DO AHEAD Can be made 3 days ahead. Store scones airtight at room temperature. Rewarm in 350°F oven 10 minutes, if desired."]}, "New England Clam and Corn Chowder with Herbs": {"ingredients": ["6 thick bacon slices, cut crosswise into 1/2-inch pieces", "1 large onion, chopped", "2 large carrots, peeled, chopped", "1 1/4 teaspoons dried thyme", "3/4 teaspoon crushed dried rosemary", "3 tablespoons all purpose flour", "4 cups whole milk", "1 8-ounce unpeeled white-skinned potato, cut into 1/2-inch cubes", "3 6 1/2-ounce cans chopped clams in juice", "1 8 3/4-ounce can corn kernels, drained", "Chopped fresh parsley"], "instructions": ["Cook bacon in large saucepan over medium heat until crisp. Transfer bacon to paper towels to drain. Pour out all but 3 tablespoons drippings from pan. Add next 4 ingredients to pan; sprinkle with salt and pepper. Sauté until vegetables are crisp-tender, about 5 minutes. Sprinkle flour over; stir 1 to 2 minutes. Gradually add milk to pan, stirring constantly. Bring to boil; reduce heat to medium and cook until slightly thickened, stirring often, about 5 minutes. Add potatoes, clams with juice, and drained corn. Bring to boil; reduce heat to medium-low and simmer until potatoes are tender, stirring often, about 10 minutes. Season to taste with salt and pepper.", "Divide soup among bowls, sprinkle with bacon and parsley, and serve."]}, "New Mexico Chile-Glazed Chicken on Hominy Polenta": {"ingredients": ["3/4 cup (or more) organic chicken broth", "4 large dried New Mexico chiles*, stemmed, seeded, coarsely torn", "2 tablespoons balsamic vinegar", "2 tablespoons honey", "1/2 teaspoon ground cumin", "5 tablespoons butter, divided", "4 skinless boneless organic chicken breast halves", "2 15-ounce cans golden hominy", "3 tablespoons chopped fresh cilantro"], "instructions": ["Preheat oven to 350°F. Bring broth and chiles to boil in small saucepan. Cover; reduce heat and simmer 5 minutes. Transfer mixture to blender. Add vinegar, honey, and cumin. Blend until smooth, thinning with broth by tablespoonfuls as needed for thick sauce. Season sauce with salt and pepper. Transfer to bowl; rinse out and reserve blender.", "Melt 2 tablespoons butter in large ovenproof skillet over medium heat. Sprinkle chicken with salt and pepper. Add to skillet; sauté until brown, about 3 minutes per side. Transfer skillet to oven; roast chicken until cooked through, about 8 minutes.", "Meanwhile, blend hominy with juice until just coarsely chopped, about 5 seconds; drain well. Stir hominy and 3 tablespoons butter in medium saucepan over medium heat until heated through, about 2 minutes. Mix in half of cilantro. Season with salt and pepper.", "Spoon hominy onto plates. Top with chicken, then sauce and remaining cilantro.", "*Available at some supermarkets and at specialty foods stores and Latin markets."]}, "Northwood #2": {"ingredients": ["3 tablespoons gold rum", "2 tablespoons brandy", "1 1/2 tablespoons apple cider", "1 teaspoon pure maple syrup (preferably Grade B)", "3/4 teaspoon fresh lemon juice", "Ice cubes", "2 thin apple slices"], "instructions": ["Combine first 5 ingredients in cocktail shaker; fill with ice. Cover and shake vigorously until cold. Strain into 2 coupe glasses. Cut slit in each apple slice and attach to rim of each glass."]}, "North Carolina Peanut Pie": {"ingredients": ["1 1/2 cups unbleached all purpose flour", "1 teaspoon sugar", "1/2 teaspoon salt", "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes", "4 tablespoons (or more) ice water", "1/3 cup (packed) dark brown sugar", "2 tablespoons all purpose flour", "1/2 teaspoon", "1/4 teaspoon ground cinnamon", "1/4 teaspoon cayenne pepper", "3 large eggs", "1/2 cup golden syrup (such as Lyle's)", "1/2 cup sorghum syrup or 1/2 cup golden syrup (such as Lyle's) mixed with 1 teaspoon apple cider vinegar", "1/4 cup (1/2 stick) unsalted butter, melted, cooled slightly", "1 teaspoon vanilla extract", "1 1/2 cups coarsely chopped salted North Carolina peanuts or coarsely chopped salted cocktail peanuts", "Vanilla ice cream"], "instructions": ["Blend flour, sugar, and salt in processor. Using on/off turns, cut in butter until mixture resembles coarse meal. Add 4 tablespoons ice water and blend, using on/off turns, just until moist clumps form. Add more ice water by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap in plastic; chill at least 1 hour.", "Preheat oven to 375°F. Roll out dough on lightly floured surface to 12-inch round. Transfer to 9-inch-diameter glass pie dish. Fold edges under and crimp decoratively. Freeze crust 15 minutes.", "Line crust with foil; fill with dried beans or pie weights. Bake until crust is set, about 20 minutes. Remove foil and beans. Continue to bake until edges begin to color, piercing with fork if crust bubbles, about 13 minutes. Cool crust on rack while making filling. Maintain oven temperature.", "Whisk brown sugar, flour, 1/2 teaspoon coarse salt, cinnamon, and cayenne in medium bowl. Whisk eggs in another medium bowl to blend. Add golden syrup, sorghum, melted butter, and vanilla to eggs and whisk to blend. Add brown sugar mixture and whisk until smooth. Mix in peanuts. Pour filling into cooled crust.", "Bake pie 15 minutes. Reduce oven temperature to 350°F; continue to bake until crust is golden and filling is set (center of filling may move slightly when pie dish is gently shaken), covering crust edges with foil if browning too quickly, about 40 minutes. Cool pie on rack. DO AHEAD Can be made 1 day ahead. Cover loosely; store at room temperature.Cut pie into wedges and serve with vanilla ice cream.", "Salted North Carolina peanuts, sold as Golden Gourmet Peanuts, and sorghum syrup are available at southernthings.com. Look for Lyle's Golden Syrup in the supermarket aisle where maple syrup and other syrups are sold."]}, "Nectarine-Raspberry Crisp with Spiced-Oatmeal Crumb Topping": {"ingredients": ["3/4t cup all purpose flour", "3/4 cup quick-cooking oats", "1/4 cup sugar", "1/4 cup (packed) dark brown sugar", "1/4t teaspoon (generous) ground cinnamon", "1/4 teaspoon salt", "1/8 teaspoon (generous) ground cardamom", "6 tablespoons (3/4 stick) unsalted butter, melted, cooled slightly", "2 pounds nectarines, halved, pitted, cut into 3/4-inch-thick slices (about 5 cups)", "1 1/2-pint container fresh raspberries", "1/4 cup sugar", "2 tablespoons cornstarch", "Vanilla ice cream"], "instructions": ["Mix flour, oats, sugar, brown sugar, cinnamon, salt, and cardamom in medium bowl. Add melted butter and rub in with fingertips until mixture comes together in small clumps. DO AHEAD Can be made 1 day ahead. Cover and refrigerate.", "Position rack in center of oven and preheat to 375ºF. Butter 11x7x2-inch glass baking dish. Combine nectarines, raspberries, sugar, and cornstarch in large bowl; toss to blend. Transfer mixture to prepared baking dish. Sprinkle topping evenly over fruit. Bake until fruit mixture is bubbling thickly and topping is golden brown, about 50 minutes. Cool 20 minutes. Serve warm with vanilla ice cream."]}, "North Carolina Coleslaw": {"ingredients": ["3/4 cup coarsely grated onion (grated on large holes of box grater)", "3/4 cup vegetable oil", "1/4 cup ketchup", "3 tablespoons apple cider vinegar", "1 tablespoon sugar", "1 1/2 teaspoons celery seeds", "1 medium head of green cabbage, cored, thinly sliced (about 10 cups)", "2 cups coarsely grated peeled carrots (about 3 large)"], "instructions": ["Whisk first 6 ingredients in large bowl. Add cabbage and carrots; toss. Season with salt and pepper. Cover and chill at least 2 hours. DO AHEAD: Can be made 6 hours ahead. Keep chilled, tossing occasionally. Serve chilled."]}, "Negroni Punch": {"ingredients": ["4 cups assorted fresh fruit (such as berries, pitted cherries, and pitted sliced apricots and peaches)", "2 to 4 tablespoons sugar (optional)", "1 cup Campari", "1 cup sweet vermouth", "1 cup gin", "2 750-ml bottles chilled Prosecco", "ice cubes"], "instructions": ["Place fruit in large punch bowl. Sprinkle with sugar to taste, if desired; stir and let stand 10 minutes for sugar to dissolve and juices to form. Add all remaining ingredients except ice cubes. Divide punch among 8 tall ice-filled glasses and serve."]}, "New Orleans Shrimp, Okra, and Tomato Sauté": {"ingredients": ["1 1/4 pounds large uncooked shrimp, peeled, deveined", "3 teaspoons Cajun seasoning, divided", "6 slices smoked bacon, chopped", "3 tablespoons all purpose flour", "2 cups frozen cut okra (from 16-ounce package), thawed", "1 12-ounce container cherry tomatoes", "1 8-ounce bottle clam juice", "1/4 teaspoon ground allspice", "2 green onions, chopped"], "instructions": ["Toss shrimp and 1 1/2 teaspoons Cajun seasoning in medium bowl to coat. Cook bacon in large nonstick skillet over medium-high heat until crisp and brown. Using slotted spoon, transfer bacon to paper towel to drain. Add flour to drippings in skillet. Stir constantly until roux is very dark brown, about 5 minutes. Add okra and cherry tomatoes. Stir in remaining 1 1/2 teaspoons Cajun seasoning. Cook 1 minute. Add clam juice and allspice. Boil until sauce is thick, stirring often, about 3 minutes. Add shrimp. Sauté shrimp until just opaque in center, about 5 minutes. Season to taste with salt and pepper. Mix in chopped green onions and cooked bacon. Serve.", "Ingredient Tip: Cajun seasoning varies by brand, but it almost always contains salt, onion, garlic, chiles, black pepper, mustard, and celery. It may also include bay leaves, nutmeg, and paprika. You can find it in the spice section of most supermarkets."]}, "New Chicken Parmesan": {"ingredients": ["1/3 cup extra-virgin olive oil", "2 large garlic cloves, pressed", "1/2 teaspoon salt", "1 12-ounce container grape tomatoes", "1 1/2t teaspoons dried oregano", "Large pinch of dried crushed red pepper", "4 skinless boneless chicken breast halves (about 6 ounces each)", "1 1/4 cups finely grated Parmesan cheese, divided", "6t ounces fresh mozzarella cheese in water, drained, thinly sliced"], "instructions": ["Preheat oven to 500°F. Whisk first 3 ingredients in large bowl. Place tomatoes in medium bowl; mix in 2 tablespoons garlic oil, then oregano and crushed red pepper. Add chicken to large bowl with remaining garlic oil and turn to coat.", "Place 1 cup Parmesan in pie dish. Dip 1 side of each chicken piece into cheese to coat; arrange chicken, cheese side up, on 1 half of large rimmed baking sheet. Scatter tomatoes on other half of sheet.", "Roast chicken until just cooked through and firm to touch, about 10 minutes. Arrange mozzarella slices atop chicken. Return to oven; roast until cheese melts, 1 to 2 minutes. Transfer chicken and tomatoes to 4 plates. Sprinkle with remaining 1/4 cup Parmesan cheese."]}, "New York Steaks with Boursin and Merlot Sauce": {"ingredients": ["2 tablespoons olive oil, divided", "6 9-to-10-ounce New York steaks, trimmed (about 1 inch thick)", "1/2 of 5.2-ounce package Boursin or other French garlic-and-herb cheese, cut into 6 wedges", "1 1/2 cups Merlot or other fruity red wine", "1/4 cup (1/2 stick) chilled butter, cut into small pieces", "2 teaspoons chopped fresh Italian parsley", "2 teaspoons chopped fresh chives plus whole chives for garnish"], "instructions": ["Heat 1 tablespoon oil in each of 2 heavy large skillets over medium-high heat. Sprinkle steaks with salt and pepper. Add 3 steaks to each skillet; cook about 4 minutes per side for medium-rare. Transfer to platter; top each with 1 cheese wedge. Tent with foil to keep warm.", "Pour off drippings from 1 skillet; add wine to skillet and boil over high heat until reduced to generous 1/2 cup, scraping up browned bits, about 5 minutes. Remove from heat; add butter and stir until melted. Mix in parsley and chopped chives. Season with salt and pepper. Pour over steaks. Garnish with whole chives."]}, "Napa Valley Winter Punch": {"ingredients": ["1 1/2 3- to 4-inch-long cinnamon sticks", "2 whole nutmegs", "1 1/2 tablespoons whole allspice berries", "1/3 cup sugar", "2 cups Simple Syrup", "2 1/4 cups Charbay Rum or 10 Cane Rum", "1 1/4 cups fresh lemon juice", "1 1/4 cups fresh orange juice", "1 teaspoon Fee Brothers Peach Bitters or other bitters", "1 ice block", "Lemon and orange slices"], "instructions": ["Place cinnamon and nutmeg in resealable plastic bag; crack into pieces using mallet or rolling pin. Transfer to spice grinder. Add allspice; blend to coarse powder. Transfer 1 tablespoon to shallow dish; mix in 1/3 cup sugar. Set spiced sugar aside.", "Stir remaining spice powder in medium saucepan over medium-high heat until just beginning to smoke, about 2 minutes. Remove from heat. Cool 5 minutes. Repeat heating and cooling process 3 more times until spices are very fragrant but not burned. Add syrup; bring to boil. Reduce heat; simmer 5 minutes. Strain through sieve into bowl. Cool.", "Mix 3/4 cup spice syrup, rum, lemon juice, orange juice, and bitters in punch bowl. Add ice and citrus slices. Rub 1 orange slice around rim of 8 glasses to moisten; dip glasses into spiced sugar. Place glasses around punch bowl."]}, "Nectarine-Red Wine Sauce": {"ingredients": ["1 cup dry red wine", "1 cup sugar", "1/2 cup water", "1 3-inch cinnamon stick", "1 3x1/2-inch strip lemon peel", "1 3x1/2-inch strip orange peel", "3 1/2 cups 1/2-inch cubes nectarines with peel (from 4 to 5 medium)"], "instructions": ["Stir first 6 ingredients in medium saucepan over medium heat until sugar dissolves. Increase heat and boil syrup 1 minute. Reduce heat. Add nectarines. Simmer until nectarines are tender but still hold shape, about 10 minutes. Transfer sauce to bowl; cool. DO AHEAD Can be made 1 day ahead. Cover; chill."]}, "Nectarine and Almond Crisp": {"ingredients": ["3/4 cup plus 1 tablespoon all purpose flour", "1/2 cup (packed) golden brown sugar, divided", "1 1/4 teaspoons ground cardamom, divided", "1 teaspoon ground ginger, divided", "1/4 teaspoon salt", "2 ounces almond paste (about 1/3 cup), crumbled", "6 tablespoons (3/4 stick) chilled, unsalted butter, cut into 1/2-inch cubes", "1 1/2 cups sliced almonds", "", "2 1/2 to 2 3/4 pounds nectarines (about 8 cups), each cut into 8 wedges", "1/2 cup apricot preserves"], "instructions": ["Preheat oven to 400°F. Butter 11 x 7 x 2-inch glass baking dish. Blend 3/4 cup flour, 1/4 cup brown sugar, 3/4 teaspoon cardamom, 1/2 teaspoon ginger, and salt in processor. Add almond paste and process until fine crumbs form. Add butter and process using on/off turns until mixture begins to clump together. Transfer to bowl. Mix in almonds.", "Toss nectarine wedges, apricot preserves, remaining 1 tablespoon flour, 1/4 cup sugar, 1/2 teaspoon cardamom, and 1/2 teaspoon ginger in large bowl to coat. Transfer to prepared baking dish; sprinkle topping over. Bake until topping is golden, nectarines are tender, and juices are bubbling around edges, about 40 minutes. Cool at least 20 minutes before serving."]}, "Nacho Macaroni and Cheese ": {"ingredients": ["2 cups small elbow macaroni", "1/2 cup bottled thick and chunky salsa verde (medium heat)", "1 cup (packed) fresh cilantro leaves", "3 cups (packed) coarsely grated sharp cheddar cheese (12 ounces), divided", "4 teaspoons all purpose flour", "1 cup whole milk", "3/4 cup heavy whipping cream", "1/4 teaspoon (scant) ground cloves", "1 cup large corn chips"], "instructions": ["Preheat oven to 425°F. Cook macaroni in large saucepan of boiling salted water until tender but still firm to bite, stirring occasionally, about 6 minutes. Drain.", "Meanwhile, blend salsa and cilantro in processor. Toss 2 cups cheese and flour in medium bowl to coat.", "Bring milk, cream, and cloves to simmer in large saucepan over medium-high heat. Add cheese mixture. Whisk until sauce is smooth, about 1 minute. Mix in macaroni; season with pepper.", "Spread half of macaroni mixture in 11 x 7-inch baking dish. Drop half of salsa mixture over in dollops. Sprinkle with 1/2 cup cheese. Top with remaining macaroni mixture and salsa mixture. Sprinkle chips over. Top with 1/2 cup cheese. Bake until heated through, about 10 minutes."]}, "Nectarine, Blackberry, and Pecan Sundaes": {"ingredients": ["2 1/2-pint containers blackberries", "3 tablespoons (about) sugar", "", "3 cups 1/2-inch cubes pitted nectarines (from about 5)", "1/2 cup pecan pieces, toasted", "1 to 2 pints vanilla ice cream"], "instructions": ["Puree blackberries in processor. Transfer puree to sieve set over bowl and strain, pressing with rubber spatula to extract as much pulp and juice as possible. Sweeten sauce to taste. DO AHEAD Blackberry sauce can be made 1 day ahead. Cover and chill.", "Place nectarines in medium bowl. Sweeten to taste, tossing with sugar 1 tablespoon at a time. Let stand 15 minutes. Spoon some sauce into bottom of 6 sundae dishes. Top with 2 tablespoons nectarines, some pecans, 2 scoops ice cream, more blackberry sauce, and more nectarines. Sprinkle with remaining pecans."]}, "Nita's Crazy Cake": {"ingredients": ["1 1/2 cups all purpose flour", "1 cup sugar", "1/3 cup unsweetened cocoa powder", "1 teaspoon baking soda", "1/2 teaspoon salt", "1 cup cold water", "1/3 cup vegetable oil", "1 tablespoon distilled white vinegar", "1 teaspoon vanilla extract"], "instructions": ["Preheat oven to 350°F. Place first 5 ingredients in 8x8x2-inch nonstick metal pan. Using handle of wooden spoon, poke three holes in dry ingredients. Combine 1 cup cold water, oil, vinegar, and vanilla in large glass measuring cup. Pour liquid ingredients into holes in dry ingredients (there will be some overflow). Using fork, stir until batter is smooth. Bake until tester inserted into center comes out clean, about 30 minutes. Cool completely in pan on rack. DO AHEAD Can be made 1 day ahead. Cover and store at room temperature."]}, "Noodle Salad with Spicy Peanut Butter Dressing ": {"ingredients": ["6 tablespoons creamy peanut butter (do not use old-fashioned style or freshly ground)", "1/4 cup low-salt chicken broth", "3 tablespoons rice vinegar", "3 tablespoons soy sauce", "1 1/2 tablespoons sugar", "1 tablespoon oriental sesame oil", "1 tablespoon minced peeled fresh ginger", "1/2 teaspoon cayenne pepper", "", "8 ounces linguine", "1 large orange bell pepper, cut into matchstick-size strips", "1/2 cup chopped green onions", "5 large lettuce leaves", "1/4 cup chopped fresh cilantro", "1/4 cup chopped fresh cilantro"], "instructions": ["Combine first 8 ingredients in small bowl; whisk to blend. Set dressing aside.", "Cook pasta in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain pasta; rinse with cold water and drain again. Transfer pasta to medium bowl. Add bell pepper and green onions. Pour dressing over; toss to coat. Season salad with salt and pepper. Line serving bowl with lettuce leaves. Transfer salad to prepared bowl. Sprinkle with cilantro and peanuts."]}, "New England Fish Cakes with Herbed Tartar Sauce": {"ingredients": ["1/2 cup purchased tartar sauce", "2 tablespoons plus 1/2 cup finely chopped green onions", "2 teaspoons plus 1 1/2 tablespoons chopped fresh thyme", "1 teaspoon drained capers", "", "4 slices good-quality firm white bread, torn into pieces (1 1/2 cups)", "1 celery stalk with leaves, cut into 2-inch lengths", "1 1/4 pounds boneless cod, haddock, or other white fish fillets, cut into 2-inch chunks", "1 large egg", "3/4 teaspoon salt", "1/2 teaspoon ground black pepper", "", "3 tablespoons olive oil", "Lemon wedges"], "instructions": ["Stir together tartar sauce, 2 tablespoons green onions, 2 teaspoons thyme, and capers in small bowl.", "Place white bread in food processor; using on/off turns, process until very coarse crumbs form. Transfer breadcrumbs to large bowl. Using on/off turns, finely chop celery; add to bowl with breadcrumbs. Using on/off turns, coarsely puree fish; add to bowl. Add remaining 1/2 cup chopped green onions, 1 1/2 tablespoons chopped fresh thyme, egg, salt, and ground black pepper to bowl. Mix gently but thoroughly. Transfer fish mixture to work surface and shape into four 1/2-inch-thick cakes.", "Heat olive oil in heavy large skillet over medium heat. Add fish cakes and cook until brown on bottom, about 5 minutes. Using large spatula, carefully turn fish cakes over and cook until second sides are brown and centers are opaque, about 5 minutes longer. Divide fish cakes among 4 plates and garnish with tartar sauce and lemon wedges."]}, "Nectarine-Pecan Cookie Tarts": {"ingredients": ["1/3 cup coarsely chopped pecans", "1/4 cup sugar", "1 1/4 cups all purpose flour", "1/4 teaspoon salt", "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes", "1/4 cup coarsely chopped pecans", "2 tablespoons sugar", "2 tablespoons (1/4 stick) unsalted butter, room temperature", "1 large egg white", "4 firm but ripe unpeeled nectarines, halved, pitted", "", "1/3 cup apricot preserves", "1 tablespoon water"], "instructions": ["Finely chop pecans with sugar in processor. Add flour and salt; process 30 seconds to blend. Add butter; process just until clumps form. Gather dough together; flatten into rectangle. Wrap in plastic; chill 30 minutes.", "Line large rimmed baking sheet with parchment paper. Roll out dough on lightly floured work surface to generous 12x10-inch rectangle. Trim edges just to even sides. Cut dough into eight 5x3-inch rectangles. Transfer rectangles to prepared baking sheet, spacing 1 inch apart. Chill while preparing topping.", "Preheat oven to 375°F. Combine pecans, sugar, and butter in processor. Process until pecans are very finely chopped. Add egg white and process until well blended. Divide pecan topping equally among dough rect-angles; spread to within 1/4 inch of edges. Bake until pecan topping is set but cookies are still pale, about 10 minutes. Remove cookies from oven; maintain oven temperature.", "Thinly slice nectarine halves, keeping slices from each half together. Arrange 1 nectarine half atop each cookie, fanning slices decoratively. Return to oven and bake until cookies are light golden around edges, about 10 minutes. Transfer baking sheet with tarts to rack.", "Bring apricot preserves and 1 tablespoon water to simmer in heavy small saucepan. Strain glaze through sieve set over bowl. Brush glaze over nectarine slices. Cool tarts completely on baking sheet. DO AHEAD Tarts can be made 6 hours ahead. Let stand at room temperature. Rewarm any remaining glaze and brush over tarts before serving, if desired."]}, "New England Crab Rolls": {"ingredients": ["6 tablespoons mayonnaise", "1 tablespoon fresh lemon juice", "1 teaspoon grated lemon peel", "1/8 tablespoon cayenne pepper", "3/4 pound fresh crabmeat, picked over", "3 tablespoons finely chopped green onions", "", "2 tablespoons (1/4 stick) butter, room temperature", "4 hot dog buns, sides split open", "4 red leaf or Bibb lettuce leaves"], "instructions": ["Whisk together mayonnaise, lemon juice, lemon peel, and cayenne pepper in medium bowl. Mix in crabmeat and chopped green onions. Season crab salad to taste with salt and pepper.", "Spread butter on insides of hot dog buns. Warm large skillet over medium heat 1 minute. Place buns, buttered side down, in preheated skillet and toast until golden, about 5 minutes. Place 2 toasted buns on each of 2 plates. Place 1 lettuce leaf inside each bun. Divide crab salad among buns and serve."]}, "Napa Valley Cabernet Burgers": {"ingredients": ["1 750-ml bottle Cabernet Sauvignon", "1/4 cup minced shallots", "9 tablespoons unsalted butter, room temperature", "2 teaspoons golden brown sugar", "1 tablespoon minced fresh rosemary", "1 1/2 pounds ground beef (15% fat)", "1 teaspoon salt", "1/2 teaspoon ground black pepper", "Vegetable oil", "1 cup (packed) coarsely grated extra-sharp white cheddar cheese", "4 4 1/2-inch squares focaccia, cut horizontally in half", "8 large tomato slices", "2 cups arugula"], "instructions": ["Boil wine and shallots in medium saucepan until reduced to 3/4 cup, about 20 minutes. Add 1 tablespoon butter and brown sugar; whisk until butter melts and sugar dissolves. Remove from heat. Mix remaining 8 tablespoons butter and rosemary in small bowl. Set aside.", "Prepare barbecue (medium-high heat). Mix beef, salt, pepper, and 1/4 cup wine-shallot mixture in bowl. Form meat into four 5-inch squares or rounds. Brush grill rack with oil. Grill burgers until brown on bottom, about 3 minutes. Turn burgers and brush with wine-shallot mixture. Continue grilling burgers until cooked to desired doneness, turning and brushing occasionally with wine-shallot mixture, about 4 minutes longer for medium-rare. Sprinkle with cheese after last turn and grill until cheese melts.", "Spread cut sides of bread with rosemary butter. Grill, cut side down, until golden, about 2 minutes. Arrange bread, grilled side up, on plates. Top bottom halves with burgers, then tomatoes and arugula. Cover with top halves of bread."]}, "No-Bake Blueberry Cheesecake with Graham Cracker Crust": {"ingredients": ["9 whole graham crackers", "1/2 cup old-fashioned oats", "3 tablespoons (packed) golden brown sugar", "1/8 teaspoon salt", "5 tablespoons unsalted butter, melted", "1 teaspoon vanilla extract", "1/4 cup water", "1 tablespoon unflavored gelatin (measured from 2 envelopes)", "12 ounces Philadelphia-brand cream cheese, room temperature", "1 cup heavy whipping cream", "1 cup sugar", "1 tablespoon fresh lemon juice", "3 cups fresh blueberries", "1 cup chilled heavy whipping cream", "1 tablespoon sugar", "4 1/2-pint baskets blueberries", "2/3 cup blueberry jam"], "instructions": ["Preheat oven to 350°F. Blend first 4 ingredients in processor until graham crackers are finely ground. Add butter and vanilla; process until moist crumbs form. Press crumb mixture onto bottom and 1 inch up sides of 9-inch-diameter springform pan. Bake crust until deep golden brown, about 12 minutes. Cool.", "Pour 1/4 cup water into small saucepan; sprinkle gelatin over. Let stand 10 minutes. Stir over very low heat just until gelatin dissolves. Set aside.", "Blend cream cheese, cream, sugar, and lemon juice in processor until smooth. Add berries; puree until smooth (some blueberry bits will remain). With machine running, add warm gelatin mixture through feed tube and blend well. Pour filling into crust. Cover; chill overnight. DO AHEAD Can be made 2 days ahead. Keep chilled.", "Run knife around pan sides to loosen cake. Release pan sides. Transfer to platter.", "Beat cream and sugar in medium bowl until firm peaks form. Spread cream mixture thickly over top of cheesecake. Place berries in bowl. Heat jam in small saucepan over low heat until just melted. Pour jam over berries; toss to coat. Mound coated berries in center of cream, leaving 1-inch plain border. Chill cake at least 1 hour and up to 1 day."]}, "New-Wave Rocky Road": {"ingredients": ["26 ounces bittersweet (not unsweetened) or semisweet chocolate, coarsely chopped", "2 teaspoons grated orange peel", "3/4 cup walnut halves", "3/4 cup chopped dried tart cherries or dried cranberries", "3 tablespoons finely chopped crystallized ginger", "22 large marshmallows", "", "40 paper of foil candy cups"], "instructions": ["Line 11x7-inch baking pan with foil, extending over sides. Place chocolate in medium bowl. Set over saucepan of simmering water (do not allow bottom of bowl to touch water). Stir until melted and candy thermometer registers 115°F. Remove bowl from over water. Mix in orange peel, then next 3 ingredients. Fold in marshmallows. Pour into prepared pan, spreading evenly. Chill until chocolate is just firm enough to cut, about 1 hour.", "Using foil as aid, lift candy from pan. Fold down foil sides. Cut candy crosswise into 8 strips. Cut lengthwise into 5 strips, forming total of 40 squares. Transfer rocky road squares to paper or foil candy cups. DO AHEAD Can be made 2 weeks ahead. Cover and refrigerate. Let stand at room temperature at least 30 minutes and up to 1 hour before serving."]}, "New England Molasses Gingerbread Cookies": {"ingredients": ["6 cups (about) all purpose flour", "1 tablespoon ground cinnamon", "2 teaspoons ground ginger", "1 1/2 teaspoons ground cloves", "3/4 teaspoon salt", "11 tablespoons (1 stick plus 3 tablespoons) unsalted butter, room temperature", "2/3 cup solid vegetable shortening", "1 cup sugar", "1 cup mild-flavored (light) molasses", "1 1/2 teaspoons grated lemon peel", "1 large egg", "1/4 cup buttermilk", "2 teaspoons water", "1 teaspoon baking soda", "3 cups powdered sugar", "1 1/2 tablespoons fresh lemon juice", "1 1/2 teaspoons light corn syrup", "Water", "Food coloring (optional)", "", "Decorations (such as colored sugar crystals)"], "instructions": ["Combine 5 1/4 cups flour, cinnamon, ginger, cloves, and salt in medium bowl; whisk to blend well. Using electric mixer, beat butter and shortening in large bowl to blend. Add 1 cup sugar, molasses, and lemon peel and beat until smooth. Beat in egg and buttermilk. Stir 2 teaspoons water and baking soda in small cup to blend; beat into butter mixture. Beat in flour mixture in 2 additions. Stir in more flour, 1/4 cup at a time, until slightly firm dough forms. Divide dough into 3 equal parts. Shape each into disk. Wrap disks and chill until firm enough to roll, at least 2 hours. DO AHEAD: Can be made 2 days ahead. Keep refrigerated. Soften slightly before rolling out.", "Working with 1 disk at a time, roll out dough between sheets of waxed paper to 16x12-inch rectangle, occasionally lifting paper to smooth out wrinkles. Using 4- to 5-inch cutters, cut out boy and girl gingerbread people. Pull away excess dough around cutouts; flatten, wrap, and chill excess dough. Slide rimless baking sheet or inverted baking sheet under waxed paper with cutouts and chill until firm. Repeat with remaining dough disks, refrigerating cutouts on waxed paper on baking sheets. Roll out excess dough and make more cookies, using all of dough. DO AHEAD: Cutout cookies can be made 1 day ahead. Cover; keep chilled.", "Position rack in center of oven and preheat to 350°F. Using thin metal spatula, lift chilled cookies off waxed paper and transfer to baking sheet, spacing 1 inch apart. Bake until darker at edges and just firm to touch in center, about 12 minutes. Cool on sheet 5 minutes. Transfer to rack; cool completely. Bake remaining cookies, 1 sheet at a time.", "Sift powdered sugar into medium bowl. Mix in lemon juice and corn syrup. Mix in enough water by teaspoonfuls to form smooth icing soft enough to pipe but firm enough to hold shape. Divide into 3 or 4 portions and tint with food coloring, if desired.", "Spoon icing into pastry bag (or bags if using more than 1 color) fitted with small (1/16- to 1/8-inch) plain tip. Arrange cookies on work surface. Pipe icing onto cookies in desired patterns. Apply decorations as desired. Let cookies stand until icing is dry. DO AHEAD: Can be made 3 days ahead. Store cookies airtight between sheets of waxed paper at room temperature."]}, "Nectarine and Mascarpone Tart in Gingersnap Crust ": {"ingredients": ["25 gingersnap cookies, coarsely broken (about 6 ounces; about 2 1/4 cups pieces)", "1/4 cup (1/2 stick) unsalted butter, melted", "1 8-ounce container mascarpone cheese", "6 ounces cream cheese, room temperature", "1/4 cup sour cream", "1/4 cup sugar", "1 tablespoon grated lemon peel", "1/4 teaspoon vanilla extract", "1 tablespoon finely chopped crystallized ginger", "4 to 5 small nectarines, halved, pitted, cut into thin slices", "1/4 cup peach jam, warmed", "2 tablespoons finely chopped crystallized ginger"], "instructions": ["Preheat oven to 350°F. Finely grind gingersnaps in processor. Add butter and blend until crumbs are evenly moistened. Press mixture over bottom and up sides of 9-inch-diameter tart pan with removable bottom. Bake crust until color darkens, pressing sides with back of spoon if beginning to slide, about 8 minutes. Cool completely.", "Beat first 6 ingredients in medium bowl until smooth. Beat in crystallized ginger. Spread filling in prepared crust. Cover loosely and refrigerate at least 2 hours and up to 1 day.", "Overlap nectarine slices atop filling in concentric circles. Brush with jam. Sprinkle with chopped crystallized ginger. Serve, or refrigerate up to 6 hours."]}, "Nougat Ice Cream": {"ingredients": ["1/2 cup honey", "1/4 cup sugar", "1/4 cup water", "", "1 large egg white", "Pinch of salt", "", "1 cup chilled whipping cream", "1/2 cup slivered almonds, lightly toasted, chopped", "1/4 cup shelled unsalted pistachios, chopped"], "instructions": ["Stir 1/2 cup honey, 1/4 cup sugar, and 1/4 cup water in heavy medium saucepan over medium heat until sugar dissolves. Increase heat and boil, without stirring, 1 minute.", "Meanwhile, using electric mixer, beat egg white with pinch of salt in medium bowl until soft peaks form. Gradually pour hot syrup over egg white mixture, beating constantly. Continue beating meringue until very stiff, about 4 minutes. Let stand until cool, about 10 minutes.", "Beat cream in large bowl until soft peaks form. Fold into honey meringue. Fold in chopped nuts. Spoon mixture into 11x7x2-inch glass baking dish. Cover and freeze until firm, about 4 hours. DO AHEAD: Can be prepared 1 week ahead. Keep frozen. Spoon ice cream into bowls and serve."]}, "New England Sausage Stuffing with Maple Corn Bread": {"ingredients": ["1 pound breakfast-style bulk sausage", "1/2 cup (1 stick) unsalted butter", "1 3/4 pounds Granny Smith apples, peeled, cored, chopped", "1 pound onions, chopped", "4 large celery stalks, chopped", "1 cup chopped celery leaves", "9 cups coarsely crumbled day-old Maple Corn Bread (click for recipe)", "4 large eggs", "2/3 cup frozen apple juice concentrate, thawed", "1/3 cup canned low-salt chicken broth", "1 teaspoon salt", "1 teaspoon ground black pepper", "1 teaspoon crumbled dried sage leaves", "1/4 teaspoon ground allspice", "1/4 teaspoon ground nutmeg"], "instructions": ["Sauté sausage in heavy large skillet over medium-high heat until cooked through, breaking up finely with back of fork, about 10 minutes. Using slotted spoon, transfer sausage to very large bowl. Melt butter in same skillet over medium-high heat. Add apples, onions, and celery stalks; sauté until very tender, about 12 minutes. Add celery leaves and stir 30 seconds to wilt. Add mixture to bowl with sausage. Stir corn bread into sausage mixture. Whisk eggs and all remaining ingredients in medium bowl to blend. Mix into stuffing.", "Loosely fill neck and main cavities of turkey with stuffing. Generously butter baking dish. Spoon remaining stuffing into prepared dish. Cover with buttered foil, buttered side down. Bake stuffing in dish along side turkey until heated through, about 25 minutes. Uncover stuffing. Bake until top of stuffing is slightly crisp and golden, about 15 minutes longer.", "Preheat oven to 350°F. Generously butter 15x10x2-inch glass baking dish, depending on recipe. Transfer stuffing to prepared dish. Cover with buttered foil, buttered side down. Bake until heated through, about 40 minutes. Uncover and bake until top is slightly crisp and golden, about 20 minutes longer."]}, "No-Bake Lemon Cream Tart": {"ingredients": ["10 tablespoons (1 1/4 sticks) unsalted butter", "1/4 cup (packed) golden brown sugar", "7 whole graham crackers, finely crushed", "1/2 cup whole milk", "1 teaspoon unflavored gelatin", "1 cup plus 1 tablespoon sugar", "1/2 cup fresh lemon juice", "2 teaspoons grated lemon peel", "2 large eggs", "1 1/4 cups chilled whipping cream"], "instructions": ["Melt 6 tablespoons butter in medium skillet over medium-high heat. Whisk in brown sugar. Whisk until mixture bubbles thickly, about 2 minutes. Mix in cracker crumbs; stir 1 minute. Using back of fork, press warm crumb mixture over bottom and up sides of 9-inch-diameter tart pan with removable bottom. Cool crust completely.", "Pour milk into small custard cup. Sprinkle gelatin over. Let stand until gelatin softens, about 15 minutes. Whisk 1 cup sugar, lemon juice, and lemon peel in heavy medium saucepan to blend well. Whisk in eggs, then remaining 4 tablespoons butter. Whisk over medium heat until custard thickens and just begins to boil, about 5 minutes; remove from heat. Add gelatin mixture; whisk until gelatin dissolves. Let stand until beginning to set, about 10 minutes. Pour warm filling into crust. Chill until filling is firm, at least 3 hours and up to 1 day.", "Beat cream and remaining 1 tablespoon sugar in medium bowl until peaks form. Pipe or spoon cream over tart. Serve immediately or chill up to 4 hours."]}, "New Potatoes with Three-Cheese Fondue": {"ingredients": ["2 teaspoons olive oil", "1/2 cup chopped onion", "1 cup plus 2 tablespoons whipping cream", "1 8-ounce package cream cheese, room temperature", "1 cup freshly grated Parmesan cheese (about 2 ounces)", "1/2 cup (packed) grated Gruyère cheese (about 1 1/2 ounces)", "1/4 teaspoon ground nutmeg", "1 pound unpeeled large red-skinned potatoes, cut into 1-inch pieces", "6 cups water", "1 teaspoon salt", "1 tablespoon extra-virgin olive oil", "1 tablespoon chopped fresh parsley", "48 (about) 6-inch skewers"], "instructions": ["Heat oil in heavy medium saucepan over medium heat. Add onion; sauté until soft, about 4 minutes. Reduce heat to low. Add cream, cream cheese, Parmesan, and Gruyère. Whisk until smooth, about 3 minutes. Stir in nutmeg. Season with salt and pepper. Remove from heat.", "Combine potatoes, 6 cups water and salt in large saucepan. Bring to boil over high heat. Reduce heat to medium and cook until potatoes are just tender when pierced with skewer, about 6 minutes. Drain. Transfer potatoes to bowl. Add olive oil and parsley; toss to coat. Season to taste with salt and pepper. DO AHEAD Fondue and potatoes can be prepared 1 day ahead. Cover separately and refrigerate. Whisk fondue 5 minutes over medium heat until melted and smooth. Reheat potatoes in 350°F oven 10 minutes.", "Place potatoes on platter. Spear each with skewer. Serve with warm fondue."]}, "Nacho Cheese Dip": {"ingredients": ["1/2 cup beer", "1 teaspoon ground cumin", "1/2 teaspoon dried oregano", "1/2 teaspoon garlic powder", "1 16-ounce can refried beans", "1/2 cup purchased chunky hot salsa", "1 16-ounce package Velveeta cheese, cut into 1/2-inch pieces", "1/4 cup chopped fresh cilantro", "Tortilla chips"], "instructions": ["Combine beer, cumin, dried oregano and garlic powder in heavy medium sauce-pan. Bring to simmer. Add beans and salsa; stir until heated through. Add Velveeta cheese; stir until cheese melts, about 3 minutes. Stir in cilantro. Transfer to bowl. Serve warm with tortilla chips."]}, "No-Cholesterol Brownies": {"ingredients": ["1 1/2 cups sugar", "1 cup all purpose flour", "3/4 cup unsweetened cocoa powder", "1 teaspoon baking soda", "1/4 teaspoon salt", "3/4 cup vegetable oil", "4 whites, beaten to blend", "2 teaspoons vanilla", "2/3 cup chopped walnuts"], "instructions": ["Preheat oven to 350°F. Grease 8-inch square pan with 2-inch-high sides. Combine first 5 ingredients in large bowl. Add oil, egg whites and vanilla and blend. Stir in walnuts. Transfer to prepared pan. Bake until brownies are slightly puffed in center and edges are beginning to brown, about 30 minutes. Cover hot brownies in pan with foil and chill overnight. Cut brownies into 16 2-inch squares. DO AHEAD Can be prepared 3 days ahead. Store in airtight container."]}}