{"Quick hot and sour noodle soup": {"ingredients": ["1 tbsp groundnut oil", "2.5cm/1in piece fresh root ginger, peeled and thinly sliced", "2 handfuls fresh shiitake mushrooms, sliced ", "1 red chilli, de-seeded, finely chopped ", "1 tbsp Shaoxing rice wine or dry sherry", "700ml/1 pint 5fl oz vegetable stock ", "220g/8oz canned bamboo shoots, drained and rinsed", "1 tbsp light soy sauce ", "1 tbsp dark soy sauce ", "1 tbsp Chinese black rice vinegar or balsamic vinegar ", "pinch ground white pepper ", "1 tbsp cornflour mixed with 2 tbsp cold water", "200g/7oz cooked egg noodles", "2 small handfuls beansprouts", "8 baby sweetcorn, sliced", "1 spring onion, sliced", "100g/3½oz cooked chicken, shredded"], "instructions": ["For the soup base, heat the oil in a wok, then fry the ginger and shiitake mushrooms for 2-3 minutes, or until softened. Add the chilli, Shaoxing rice wine, vegetable stock, bamboo shoots and the seasonings. Bring to the boil, then add with the cornflour paste, stirring well, until thickened. Keep warm over a low heat. ", "For the noodle pot, layer the cooked egg noodles, beansprouts, sliced baby corn and spring onions in a plastic pot or serving bowl. Top with shredded chicken, then spoon the soup over the ingredients. Give the noodle pot or bowl a good stir and serve immediately."]}, "Quick pickles": {"ingredients": ["1 red onion, thinly sliced", "¼ cucumber, thinly sliced", "1 carrot, peeled into strips with a vegetable peeler", "2 tsp sugar", "1 tsp salt", "125ml white wine vinegar, plus extra depending on your jar"], "instructions": ["Put your chosen vegetable into a bowl and sprinkle over the sugar and salt. Massage the vegetables gently for a few minutes then squeeze out the excess moisture.", "Pack into the clean jam jar and pour in the vinegar, plus any extra to half-fill the jar. Top up with water so that the vegetables are covered, seal with a lid and shake to combine. Leave to stand for 20 minutes before eating. Kept refrigerated the pickled will last 2 weeks."]}, "Quick tomato and basil tart": {"ingredients": ["1 sheet ready-rolled puff pastry", "1 jar ready-made pesto", "5 ripe plum tomatoes, thinly sliced", "sea salt flakes and freshly ground black pepper", "1 bag herb salad", "4 tbsp extra virgin olive oil", "2 tsp lemon juice"], "instructions": ["Preheat the oven to 180C/350F/Gas 4.", "Place the puff pastry on a non-stick baking sheet. Prick all over with a fork, leaving a 1inc/2cm border around the edge. ", "Spread the jar of pesto over the pastry base, being careful not to cover the border. Then lie the tomatoes on top of the pesto, overlapping slightly. Season generously with sea salt and freshly ground black pepper.", "Bake in the oven for 15-20 minutes or until the pastry border is crisp and golden and the tomatoes are soft.", "Dress the salad with two tbsp of olive oil and the lemon juice, season generously with salt and freshly ground black pepper and mix well.", "To serve, cut into the tart into slices. Place the salad in the centre of each serving plate and place a slice of tart on top. Finish with a drizzle of olive oil."]}, "Quick-spiced chicken thighs with 'emergency biryani'": {"ingredients": ["1 dessertspoon ready-made sweet chilli sauce or mango chutney", "2 tsp ready-made curry powder", "1 tsp ground cumin", "3 garlic cloves, crushed to a paste with the edge of a knife", "1 dessertspoon ginger syrup (from a jar of stem ginger)", "1 tbsp plain yoghurt", "8 chicken thighs, skin on, bone in, skin scored several times with a sharp knife ", "2 tbsp vegetable oil", "½ onion, peeled, finely sliced", "2 garlic cloves, crushed to a paste with the edge of a knife", "100g/3½oz button mushrooms, sliced", "1 tsp dried chilli flakes", "1 tsp ground turmeric", "500g/1lb 2oz basmati rice, rinsed thoroughly in cold water before cooking", "100g/3½oz fresh peas", "2 ripe tomatoes, chopped"], "instructions": ["For the spiced chicken, in a large dish, mix together all of the spiced chicken ingredients, except the chicken thighs. ", "Add the chicken thighs and turn to coat them in the marinade, rubbing the marinade into the scored chicken skin using your hands.  ", "Cover the dish and chill in the fridge until needed, or ideally overnight. ", "When the chicken has marinated, preheat the oven to 200C/400F/Gas 6. ", "Arrange the marinated chicken thighs on a baking tray, leaving a little space between each thigh. Spoon teaspoons of the remaining marinade over the chicken thighs.", "Transfer the chicken thighs to the oven and cook for 12-15 minutes, or until crisp and beginning to blacken. ", "Reduce the oven temperature to 180C/350F/Gas 4 and continue to cook the chicken thighs for a further 15-20 minutes, or until the chicken is dark golden-brown and completely cooked through. ", "Meanwhile, for the 'emergency biryani', heat the oil in a large casserole that has a tight-fitting lid over a medium heat. Add the onion and garlic and fry for 3-4 minutes, or until softened and starting to colour. ", "Add the mushrooms and continue to fry for 2-3 minutes, or until softened. ", "Add the chilli flakes and ground turmeric and cook for a further minute, stirring well, until the spices are fragrant. ", "Add the rice and stir until well combined. ", "Add enough cold water to the pan to reach 1cm/½ in above the level of the rice. ", "Bring the water to the boil in the pan, then immediately cover the pan tightly with aluminium foil and cover with the lid. Continue to boil the rice for 4-5 minutes, then turn off the heat and leave the pan on the residual heat for a further 15 minutes (the steam in the pan will continue to cook the rice).", "Carefully lift the foil covering and add the peas and chopped tomatoes. Return the foil covering and stand on the residual heat for a further five minutes, or until the rice is tender.", "To serve, fluff the rice with a fork, then divide it equally among four serving plates. Place two quick-spiced chicken thighs alongside each serving. Serve with a lightly dressed green salad."]}, "Quince paste (membrillo)": {"ingredients": ["1.8kg/4lbs quinces, washed, peeled, cored, chopped", "vanilla pod, split", "caster sugar, amount determined during cooking"], "instructions": ["Place the quince pieces into a large pan and add enough water to cover. Add the vanilla pod and bring to the boil. Place a lid on the pan and boil for 30-40 minutes, or until quinces are very soft.", "Drain the liquid from the quinces and transfer the quinces to a scale to weigh. Note the weight of the quinces - this is the weight of caster sugar you will require.", "Place the fruit into a food processor and blend until very smooth.", "Return to the original pan and add an equal weight of sugar.", "Cook over a low heat, stirring constantly, until the sugar dissolves.", "Continue to cook over a low heat, stirring occasionally, for 1-1½ hours, or until the quince paste has thickened and has a deep orange colour.", "Pour the cooked paste out onto a lined 20cm/8in x 20cm/8in baking tray and smooth the paste out evenly. Allow to cool and set, then cut into portions. Wrap each in baking paper and store in an airtight container in the fridge for up to 3 months."]}, "Quick fish curry": {"ingredients": ["3 tbsp sunflower oil ", "2 large onions, finely chopped", "4 garlic cloves, crushed ", "4cm/1½in fresh root ginger, finely grated ", "1 tsp ground coriander ", "2 tsp garam masala ", "10 curry leaves ", "2–3 tbsp palm sugar (available from Asian grocers) or light brown sugar", "400g tin coconut milk ", "3 limes, juice only", "5 vine-ripened tomatoes, chopped and blended", "700g/1lb 9oz skinless salmon fillet, cut into 2cm/¾in-wide finger-length pieces", "3 tbsp grated creamed coconut, to garnish ", "handful fresh coriander, chopped, to garnish ", "freshly steamed basmati rice, to serve (optional)"], "instructions": ["Heat the oil in a heavy-bottomed saucepan over a low heat. Add the onions and fry for 15 minutes, or until soft and starting to turn golden. ", "Add the garlic, ginger, ground coriander, garam masala and curry leaves and cook for 1 minute. Add the palm sugar, coconut milk, lime juice and blended tomatoes and cook for 10–15 minutes, or until slightly reduced. ", "Add the salmon and gently poach for 5–6 minutes. ", "Serve with steamed basmati rice if desired, garnished with coconut cream and fresh coriander."]}, "Quesada (Mexican lasagne)": {"ingredients": ["light chicken stock, to poach the chicken", "1.5kg/3lb 5oz whole chicken ", "150ml/5fl oz sunflower or rapeseed oil  ", "1 onion, peeled and finely chopped ", "3 cloves garlic, peeled and crushed ", "1 litre/1¾pt  passata ", "1 tsp tequila", "1 tsp caster sugar ", "pinch salt", "2 fresh poblano chillies, seeds removed, sliced (alternatively use green pepper)", "10 baby courgettes, finely sliced ", "6 small soft corn tortillas (or 2 large ones if available)", "10 courgette flowers, torn in half", "200g/7oz cheddar, grated  ", "200ml/7fl oz double cream ", "4 courgette flowers", "200g/7oz plain flour", "300ml/10fl oz sparkling water", "1 tsp salt"], "instructions": ["Place the chicken in a large stock pot and cover with light chicken stock. Bring to the boil, reduce the heat, cover and simmer for about 30 minutes or until the chicken is cooked through. (When it is cooked, you should be able to pull the legs easily off. But do be careful as it is hot!)", "Remove the chicken from the pot, reserving the stock for another recipe. Allow the chicken to cool slightly, then while it is still warm, pick all the meat from the bones. ", "Shred the chicken quite finely into strips using your hands and set side.", "Pre-heat the oven to 180C/350F/Gas 4.", "Make a tomato sauce by heating 50ml of the oil in a heavy-based saucepan. Add the chopped onion and cook until soft and slightly coloured. Add the garlic and cook gently for a further 3-5 minutes.", "Add the passata, tequila, sugar and a pinch of salt. Bring to the boil, lower the heat and simmer to reduce the sauce slightly.", "In a frying pan, heat one tablespoon of the oil and add the poblano chilli. Cook over a medium heat until softened.  ", "Add the sliced courgettes into the frying pan, turn the heat up and cook for 2-3 minutes.  ", "Heat the remaining oil in a large frying pan and individually fry the tortillas on both sides and drain well on paper towel. ", "In a deep ceramic oven proof dish, start building up the quesada. Break up the tortillas so they fit snuggly inside the dish.", "Place a ladle full of tomato sauce on the base of the dish followed by a layer of the shredded chicken and one-third of the sliced courgettes and flowers. Top with a layer of fried tortilla, one-third of the grated cheese and cream.", "Repeat this process twice more, finishing with a layer of tortilla, cheese and cream.    (You may not use all the chicken.)", "Place in a pre-heated oven for 20 minutes and bake until the top is bubbling and golden-brown.  Remove from the oven and allow to cool for five minutes before cutting into six pieces. ", "For the battered courgette flowers, heat a deep fat fryer to 180C/350F. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)", "Place the flour, salt and water in a large bowl and whisk until smooth. Dip the courgette flowers in the batter and place in the deep-fat fryer for 2-3 minutes, turning once, until the flowers are golden-brown all over. Carefully remove from the hot fat with a slotted spoon and drain on kitchen paper.", "Place a spoonful of lasagne on a serving plate and serve the fried courgette flowers alongside."]}, "Quesadilla with chargrilled pepper, mushrooms and refried beans": {"ingredients": ["1 pepper, de-seeded, sliced", "100g/3½oz chestnut mushrooms, chopped", "1 tbsp olive oil", "salt and freshly ground black pepper", "400g/14oz tinned kidney beans, rinsed and drained", "4 chestnut mushrooms, chopped", "salt and freshly ground black pepper ", "2 fresh sage leaves (or pinch dried sage)", "1 tbsp olive oil", "3 flour tortillas"], "instructions": ["For the chargrilled pepper and mushrooms, toss the pepper and mushrooms together in a bowl with the olive oil, then season with salt and freshly ground black pepper. Heat a griddle pan until smoking, add the pepper and mushrooms and fry for 3-4 minutes, or until tender and charred on all sides. Set aside.", "For the refried beans, place all of the beans ingredients into a mini food processor and blend to a smooth paste.", "For the quesadilla, place one tortilla in a heated frying pan, spread over half of the refried beans and scatter over half of the chargrilled pepper and mushrooms. Place another tortilla on top and spread over the remaining refried beans, followed by the rest of the pepper and mushrooms. Finish with the third flour tortilla on top, press down and cover with a lid. Cook over a medium heat for five minutes, or until the bottom tortilla is golden-brown.", "To serve, slide the quesadilla onto a serving plate and slice into wedges. Serve."]}, "Quince tarte tatin": {"ingredients": ["5 quinces, peeled, quartered and cored", "2 tbsp caster sugar ", "1 lemon, juice only", "325g/11½oz ready-rolled all-butter puff pastry ", "flour, for dusting", "175g/6oz unsalted butter, room temperature", "175g/6oz granulated sugar ", "1 star anise", "1 vanilla pod, split and seeds scraped", "1 cinnamon stick ", "2 bay leaves  ", "vanilla ice cream, to serve"], "instructions": ["Place the quince, caster sugar and lemon juice in a saucepan and add water until the quince quarters are well covered. Bring to the boil and simmer gently for 10 minutes.  Remove the quince from the water with a slotted spoon and transfer to kitchen paper to drain and cool. ", "Roll the pastry out on a lightly floured work surface and cut out a circle that is 28cm/11in in diameter. Leave to chill in the fridge until needed. Preheat the oven to 200C/180C Fan/Gas 6.  ", "Press the butter onto the base of a high-sided 26cm/10½in-diameter heavy-based ovenproof frying pan with the back of a spoon until it completely covers the base. Sprinkle over the granulated sugar evenly.  Add the star anise, vanilla seeds, cinnamon stick and bay leaves. Lay the quince quarters on top, cut side-up. ", "Lay the pastry over the quinces and tuck it down the sides of the pan. Prick a few holes into the pastry to let the steam escape.   ", "Place the pan over a medium heat for 6–8 minutes, turning and shaking the pan occasionally to avoid burning. When the caramel is slightly golden, place the pan in the oven and bake, turning once, for 25 minutes, or until the pastry is golden. Remove from the oven and leave to rest for at least an hour.  ", "When ready to serve, warm slightly on the hob again to release the caramelised fruit and very carefully turn out onto a serving plate. Cut into slices and serve immediately with the vanilla ice cream. "]}, "Quick paella with hot-smoked salmon": {"ingredients": ["1 tbsp olive oil", "1 onion, sliced", "1 garlic clove, crushed", "110g/4oz chorizo ", "1tsp smoked paprika ", "300g/11oz long grain rice", "1 litre/1¾ pints hot chicken stock ", "200g/7oz frozen peas", "500g/1lb 2oz clams", "3 tbsp chopped fresh flat leaf parsley", "250g/9oz hot-smoked salmon fillet, skinned and flaked", "1 lemon, cut into wedges", "sea salt and freshly ground black pepper"], "instructions": ["Heat the oil in a heavy-based frying pan and cook the onion and garlic for five minutes, stirring regularly.", "Add the chorizo and fry until it releases its oil, then stir in the smoked paprika and rice. ", "Keep stirring until the rice is coated in oil before pouring in the stock. Bring to the boil and simmer for 15 minutes.", "Add the clams and peas. Cook for another five minutes, or until the rice is cooked and the clam shells open (discard any clams that don't open).", "Add salt and pepper, to taste. Stir through the parsley, flakes of salmon and garnish with thelemon wedges. Serve immediately."]}, "Quail with bois boudran and potato salad": {"ingredients": ["4 quails, legs removed", "1 shallot, finely chopped", "125ml/4¼fl oz olive oil", "120g/4¼oz tomato ketchup", "10ml/½fl oz Worcestershire sauce", "dash Tabasco sauce", "2 tsp Dijon mustard", "¼  bunch chives, finely chopped", "¼  bunch basil, finely chopped", "500g/1lb 1oz Jersey royal potatoes", "200ml/7¼fl oz olive oil", "2 lemons, juice and zest", "4 sprigs fresh basil"], "instructions": ["For the quail with bois boudran, cut the breasts off the quails, keeping the wing bone attached.", "Heat a griddle pan until hot and fry the quail breasts for 2-3 minutes on each side, or until cooked to your liking.", "Mix the remaining ingredients in a bowl until well combined and add the cooked quail. Stir until well combined.", "For the potato salad, boil the potatoes in a pan of boiling salted water for 5-8 minutes, or until tender. Drain.", "Mix the potatoes, olive oil, lemon juice and zest and basil in a bowl. Season, to taste, with salt and freshly ground black pepper.", "To serve, place two quail breasts onto of four serving plates. Spoon plenty of sauce on top and some potato salad alongside. "]}, "Quick syrup and lemon sponge pudding": {"ingredients": ["350g/12oz butter, softened, plus extra for greasing", "200g/7oz golden syrup", "125g/4½oz caster sugar", "2 lemons, zest only", "6 free-range eggs, lightly beaten", "350g/12oz  self-raising flour", "75g/3oz golden syrup", "1 litre/2 pints custard"], "instructions": ["Generously butter the inside of two 1.2 litre/2 pint pudding basins.  ", "Spoon 100g/3½oz of the golden syrup into the base of the pudding basins and set aside.", "Beat the remaining 100g/3½oz golden syrup, butter, sugar and lemon zest together in a large bowl until light and fluffy.", "Beat in half the eggs followed by half the flour and when well combined, add the remaining eggs and flour. The mixture should be at a just dropping consistency. (Add a splash of milk if the mixture is very thick.)", "Spoon the mixture into the pudding basins until three-quarters full, then smooth the surface with the back of a spoon.", "Loosely cover with clingfilm (allow room for the clingfilm to inflate as the mixture rises) and place in the microwave for five minutes. (Cook one pudding at a time.)", "The pudding is done when a skewer inserted into the centre comes out clean. Leave to stand for five minutes. Run a blunt knife around the edge of the pudding to loosen the sides, carefully invert onto a deep plate and remove the basin.", "To serve, spoon the extra syrup over the pudding, cut into generous wedges and serve with custard."]}, "Quick chicken Madras": {"ingredients": ["4 skinless, boneless chicken breasts or thighs", "½ lemon, juice only", "1 tsp garam masala", "salt", "2 tbsp vegetable oil or ghee (clarified butter)", "1 large onion, finely chopped", "ready-made madras curry paste, 1-2 tbsp for mild, 3 tbsp for medium-hot, and 4-5 tbsp for hot", "1x400g can chopped tomatoes", "50g/2oz desiccated coconut", "small handful of fresh coriander, chopped"], "instructions": ["Cut the chicken into bite-size pieces and mix with the lemon juice, and garam masala and season with salt.", "Heat the oil or ghee in a deep frying pan or saucepan over a medium heat and cook the onion for 6-7 minutes until softened and becoming golden. Add the chicken and fry for 3-4 minutes until it has become opaque in colour. Stir in the Madras paste and cook for a couple of minutes before adding the chopped tomatoes and coconut. Cover with a lid and leave to simmer gently for about 20 minutes. Stir in the chopped coriander and serve straight away with naan bread."]}, "Quick minestrone": {"ingredients": ["4 tbsp olive oil", "2 large carrots, diced", "1 large onion, roughly chopped", "2 celery sticks, roughly chopped", "2 garlic cloves, finely chopped", "pinch dried red chilli flakes", "200g/7oz tinned white beans, such as haricot (drained weight)  ", "500ml/18fl oz vegetable or chicken stock", "ciabatta bread, cut into slices, to serve", "100g/3½oz Parmesan (or alternative vegetarian hard cheese), finely grated, to serve", "250g/9oz kale, stalks removed, roughly chopped", "handful fresh flatleaf parsley, roughly chopped "], "instructions": ["Heat a dash of oil in a frying pan over a medium heat. When hot, add the carrots, onion, celery, garlic and chilli flakes. Fry until softened, then tip in the beans and stock. Stir, bring to a simmer and cook for 5–8 minutes, or until cooked through.", "Preheat the grill until hot. Toast both sides of the ciabatta slices. Sprinkle with the Parmesan and toast until melted.", "Stir the kale and parsley into the soup just before serving. Serve the soup in warm bowls with the Parmesan toasts."]}, "Quiche Lorraine": {"ingredients": ["175g/6oz plain flour, plus extra for dusting", "75g/2¾oz butter, plus extra for greasing", "salt", "250g/9oz cheddar, grated ", "4 tomatoes, sliced (optional)", "200g/7oz streaky bacon, chopped", "5 free-range eggs, beaten", "100ml/3½fl oz milk", "200ml/7fl oz double cream", "2 sprigs fresh thyme", "freshly ground black pepper"], "instructions": ["To make the pastry, sift the flour together with a pinch of salt in a large bowl. Rub in the butter until you have a soft breadcrumb texture. Add enough cold water to make the crumb mixture come together to form a firm dough, and then rest it in the fridge for 30 minutes.", "Roll out the pastry on a light floured surface and line a 22cm/8½in well-buttered flan dish. Don't cut off the edges of the pastry yet. Chill again.", "Preheat the oven to 190C/170C Fan/Gas 5.", "Remove the pastry case from the fridge and line the base of the pastry with baking parchment and then fill it with baking beans. Place on a baking tray and bake blind for 20 minutes. Remove the beans and parchment and return to the oven for another five minutes to cook the base", "Reduce the temperature of the oven to 160C/140C Fan/Gas 3.", "Sprinkle the cheese into the pastry base and add the sliced tomatoes if you are using them. Fry the bacon pieces until crisp and sprinkle over them over the top.", "Combine the eggs with the milk and cream in a bowl and season well. Pour over the bacon and cheese. Sprinkle the thyme over the top and trim the edges of the pastry. ", "Bake for 30–40 minutes, or until set. Allow to cool and set further. ", "Trim the pastry edges to get a perfect edge and then serve in wedges."]}, "Quick pepperoni pizza": {"ingredients": ["300g/10½oz strong white bread flour, plus extra for dusting", "2 tsp baking powder", "½ tsp sea salt", "2 tsp rapeseed oil", "150–175ml/5–6fl oz lukewarm water", "freshly ground black pepper", "120g/4½oz passata", "1 tbsp tomato purée", "½ tsp dried mixed herbs", "½ tsp sea salt ", "1 mozzarella ball, torn into small pieces", "10 pepperoni slices", "30g/1oz cheddar, grated"], "instructions": ["Preheat the oven to 200C/180C Fan/Gas 6 and place a large baking tray upside-down on a shelf.", "To make the dough, sift the flour and baking powder into a large bowl. Add the salt and a pinch of pepper, then stir in the oil. Make a well in the centre, then stir in the warm water and mix to a soft dough, drawing the flour in from the side of the bowl a little at a time – you might need to add another 25ml/1fl oz water if the dough is a little dry; you want it to be slightly sticky and soft.", "Tip the dough onto a lightly floured work surface and knead for 2 minutes, until smooth and springy.", "Place a sheet of greaseproof paper on the work surface, then dust with a little flour and place the dough on top of it. Carefully roll the dough out into a  30cm/12in disc, roughly the thickness of a pound coin. Pick the paper up and carefully slide it onto the hot baking tray in the oven. Bake for 3 minutes.", "Meanwhile, pour the passata into a bowl, then add the tomato purée, mixed herbs and sea salt and black pepper and mix.", "Remove the dough tray from the oven. Cover the base with the tomato sauce, using the back of a spoon, leaving a small gap around the edges of the dough. Scatter the mozzarella over the tomato sauce, then top with the pepperoni and cheddar (you can add any other toppings you fancy at this point – see tips below.)", "Bake for 15 minutes, or until the base has puffed up and is cooked through and the cheese is golden and bubbling. Cut into wedges and serve immediately."]}, "Quick vegetable curry": {"ingredients": ["2 large aubergines, cut into quarters, thickly sliced ", "salt", "good glug groundnut oil", "2 onions, peeled and roughly chopped", "3 large, juicy garlic cloves, peeled, chopped", "finger-length piece fresh root ginger, peeled and cut into fine shreds", "6-8 cardamom pods", "1-2 good pinches dried chilli flakes", "1-2 tsp ground turmeric", "1-2 tsp cumin seeds", "6-8 tomatoes, roughly chopped", "salt and freshly ground black pepper", "few good dollops natural yoghurt ", "small handful fresh coriander and or mint, roughly chopped"], "instructions": ["Place the aubergine slices into a colander set over a bowl. Sprinkle with salt and leave for 30 minutes to draw out the moisture from the aubergine.", "Meanwhile, to a large pan over a high heat add the groundnut oil with the onions, garlic and ginger. Cover with a lid, lower the heat and cook for 20 minutes or so, until the onions have softened.", "Crush the cardamom pods, extract the black seeds and lightly crush them in a mortar with a pestle. Add them to the same pan, along with the chilli flakes, turmeric and cumin seeds, and stir to lightly toast the spices (discard the empty cardamom pods). Add the chopped tomatoes to the pan, pour in enough water to cover the vegetables, and season well with salt and freshly ground black pepper. Bring to a simmer, then cover and leave to cook while you cook the aubergine.", "Rinse the salt off the aubergine and brown the pieces lightly on a hot griddle, working in batches if necessary. Add the griddled aubergine slices to the pan with the onions, tomatoes and spices, cover and simmer until the aubergine is very soft, about 25 minutes. Taste the curry, turn off the heat then adjust the spice-level by adding natural yoghurt and crème fraîche, to taste. Sprinkle over the chopped coriander and mint and serve."]}, "Quick peanut and chilli noodles": {"ingredients": ["100g/3½oz dried wholewheat noodles", "salt", "50g/1¾oz peanut butter (around 3 tbsp)", "1 tbsp grated fresh root ginger ", "1 tbsp sweet chilli sauce", "2 tbsp tamari or soy sauce", "1 lime, juice only ", "2 spring onions, finely chopped", "1 tbsp roasted salted peanuts, finely chopped (optional)"], "instructions": ["Cook the noodles in a pan of boiling water with a generous pinch of salt for 6–7 minutes, or according to packet instructions, until tender.", "Meanwhile, whisk all of the sauce ingredients together in a bowl, adding 4 tablespoons of water to loosen the sauce.", "Drain the noodles, leaving a splash of water in the bottom of the pan. Add the peanut sauce, heat for a minute and toss through the noodles.", "Garnish with chopped spring onions and peanuts, if using."]}, "Quick vegetable pasta ": {"ingredients": ["150g/5oz whole wheat pasta, such as spaghetti", "2 tbsp extra virgin olive oil", "1 yellow pepper, deseeded and cut into roughly 2cm chunks", "1 courgette, trimmed and cut into roughly 2cm chunks ", "200g/7oz cherry tomatoes", "2 spring onions, trimmed and sliced", "¼ tsp dried chilli flakes", "½ small lemon, finely grated zest and juice ", "2 large handfuls young spinach leaves (around 75g/2½oz)", "sea salt and freshly ground black pepper", "grated Parmesan (or alternative vegetarian hard cheese), to serve (optional)"], "instructions": ["Half-fill a large saucepan with water and bring to the boil. Add the pasta and return to the boil. Cook for 12 minutes, or until just tender, stirring occasionally.", "While the pasta is cooking, heat 1 tablespoon of the oil in a large frying pan over a medium heat and fry the pepper, courgette and whole tomatoes for 5 minutes, stirring occasionally. Add the remaining oil and spring onions and cook for 4–5 minutes, or until all the vegetables are softened and lightly browned, stirring regularly. (The tomatoes need to be soft so they release their juice to make a light sauce to coat the pasta.)", "Add the chilli flakes, lemon zest and juice and cook for a few seconds. Stir in 1 ladleful of the hot pasta cooking water and season with salt and pepper.", "Drain the pasta then return to the saucepan and add the vegetables and spinach leaves. Toss together over a low heat for 1–2 minutes, or until the spinach softens and wilts. Divide between two shallow bowls and serve topped with grated Parmesan if you like."]}, "Quick fish gratin ": {"ingredients": ["20g/¾oz cornflour", "300ml/10fl oz semi-skimmed milk ", "300g/10½oz mixed fish, including smoked haddock, cod and salmon, thawed if frozen", "50g/1¾oz baby spinach leaves", "½ small lemon, finely grated zest only (optional)", "1 thin slice white or brown bread ", "15g/½oz Parmesan, finely grated ", "sea salt and freshly ground black pepper ", "100g/3½oz frozen peas, to serve "], "instructions": ["Place the cornflour into a small bowl and stir in 3 tablespoons of the milk until it forms a smooth paste.", "Pour the remaining milk into a non-stick saucepan. Add the fish, spinach and lemon zest, if using, to the pan and season with a little salt and pepper. Bring the milk to a gentle simmer and cook for 3–4 minutes, or until the fish is beginning to flake, stirring occasionally. ", "Stir in the cornflour mixture and cook for 1 minute, or until the sauce has thickened. Stir constantly, taking care not to break up the fish pieces too much. Taste and adjust seasoning, if necessary. Spoon into a warmed, shallow flameproof dish or two individual pie dishes. ", "Preheat the grill to high. Tear the bread into small pieces and toss in a small bowl with the Parmesan. Scatter over the fish.", "Place the dish or dishes onto a baking tray and place under the hot grill for about 2 minutes, or until the topping is crisp and lightly browned – watch carefully so it doesn’t burn.", "Place the peas into a saucepan of boiling water and cook for 2–3 minutes, or according to packet instructions. Drain well and serve immediately with the pie."]}, "Quick sausage casserole with Savoy cabbage pesto": {"ingredients": ["3-4 tbsp vegetable oil", "150g/5oz streaky bacon, roughly chopped", "8 good-quality Lincolnshire or Cumberland sausages", "1 onion, chopped", "2 garlic cloves, finely chopped", "1 carrot, chopped", "1 celery stalk, trimmed, diced", "2 x 400g tins butter beans, drained", "100ml/3½fl oz white wine vinegar", "50g/1¾oz caster sugar", "100ml/3½fl oz dry white wine", "400ml/14fl oz hot chicken stock", "2 bay leaves", "½ small Savoy cabbage, root removed, leaves separated and washed", "small handful fresh flatleaf parsley", "50g/1¾oz Parmesan", "50g/1¾oz pine nuts", "½ garlic clove, grated", "150ml/5fl oz olive oil, plus extra for drizzling", "2-3 slices white bread", "1 unwaxed lemon, zest only", "salt and freshly ground black pepper"], "instructions": ["For the sausage casserole, heat the vegetable oil in a wide, shallow ovenproof pan (or flameproof casserole) over a medium heat. Add the bacon and fry until crisp and golden-brown, then remove from the pan and set aside to drain on kitchen paper. ", "Add the sausages to the pan and fry until browned all over, then remove from the pan and set aside to drain with the bacon. ", "Add the onion, garlic, carrot and celery to the pan and fry for 5-6 minutes, stirring regularly, until softened. ", "Add the beans, vinegar and sugar and increase the heat to high. Bring the mixture to the boil, then reduce the heat until the mixture is simmering. Simmer for 4-5 minutes, or until the volume of liquid has reduced by half. ", "Pour in the wine and the stock and add the bay leaves. Return the bacon and sausages to the casserole. Slice the inner Savoy cabbage leaves (from the pesto ingredients) and stir them into the stew. Stir well and bring the mixture to the boil, then reduce the heat until the mixture is simmering, and simmer for 10-12 minutes, or until the volume of liquid has reduced by about half, and the casserole has thickened. ", "For the pesto, finely chop the remaining Savoy cabbage leaves and put a small handful in a food processor. Add the parsley, Parmesan, pine nuts, garlic and half of the olive oil and blend to a rough paste. Add more oil as necessary to loosen the mixture, pulsing the pesto as you add the oil. ", "Transfer the pesto to a jug and season, to taste, with salt and freshly ground black pepper. ", "Blend the bread, lemon zest and the remaining chopped cabbage leaves in the food processor.", "Preheat the grill to a medium setting. When the casserole has cooked, drizzle the pesto all over the surface, then sprinkle over the breadcrumb mixture. Drizzle the breadcrumb mixture with a little olive oil. Transfer the casserole to the grill and grill until the crust is toasted and golden-brown. Serve immediately."]}, "Quick cauliflower curry": {"ingredients": ["2 tbsp vegetable oil", "½ onion, finely chopped", "1 baby cauliflower, outer leaves removed, chopped", "½ potato, peeled and chopped", "½ tsp ground turmeric", "1 pinch chilli flakes", "salt, to taste", "25g/1oz fresh peas, out of their pods", "3 tbsp double cream", "2 tbsp chopped fresh coriander"], "instructions": ["Heat the oil in a pan and gently fry the onion for 2-3 minutes, or until softened, then stir in the cauliflower, potato, turmeric and chilli flakes and cook for 1-2 minutes. ", "Add the salt, to taste, peas, and cream and cook for 3-4 minutes, or until the vegetables are tender.", "To serve, spoon the curry into serving bowls and garnish with the fresh coriander."]}, "Quick cabbage soup": {"ingredients": ["¼ potato, peeled and finely chopped ", "300ml/10½fl oz vegetable stock ", "¼ Savoy cabbage, chopped", "25g/1oz toasted peanuts, to garnish"], "instructions": ["Place the potato and stock into a saucepan over a high heat. Bring to the boil then reduce the heat to simmer for seven minutes.", "Add the cabbage and continue to simmer for six minutes, until the cabbage has cooked and the potatoes are soft.", "To serve, pour the soup into a bowl and finish with a sprinkling of peanuts."]}, "Quick sweetcorn fritters with bacon": {"ingredients": ["100g/3½oz self-raising flour", "1 tsp salt", "5 tbsp milk", "100g/3½oz canned sweetcorn, rinsed and drained ", "1 tbsp vegetable oil", "4 slices bacon, fried until crisp", "2 tbsp honey, for drizzling"], "instructions": ["Place the flour, salt and milk into a large bowl and whisk together to make a smooth batter. Stir in the sweetcorn.", "Heat the vegetable oil in a frying pan and pour spoonfuls of the batter into the pan. Fry the fritters until golden-brown underneath, then turn over with a fish slice and fry until golden-brown on the other side. Remove from the pan and set aside to keep warm. Repeat the process with the remaining batter.", "To serve, place the fritters onto serving plates, top with the bacon and drizzle over the honey."]}, "Quinoa goji tabbouleh ": {"ingredients": ["350g/12oz quinoa", "400g/14oz tomatoes, halved, deseeded, diced ", "300g/10½oz fresh flatleaf parsley, leaves finely chopped", "60g/2¼oz fresh mint leaves, finely chopped", "4 spring onions, trimmed, finely chopped", "salt and freshly ground black pepper ", "8 tbsp extra virgin olive oil", "4 tbsp lemon juice", "1 garlic clove, crushed", "1 tsp honey, preferably raw honey (available from health food stores)", "sea salt and freshly ground black pepper", "3 tbsp black or white sesame seeds ", "handful goji berries"], "instructions": ["Put the quinoa in a bowl and cover with approximately 700ml/1¼ pints cold water. Add a pinch of salt. Set aside to soak overnight (or for at least 8 hours).", "Drain and rinse the quinoa well. Put the quinoa in a saucepan, cover with water and bring to the boil. Reduce the heat and simmer for 10-12 minutes, or until tender. Remove from the heat and set aside to cool slightly for 5 minutes. Fluff with a fork to separate the grains. ", "Meanwhile, for the dressing, in a large bowl, whisk together all of the dressing ingredients until well combined. ", "Add the tomatoes to the dressing, then stir in the herbs, spring onions and quinoa. Season with salt and pepper. ", "Just before serving, heat a frying pan over a medium heat. Add the sesame seeds and dry-fry for 1-2 minutes, or until toasted and golden-brown, shaking the pan occasionally to prevent the seeds from burning. Remove from the pan and set aside.", "To serve, pile the tabbouleh on a platter, then sprinkle over the toasted sesame seeds and goji berries."]}, "Quadruple chocolate Black Forest gâteau": {"ingredients": ["unsalted butter, for greasing", "225g/8oz plain flour", "350g/12oz caster sugar", "85g/3oz cocoa powder", "1½ tsp baking powder", "1½ tsp bicarbonate of soda", "2 medium free-range eggs ", "250ml/9fl oz full-fat milk, plus a little extra for the buttercream ", "125m/4fl oz vegetable oil", "2 tbsp boiling water", "2 tsp icing sugar", "2 x 425g tins pitted black cherries in light syrup (reserve 100ml/3½fl oz of the syrup)", "300g/10½oz caster sugar ", "1 lemon, juice only", "4 tbsp cornflour", "5 tbsp cherry and chocolate flavour syrup (such as Monin Black Forest syrup)", "½ tsp cherry essence  ", "10g/⅓oz powdered bovine gelatine  ", "150g/5½oz caster sugar", "100ml/3½fl oz double cream", "125ml/4fl oz glucose syrup", "50g/1¾oz cocoa powder, sifted", "100ml/3½fl oz cherry syrup (reserved from tinned cherries)", "2 tbsp cherry and chocolate flavour syrup (such as Monin Black Forest syrup)", "½ tsp cherry essence", "50g/1¾oz dark chocolate (minimum 70% cocoa solids)", "100g/3½oz unsalted butter, softened", "200g/7oz icing sugar, sifted", "200g/7oz dark chocolate (minimum 70% cocoa solids), finely chopped", "200ml/7fl oz double cream", "dark glace cherries (to decorate)", "400ml/14fl oz double cream", "1 tbsp icing sugar, sifted", "1 tsp cornflour, sifted", "1 tbsp milk powder, sifted (optional)", "50g/1¾oz dark chocolate (minimum 70% cocoa solids), finely chopped", "1 x A4 sheet of acetate "], "instructions": ["Preheat the oven to 180C/170C Fan/Gas 4. Grease and line two 20cm/8in sandwich tins. Set up a freestanding mixer with a paddle attachment.", "For the cake, place all of the ingredients, except the boiling water and icing sugar, into a mixing bowl. Beat until all the ingredients are incorporated and the mixture is smooth. Slowly add the boiling water and mix (the mixture will be very runny). ", "Divide the batter equally between the tins and bake for 25-30 minutes. ", "When the cakes are cooked, let them cool in the tin for 10 minutes. Line a wire rack with greaseproof paper and dust it with icing sugar (the cakes are sticky). Turn out the cakes and leave to cool completely on the prepared rack. When the cakes have cooled, cut both the cakes in half horizontally, to make to 4 layers.", "For the cherry jam, pour the cherries, sugar and lemon juice into a saucepan. Heat gently until the sugar is dissolved. Put 4 tablespoons of the liquid from the pan into a mug and mix in the cornflour. Stir the mixture into jam, along with the cherry and chocolate flavour syrup and cherry essence. Bring to the boil, stirring constantly until thick. Reduce the heat to a simmer. Pour the jam onto a large plate or shallow bowl and transfer to the fridge to cool. (CAUTION: Be careful not to burn yourself when handling the jam.) ", "For the chocolate mirror glaze, mix the gelatine with 3 tablespoons water and set aside to dissolve. In a saucepan, heat the sugar, cream and 6 tablespoons water until it boils. Remove from the heat and add the glucose and cocoa powder. Stir in the gelatine, mix well and strain through a fine sieve. Set aside to cool to room temperature.", "For the syrup, mix the ingredients together and set aside. ", "For the chocolate buttercream, melt the chocolate. You can do this in a microwave or in a heatproof bowl suspended over a bowl of simmering water. Set aside to cool slightly (the chocolate should be warm but not hot).", "Cream the butter and icing sugar together in a large bowl.  When the mixture is smooth, add the melted chocolate and mix until combined. Add a little milk if the buttercream is too thick.  ", "For the chocolate ganache, place the chocolate in a heatproof bowl. Gently heat the cream in a saucepan until it just comes to the boil, then pour it over the chocolate. Stir the mixture until the chocolate is melted. Set aside in a cool place (the ganache will have a spreadable consistency when it’s cool).", "For the whipped cream, beat the cream using a hand held mixer until soft peaks form when the whisk is removed. Add the icing sugar, cornflour and milk powder and beat until firm. Refrigerate until ready to use.", "For the chocolate decorations (if using), melt two-thirds of the chocolate in a heatproof bowl suspended over a pan of simmering water. When the chocolate is melted, remove it from the heat. Add the remainder of the chocolate and stir until melted. Cover the bowl with a tea towel to retain some of the heat.", "Layout the acetate and drizzle the melted chocolate into decorative shapes. (For a neater finish, use a piping bag.) Set aside in a cool place for the shapes to set.", "To assemble the cake, brush each layer of cake with the syrup. Place a layer of cake on a serving plate. Spread a layer of chocolate ganache on top and then a layer of whipped cream. Spoon over some cherry jam. Repeat with two more layers of cake and place the final layer on top. ", "Cover the whole cake in butter cream (if you have time freeze the cake for 10 minutes to help it set). Pour the chocolate mirror glaze over the top of the cake (you should have a smooth glossy surface on the top of the cake with the glaze drizzling down the sides attractively). ", "Decorate the cake by piping rosettes of the chocolate ganache on top, add the chocolate decorations (if using) and finish with a few glacé cherries."]}, "Quick tomato and cream sauce": {"ingredients": ["glug olive oil", "2-3 handfuls ripe mixed tomatoes", "2 garlic cloves, peeled, chopped", "sprig fresh rosemary, leaves only, finely chopped", "3-4 tbsp double cream", "salt and freshly ground black pepper"], "instructions": ["Heat a good glug of olive oil in a pan with a few handfuls of mixed tomatoes, cutting up the larger ones roughly. Add a couple of chopped garlic cloves and a quite finely chopped rosemary sprig or two and cook until the tomatoes are squashy. Pour in a bit of double cream at the end, season with salt and freshly ground black pepper and serve on the side of meat, or eat with rice or pasta."]}, "Quick kedgeree": {"ingredients": ["1 tbsp olive oil", "4 shallots, chopped", "1 clove garlic, chopped", "1 tsp mild curry powder", "250g/8oz basmati or long grain rice, cooked and drained", "500g/1lb 2oz salmon or smoked haddock, cooked, skinned and flaked", "150ml/¼ pint double cream", "salt and freshly ground black pepper", "3 free-range eggs, hard-boiled, cut into quarters", "small handful fresh coriander, to garnish"], "instructions": ["Heat the olive oil in a saucepan, add the shallots and garlic and fry gently until softened but not coloured.", "Add the curry powder and fry for 3-4 minutes.", "Add the shallots and garlic to the cooked rice and stir in the flaked fish and cream. Season with salt and freshly ground black pepper. ", "To serve, spoon into a serving dish and scatter the quartered hard-boiled eggs and fresh coriander leaves over the top."]}, "Quick naan bread": {"ingredients": ["1 tsp dried active yeast", "1 tsp sugar", "200g/7oz plain flour", "pinch nigella seeds", "¼ tsp salt", "½ tsp baking powder", "1 tbsp vegetable oil", "2 tbsp plain yoghurt", "2 tbsp milk"], "instructions": ["Preheat the oven to 140C/275F/Gas 1.", "In a small bowl, mix the yeast with one tablespoon of warm water. Stir in the sugar and leave it in a warm place for five minutes until the yeast is covered with froth. ", "Meanwhile, mix together the flour, onion seeds, salt and baking powder. Stir in the oil, yoghurt and milk, then stir in the activated yeast mixture.", "To knead the dough, clench your hand into a fist, wet your knuckles with a little water, then press them repeatedly into the dough. Continue pressing and kneading until you have a soft, pliable dough. It should take about ten minutes. ", "Place the dough in a mixing bowl, cover it with cling film and leave it in a warm place to rise for 10-15 minutes.", "Divide the dough into four balls and place on a floured surface or board. Roll each into a long oval shape about 0.5cm/¼in thick. Don't roll them out too thinly or they'll turn out like crisps. ", "Place them on a greased baking tray and put them in the centre of the oven for 10-15 minutes. They are ready when they have puffed up a little. They should be soft and crumbly, not chewy. Serve fresh from the oven."]}, "Quick tartare sauce": {"ingredients": ["200ml/7fl oz mayonnaise", "3 tbsp capers, drained and chopped", "3 tbsp gherkins, drained and chopped", "1 small shallot, finely chopped", "squeeze of lemon juice", "3 tbsp chopped fresh parsley", "flaked sea salt and freshly ground black pepper"], "instructions": ["Mix together all of the ingredients in a small bowl and serve straight away or store in the fridge until needed."]}, "Quick chicken biryani": {"ingredients": ["200g/7¼oz basmati rice", "1 tsp salt", "2 tbsp vegetable oil", "8 shallots, chopped", "2 medium onions, chopped", "4 garlic cloves, finely chopped", "2 tsp fresh root ginger, grated", "2 chicken breasts, thinly sliced into strips ", "1 tsp chilli powder", "1 tsp ground cumin", "2 tsp ground coriander", "½ tsp ground cinnamon", "½ tsp ground turmeric", "generous pinch freshly grated nutmeg", "¾ cup plain yoghurt", "2 tsp caster sugar", "4 or 5 handfuls raisins"], "instructions": ["Wash the rice in several changes of water until the water runs clear, then leave to soak in tepid water with the salt for 30 minutes. ", "Drain the rice and place in a pan with enough cold water to come about 2cm/¾inch above the top of the rice.", "Bring the water to the boil, then reduce the heat to as low as possible, cover and cook for about ten minutes, or until 'holes' begin to appear on the top of the rice and all the water has been absorbed. ", "Heat the oil in a frying pan, add the shallots, onions, garlic and ginger and fry for a couple of minutes, until golden-brown. Remove a tablespoonful and set aside for garnishing.  ", "Add the chicken and stir fry for four minutes.", "Add the spices and stir for one minute, then stir in the yoghurt and simmer for 1-2 minutes. Add the sugar, raisins and part-cooked rice. Cover the pan with a clean tea towel and cover with a lid (this will hold in all the steam).", "Place over a very low heat and cook for ten minutes. Remove from the heat and leave to rest for five minutes.", "Serve large spoonfuls garnished with the reserved shallot and onion mixture."]}, "Quick shepherd’s pie": {"ingredients": ["650g/1lb 7oz frozen ready-made potato rostis or hash browns", "100g/3½oz frozen chopped onion (or 1 medium onion, finely chopped) ", "500g/1lb 2oz frozen lamb mince", "1 tbsp medium curry powder", "2 tbsp plain flour", "1 x 400g tin chopped tomatoes", "2 tbsp tomato purée ", "150ml/5fl oz just-boiled water", "½ tsp dried mixed herbs", "1 lamb stock cube", "200g/7oz frozen mixed vegetables", "handful chopped fresh coriander leaves, to garnish (optional)", "salt and freshly ground black pepper"], "instructions": ["Arrange the frozen potato rostis or hash browns in a single layer on a large baking tray so that they can start to thaw as you make the pie filling.", "Heat a large, non-stick saucepan over a medium heat. Add the onion and lamb mince and fry for 8-10 minutes, stirring regularly, until the lamb is no longer pink. Sprinkle over the curry powder and flour and stir well. ", "Add the tinned tomatoes, tomato purée, water and herbs to the pan and stir well to combine. Crumble over the stock cube, stir again, and season, to taste, with salt and freshly ground black pepper. ", "Bring the mixture to the boil, then reduce the heat until the mixture is simmering and simmer for 8-10 minutes, stirring regularly, until the mixture has thickened. ", "Meanwhile, preheat the oven to 200C/180C Fan/Gas 6.", "Once the filling mixture has simmered for 10 minutes, stir in the frozen mixed vegetables and remove the pan from the heat. Transfer the mixture to a 1.7 litre/3 pint pie dish. ", "Break the thawed rostis or hash browns into smaller pieces and scatter them over the shepherd's pie filling. ", "Transfer the pie dish to a baking tray, then cook in the oven for 25-30 minutes, or until the potato topping is cooked through and the filling is bubbling. Garnish with fresh coriander just before serving, if desired. "]}, "Quick homemade doughnuts": {"ingredients": ["sunflower oil, for deep frying", "200ml/7fl oz milk, any kind", "3 large eggs", "30g/1oz caster sugar", "1 orange, finely grated zest only", "1 tsp baking powder", "1 tsp vanilla extract", "6 brioche buns or burger buns", "salt", "100g/3½oz caster sugar", "2 tsp ground cinnamon", "2 oranges, juice only (around 75ml)", "4 tbsp orange marmalade"], "instructions": ["Heat the oil in a deep-fat fryer to 170C (see tip below). (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Put the milk, eggs, sugar, orange zest, baking powder, vanilla and a pinch of salt in a bowl and whisk together well.", "Using a 5cm/2in biscuit cutter, cut a hole in the centre of each bun, discarding the discs you cut out. ", "One at time, dip the bread rolls into the egg mixture, turning once or twice, and holding for a few seconds to absorb the egg. Carefully lower them into the hot oil using tongs – you will probably be able to cook two doughnuts at a time. Deep-fry for 2–3 minutes, turning once, until golden brown and crisp.", "While the doughnuts are cooking, mix the sugar and cinnamon in a bowl. If making the sauce, bring the orange juice and marmalade to the boil in a small saucepan. Cook for 2–3, stirring regularly, until thickened.", "Carefully remove the doughnuts from the hot oil using tongs and drop gently into the cinnamon sugar. Toss lightly and transfer to a plate. Repeat with the remaining doughnuts. Spoon the orange and marmalade sauce over the hot doughnuts and serve with cream, if using."]}, "Quick beany enchiladas": {"ingredients": ["1 tbsp sunflower oil, plus extra for greasing", "100g/3½oz frozen chopped onion (or 1 medium onion, peeled and roughly chopped)", "100g/3½oz mixed frozen peppers (or 1 yellow pepper, de-seeded and sliced)", "1 x 400g tin chopped tomatoes", "1 x 400g tin red kidney beans in chilli sauce", "1 tbsp freshly squeezed lime or lemon juice", "3 heaped tbsp chopped fresh coriander, plus extra to garnish", "4 x 40g/1½oz ready-made flour tortillas ", "75g/2½oz mature cheddar, coarsely grated", "salt and freshly ground black pepper"], "instructions": ["Heat the oil in a large non-stick frying pan over a medium heat. Add the onion and peppers and fry for 3–4 minutes, or until softened and beginning to turn golden-brown. Stir in the chopped tomatoes and kidney beans. ", "Bring the mixture to the boil, then reduce the heat until the mixture is simmering. Simmer gently for 10 minutes, or until the sauce is thick and glossy. ", "Remove the pan from the heat, then stir in the lime juice (or lemon juice) and coriander. Season, to taste, with salt and plenty of freshly ground black pepper. ", "Preheat the oven to 200C/180C Fan/Gas 6.", "Brush the insides of a shallow ovenproof dish all over with a little oil. Place one of the flour tortillas in the dish and spoon one-quarter of the bean mixture into the centre. Roll up the tortilla and push it to one side of the dish. Repeat the process with the remaining flour tortillas and bean mixture, lining the rolled tortillas up against each other. ", "Sprinkle the enchiladas with the grated cheese and bake in the oven for 20 minutes, or until the cheese has melted and turned golden-brown. Just before serving, garnish the enchiladas with fresh coriander.", "To serve, divide the enchiladas equally among the serving plates. Serve with a mixed green salad."]}, "Quick avocado chocolate mousse": {"ingredients": ["2 ripe avocados, halved, stoned and peeled (prepared weight 190g/6½oz)", "2 ripe bananas, peeled (prepared weight 210g/7½oz)", "80g/2¾oz good-quality cocoa powder", "2 tbsp vanilla extract", "1 tsp orange extract", "1 unwaxed orange, finely grated zest only", "120ml/4fl oz maple syrup", "10 Medjool dates, finely chopped", "100ml/3½fl oz milk (or almond milk)", "40g/1½oz good-quality dark chocolate (70% cocoa solids, dairy-free)", "50g/1¾oz pecans, toasted and chopped", "50g/1¾oz macadamia nuts, toasted and chopped", "1 tsp sea salt flakes"], "instructions": ["Put the avocado flesh into a food processor and add the bananas, breaking them into pieces. Add the cocoa powder, vanilla and orange extracts, orange zest, maple syrup, dates and milk. Blend until smooth.", "Spoon the mousse evenly into glass bowls and grate chocolate over each portion. Sprinkle with the chopped nuts and sea salt flakes to serve."]}, "Quick broccoli pasta": {"ingredients": ["150g/5½oz rigatoni or penne pasta", "3 spring onions", "1 garlic clove", "125g/4½oz cherry tomatoes", "150g/5½oz  broccoli", "1 tbsp vegetable oil", "pinch chilli flakes,  or to taste", "75g/2¾oz cream cheese", "salt and pepper"], "instructions": ["Bring a large pan of salted water to the boil, add the pasta and cook for 12 minutes. ", "Meanwhile slice the spring onions, peel and finely grate the garlic, halve the tomatoes and thinly slice the broccoli florets and stalks.", "Heat the oil in a large, deep frying pan. Add the spring onions and fry for 1 minute until soft. Add the garlic and chilli flakes and fry for 1 minute. Add the tomatoes, fry for a couple of minutes until they start to break down then add the broccoli. Fry for 2 minutes then add a ladle or small mug of the pasta water, give everything a stir and cover with a lid. Cook for 3-4 minutes until the broccoli is done, then remove the lid.", "Drain the pasta, add to the pan with the broccoli and stir to combine. Season with salt and pepper. Stir through the cream cheese and finish with plenty more black pepper."]}, "Quick eggs Benedict": {"ingredients": ["2 muffins", "4 free range eggs", "200g/7oz baby spinach leaves, wilted in a small pan", "Good-quality readymade hollandaise sauce"], "instructions": ["Fill a large, shallow pan with water, about 3cm (1in) deep and bring to a simmer. Add some vinegar (1-2 tablespoons per one litre of water) to help the eggs hold their shape.", "Break four eggs into separate coffee cups (this is also to help eggs maintain their shape when they're placed in the pan). Gently tip the eggs into the simmering water and poach for 2-3 minutes.", "Slice the muffins in half and lightly toast. ", "Once the eggs are poached, remove with a slotted spoon and drain on paper towels.", "Place the spinach on top of the muffins, top with the egg and spoon a generous amount of hollandaise sauce over the eggs.", "Serve at once."]}, "Quick canapé crostini": {"ingredients": ["1 baguette", "extra virgin olive oil", "1 garlic clove", "2 large ripe tomatoes", "extra virgin olive oil", "small handful basil and mint leaves", "pinch sugar (optional)", "salt and freshly ground black pepper", "100g/3½oz canned cannellini beans", "2 slices prosciutto", "small handful of wild rocket", "100g/3½oz rindless soft goats’ cheese", "2 fresh figs", "small handful of mint leaves", "1 tsp balsamic vinegar", "honey, for drizzling"], "instructions": ["Preheat the oven to 190C/375F/Gas 5. ", "Trim the ends of the baguette and cut it into diagonal slices about 2cm/1in thick. Place on a large baking sheet, drizzle with oil and bake for 7-8 minutes.", "For the tomato, basil and mint variation, roughly chop the tomatoes and place in a small bowl. Drizzle a little oil over, rip up the basil and mint leaves and add them along with salt, pepper and sugar to taste. Toss everything together.", "For the white bean variation, put the cannellini beans in a small bowl, add a good drizzle of oil, seasoning and then mash roughly with a fork. Cut the slices of prosciutto in half.", "Finally, for the goats’ cheese variation, mash the goats’ cheese with a fork in a small bowl and season, to taste with salt and freshly ground black pepper. Cut the figs into eight pieces. ", "Remove the crostini from the oven. They should be just crisp. Cut the garlic clove in half and rub the cut edge all over their tops.", "Now to assemble, simply spoon the tomato mixture onto eight of the crostini. ", "Arrange the rocket on eight more and dollop the mashed cannellini beans on top. Lightly scrunch the prosciutto up and arrange on top of each one. ", "Finally, spread the goats’ cheese over the remaining eight crostini, arrange a couple of pieces of fig on top of each, scatter the mint leaves over and drizzle with a little balsamic and honey.", "Arrange the crostini on a large serving platter or cake stand and serve."]}, "Quick apricot, apple and pecan loaf cake": {"ingredients": ["175g/6oz  ready-to-eat apricots, each chopped in half ", "175g/6oz cooking apple (1 medium apple), cut into 1cm/½in chunks with skins on ", "175g/6oz pecan nuts ", "pinch of salt ", "1½ level tsp baking powder ", "2 rounded tsp cinnamon ", "110g/4oz plain flour ", "110g/4oz wholewheat flour ", "110g/4oz butter, at room temperature ", "175g/6oz  soft brown sugar ", "2 eggs, beaten ", "3 tbsp milk ", "4 cubes demerara sugar, roughly crushed ", "¼ level tsp ground cinnamon"], "instructions": ["Preheat the oven to 180C/350F/Gas 4.", "When the oven has preheated, spread the nuts out on a baking sheet and toast them lightly for about 8 minutes, using a timer so that you don't forget them. ", "After that, remove them from the oven to a chopping board, let them cool a bit, then chop them roughly.", "Meanwhile, take a large mixing bowl, sift the salt, baking powder, cinnamon and both flours into it, holding the sieve up high to give the flour a good airing and adding the  bran from the sieve. Then simply add all the rest of the ingredients except the fruit and  nuts. ", "Take an electric hand whisk, begin to beat the mixture on a slow speed, then increase  the speed to mix everything thoroughly before folding in the apricot, apples and pecans.", "When it's all mixed add some more milk if necessary to give a mixture that drops easily  off a spoon, then pile the mixture into the tin, level the top, sprinkle on the crushed sugar cubes and cinnamon, and bake in the centre of the oven for 1¼-1½ hours or until the cake feels springy in the centre.", "After that remove it from the oven, let it cool for about 5 minutes in the tin, then turn it out on to a wire tray and let it get completely cold before transferring it to a  tin. The storage tin may not be needed if there are people around, as this loaf tends to  vanish very quickly."]}, "Quick chicken curry": {"ingredients": ["1 tbsp olive oil", "1 onion, chopped", "200g/7oz boneless chicken thighs, diced", "2 tsp medium curry powder", "pinch of chilli powder", "1 tsp turmeric", "150g/7oz frozen peas, defrosted under the tap", "140g/14oz brown basmati rice, cooked according to packet instructions", "mango chutney, to serve"], "instructions": ["Heat the oil in a pan and fry the onion for a few minutes, to soften. Add the chicken and fry until the chicken is browned all over.", "Add the curry powder, chilli powder and turmeric and stir to coat the chicken in the spices.", "Stir in the peas and 70ml/2½fl oz water. Reduce the heat and simmer gently for 10-12 minutes, or until the chicken is cooked through.", "Remove from the heat and serve with brown basmati rice and any pickles or chutneys you have to hand."]}, "Quick spiced lamb biryani": {"ingredients": ["2 tbsp vegetable oil", "½ onion, finely chopped", "½ tsp turmeric", "5 whole cardamom pods", "1 tsp cumin seeds", "½ tsp chilli flakes", "½ tsp ground cinnamon", "1 bay leaf", "300g/10½oz basmati rice, rinsed", "½ vegetable stock cube", "400ml/14fl oz boiling water", "200g/7oz lamb fillet, cubed", "1 handful fresh coriander leaves, to garnish"], "instructions": ["Heat one tablespoon of the oil in a pan and gently fry the onion for 3-4 minutes, until softened. Add the spices and bay leaf and fry for another 1-2 minutes. Stir in the rice, coating with the oil and spices.", "In a small bowl, dissolve the stock cube in the boiling water and pour into the pan with the rice. Stir once, cover with a lid and bring to a gentle simmer. ", "Heat the remaining oil in another pan and fry the lamb chunks for 1-2 minutes, or until golden-brown. Add to the rice, turn the heat down to low and cook, covered, for 10-12 minutes, until the rice is tender. ", "Pile the rice into a serving bowl and garnish with the coriander leaves."]}, "Quick chicken korma": {"ingredients": ["4 cm piece fresh ginger, peeled and coarsely chopped", "5-6 garlic cloves, peeled and coarsely chopped", "6 tbsp vegetable oil", "3 bay leaves", "5 cm cinnamon stick", "8 cardamom pods, crushed in a pestle and mortar", "4 cloves", "¼ tsp black cumin seeds (or regular cumin seeds)", "130g/4½oz onions, peeled and finely chopped", "1 tbsp ground coriander", "1 tbsp ground cumin", "3 tinned plum tomatoes, chopped", "1.5 kg/3lb 5oz chicken pieces, skinned and cut into serving portions", "¼ - 1 tsp chilli powder", "¼ tsp salt", "3 tbsp single cream", "250ml/8 ¾fl oz water"], "instructions": ["Put the ginger, garlic and 3 tbsp water in the container of an electric blender.  Blend until you have a smooth paste.", "Put the oil in a wide frying pan or saute pan and set over high heat. ", "When very hot, put in the bay leaves, cinnamon, cardamom pods, cloves and cumin seeds. Stir once or twice and put in the onions. ", "Stir and fry for about three minutes or until the onions turn brownish.  ", "Put in the paste from the blender, and the ground coriander and ground cumin and fry for a minute.  ", "Put in the chopped tomatoes and fry for another minute.  ", "Add in the chicken, chilli powder, salt and 250ml/8 ¾fl oz water. ", "Bring to a boil. Cover, turn the heat to medium and cook for 15 minutes, turning the chicken pieces over now and then.  ", "Remove the cover, add the cream and cook on high heat for another 7-8 minutes or until the sauce has thickened.  Stir gently as you do this."]}, "Quinoa and bulgur wheat salad with lemon and pomegranate": {"ingredients": ["150g/5½oz bulgur wheat", "150g/5½oz red quinoa, rinsed well and drained", "1 tbsp olive oil, for frying", "1 red onion, thinly sliced", "200g/7oz sun-blushed tomatoes in oil, drained and halved", "2 tbsp freshly chopped fresh mint leaves", "2 tbsp freshly chopped flatleaf parsley", "2 tbsp finely snipped chives", "1 tbsp torn fresh basil leaves", "100g/3½oz feta, broken into pieces", "50g/1¾oz pomegranate seeds, to garnish (optional)", "1 unwaxed lemon, finely grated zest and juice only", "2 tbsp pomegranate molasses ", "1 tsp sugar", "2 tbsp olive oil"], "instructions": ["Put the bulgar wheat and quinoa in a lidded saucepan and pour in 500ml/18fl oz water. Cover and bring to boil. Boil for 3–4 minutes – check the packet for instructions as cooking times can vary. Turn off the heat and leave for 20 minutes until cooked and the liquid is absorbed. Drain, if needed, and tip into a bowl.", "For the dressing, put the lemon zest and juice, pomegranate molasses, sugar and oil into a small bowl. Stir to combine.", "Heat a tablespoon of olive oil in a frying pan. Add the onion and fry for few minutes until nearly soft. Tip into the bowl with the bulgar wheat. Add the tomatoes and herbs. Season with salt and pepper and toss together. Add the dressing and mix. ", "Gently mix in the feta and pomegranate seeds. Check the seasoning and add more salt and pepper, if required. "]}, "Quiche Lorraine with Gruyère and chive flowers": {"ingredients": ["200g/7oz plain flour, sifted", "pinch of salt\u2028", "125g/4½oz chilled butter, cubed", "1 medium free-range egg, beaten", "1 tbsp olive oil", "175g/6oz streaky bacon, cut into 1cm/½in lardons", "100g/3½oz onions, chopped", "2 free-range eggs", "2 free-range egg yolks", "300ml/½ pint double cream", "1 tbsp chopped parsley\u2028", "2 tsp chopped chives", "1 tsp chopped thyme", "50g/2oz cheddar, grated", "50g/2oz Gruyère, grated", "salt and freshly ground black pepper", "small handful chive flowers, to garnish (optional)"], "instructions": ["For the pastry, place the flour, salt and butter in a food processor and pulse briefly. Add half of the beaten egg and continue to pulse. You might add a little more egg, but not too much as the mixture should be just moist enough to come together. ", "If making by hand, rub the butter into the flour until it resembles coarse breadcrumbs then, using your hands, add just enough beaten egg to bring it together. ", "With your hands, flatten out the ball of dough until it is about 2cm/¾in thick, then wrap in cling film or place in a plastic bag and leave in the fridge for at least 30 minutes or, if you are pushed for time, in the freezer for 10–15 minutes.", "Remove the pastry from the fridge and place between two sheets of cling film (larger in size than your tart tin). Using a rolling pin, roll the pastry out to no thicker than 5mm/¼in or even thinner for small tartlet tins. If the tin is round, make sure to keep the pastry in a round shape and also large enough to line the base and sides of the tin.", "Remove the cling film and place into a 18cm/7in quiche tin (with 3cm/1¼in high sides) If you wish, retain the top layer of cling film to help you shape the pastry. Press the pastry into the edges and, using your thumb, ‘cut’ the pastry along the edge of the tin for a neat finish. Remove the cling film, if used, prick over the base with a fork and chill the pastry in the fridge for 30 minutes or the freezer for 10 minutes. (Or cover it back up and keep in the freezer for a few weeks).", "Preheat the oven to 180C/350F/Gas 4.", "Line the pastry with foil, greaseproof or parchment paper, leaving plenty to come up the sides. Fill with baking beans or dried pulses. Place in the oven and bake for 15-20 minutes, or until the pastry feels dry.", "For the filling, heat the oil in a frying pan and cook the bacon until crisp. Remove and set aside to drain on kitchen paper. Fry the onions gently in the same oil for a further 10 minutes. Meanwhile, whisk the eggs in a medium-sized bowl, add the cream, herbs, cheeses and bacon and onions. Mix well and add salt and freshly ground black pepper.", "Remove the pastry from the oven and remove the paper and beans, pour the filling into the pastry base and return to the oven for 30-40 minutes, or until the centre has just set. Serve warm, garnished with chive flowers."]}, "Quick and easy sushi maki (sushi rolls)": {"ingredients": ["255g/9oz sushi rice", "55ml/2fl oz mirin", "340g/12oz sashimi quality tuna, cut into long thin strips", "5 sheets nori sushi sheets", "1 cucumber cut into 5 long pieces", "5 spring onions", "3 tsp wasabi paste", "light soy sauce", "Japanese pickled ginger"], "instructions": ["Rinse the rice very well under cold water. Drain thoroughly and put into a large saucepan that has a lid. Pour over 1 pint of water. Bring to the boil and allow to simmer for about 25 minutes or until nearly all the water has been absorbed. Remove from the heat, cover with a lid and allow to stand for 10 minutes.", "Then tip the rice onto a large flat clean tray. A metallic is probably best as it will help the rice cool down quicker. Dress the rice with the mirin, turning frequently as this helps the rice to cool. Then fan with a fan or a magazine until the rice is room temperature (not essential but quite authentic).", "To make the sushi take a Japanese bamboo sushi mat and place a sheet of seaweed on top. Have a small bowl of water to hand. Dip your fingers in the water before you touch the rice. Spread the rice over three quarters of the seaweed, take a little rice at a time and push it to the edges leaving a layer about ½ cm thick. Leave the quarter the furthest away from you plain. ", "Next smear a little wasabi in a line a little off centre nearest to your body. Follow with a layer of tuna, a spring onion and a piece of cucumber. Roll up the bamboo mat slowly, tucking in the closer end of the sushi roll to start a roll and press lightly with both hands. Remove the roll from the mat and leave to sit with the joining edges downwards. You can wrap in cling film and keep in a cool place until you are ready to serve. Don't place in the fridge as this dries out the rice.", "To serve, using a lightly moistened sharp knife to trim the ends, then cut into 6-8 pieces. Serve with the pickled ginger and little bowls of soy sauce."]}, "Quick beef massaman curry with coconut rice": {"ingredients": ["200g/7oz basmati rice ", "70g/2½oz butter ", "50g/1¾oz onion, finely chopped ", "400ml/14fl oz coconut milk ", "200ml/7fl oz full-fat milk ", "pinch salt", "1 lemongrass stalk, roughly chopped", "thumb-sized piece fresh root ginger, peeled and roughly chopped", "2 shallots, peeled and roughly chopped", "5 garlic cloves", "1 tsp dried chilli flakes", "1 tsp ground coriander", "½ tsp ground cumin", "2 tbsp fish sauce", "2 cardamom pods", "1 tsp brown sugar", "225g/8oz sirloin steak", "400ml/14fl oz coconut milk", "75g/2¾oz peanuts, toasted, to garnish", "fresh coriander sprigs, to garnish", "1 red chilli, sliced, to garnish", "1 lime, cut into wedges, to serve"], "instructions": ["To make the coconut rice, thoroughly wash and drain the rice. Melt 40g/1½oz of the butter in a saucepan until foaming. Fry the onion for 2–3 minutes, or until softened. Add the rice and stir until it is coated in the butter. Tip the rice mixture into a lidded ovenproof dish. Preheat the oven to 200C/180C Fan/Gas 6. ", "Bring the coconut milk and milk to the boil in a saucepan. Remove from the heat and pour over the rice. Stir well and season with the salt. ", "Cover with a lid and bake in the oven for 12–15 minutes, or until the rice has absorbed all of the liquid and is al dente. ", "To make the massaman paste, place all of the ingredients in a food processor or blender and blend until a smooth paste is formed.  ", "To make the curry, heat a frying pan over a high heat. Add the steak and fry for a couple of minutes on each side. Set aside to rest. ", "Place the paste in a saucepan over a medium heat. Sweat for a few minutes and then add half of the coconut milk. Stir to combine and add the rest of the coconut milk. Simmer for 5 minutes. ", "Slice the steak thinly. Add the steak to the coconut mixture and simmer for another 2 minutes.", "To finish the rice, cut up the remaining butter and dot over the rice. Cover with the lid and leave to melt for a few minutes before fluffing up the grains with a fork.", "Garnish the curry with toasted peanuts, coriander and chilli. Serve immediately alongside the coconut rice and lime wedges."]}, "Quick tomato soup": {"ingredients": ["2 cloves garlic, crushed ", "1 large onion, finely chopped ", "olive oil ", "1 tsp powdered cumin ", "2 tins(400g/14oz) chopped tomatoes ", "340g/12oz sweetcorn kernels, tinned or frozen ", "1L/1 ¾pt vegetable or chicken stock ", "2 tbsp tomato purée ", "fresh basil or coriander leaves ", "salt and black pepper"], "instructions": ["Sweat the garlic and onion in olive oil until soft and translucent. Add the cumin and cook for a minute or so before adding the tomatoes, sweetcorn, stock and tomato purée. Bring to the boil, then turn down the heat and allow to simmer for 15-20 minutes.", "The soup is good just as it is, rustic and chunky. If you prefer a smoother soup, just blend half of the mixture. Scatter with fresh herbs and serve with a drizzle of olive oil. Season well."]}, "Quick moussaka": {"ingredients": ["4 aubergines ", "olive oil", "1 onion, chopped", "2 cloves of garlic, crushed", "450g/1lb lamb mince", "3 plum tomatoes, diced", "pinch of cinnamon powder", "pinch of cumin powder", "1 glass of red wine ", "150ml/5fl oz chicken stock", "200ml/7fl oz white sauce", "2 eggs", "pinch of nutmeg", "100g/4oz grated cheese (half mozzarella, half cheddar)", "2 tbsp fresh mint, chopped", "salt", "freshly ground black pepper"], "instructions": ["Preheat the oven to 190C/170C Fan/Gas5. ", "Slice the aubergines then fry them on both sides in a large pan with a little olive oil. Drain on kitchen paper. To save on washing up, use the same pan with a little more olive oil and fry off the onions and garlic. ", "After five minutes turn the heat up and add the lamb to brown it, then add the tomatoes. Add a good pinch of cumin and cinnamon with the wine and sauté together to break up the tomatoes. Add the chopped mint and the stock in stages.", "In an ovenproof dish, layer the aubergines and lamb mince in a few layers, finishing with a layer of aubergines.", "Combine the white sauce with the eggs, nutmeg and seasoning. Spoon over the top of the mince and then scatter with the grated cheese. ", "Bake in the oven 20-25minutes to colour the cheese and cook through.", "Serve."]}, "Quick Bombay potatoes": {"ingredients": ["3 tbsp sunflower oil", "1 tsp mustard seeds", "½ tsp ground cumin", "1 tsp turmeric", "1 tsp ground coriander", "1 tsp garam masala", "1 tsp chili powder", "5cm/2in piece fresh ginger, grated", "1kg/2lb 3oz potatoes, peeled, and cut into smallish cubes", "350ml/12fl oz vegetable stock", "4 tomatoes, roughly chopped", "1 bunch coriander, roughly chopped"], "instructions": ["Heat a wok until hot and add the oil.", "Add all the spices and the ginger and stir-fry for one minute until fragrant. ", "Add the potatoes and stir to coat in the spices. ", "Add the stock and bring to a gentle simmer. Simmer for 10-15 minutes until the potatoes are tender.", "Stir in the tomatoes and coriander.", "Season with salt and freshly ground black pepper and serve."]}, "Quick chicken stew": {"ingredients": ["1 tbsp light olive oil", "1 onion, roughly chopped", "2 garlic cloves, finely chopped", "8 chicken thighs, boneless, skin removed, cut into bite-sized pieces", "700ml/1¼ pint chicken stock", "2 level tbsp plain flour", "1 level tbsp wholegrain mustard", "1 star anise (optional)", "1 cinnamon stick", "2 celery sticks, sliced", "2 large carrots, peeled and cut into 1.5cm/½in cubes", "300g/10½oz small new potatoes, scrubbed and halved", "200g/7oz frozen soya beans (edamame), defrosted", "2 tbsp finely chopped fresh tarragon", "salt and freshly ground black pepper"], "instructions": ["Heat the oil in a wide frying pan over a medium heat. Add the onion, garlic and chicken and stir-fry for 2–3 minutes.", "Meanwhile, pour the stock into a saucepan and bring to the boil.", "Stir the flour into the chicken and gradually add the hot stock. Stir in the mustard, star anise, cinnamon, celery, carrots and potatoes. Bring to the boil, cover and reduce the heat to medium. Cook for 15–20 minutes.", "Uncover, increase the heat, and cook for 5 minutes, or until the chicken is cooked through and the vegetables are tender.", "Stir in the soya beans and cook for 2–3 minutes. Season well and stir in the tarragon. Serve immediately in four warm bowls."]}, "Quick curry sauce": {"ingredients": ["2 tbsp sunflower or vegetable oil", "3 garlic cloves, peeled and finely grated ", "20g/¾oz fresh root ginger, peeled and finely grated", "2 tsp curry powder (any kind)", "¼–½ tsp dried chilli flakes or 1 finely sliced fresh chilli", "1½ tbsp tomato purée", "1 tbsp caster sugar", "½ tsp flaked sea salt or ¼ tsp fine salt ", "100ml/3½fl oz double cream", "freshly ground black pepper"], "instructions": ["Heat the oil in a non-stick frying pan and very gently fry the garlic and ginger for about a minute, stirring constantly. Don’t allow them to brown.", "Stir in the curry powder, chilli and tomato purée and cook for 1 minute, stirring constantly until the tomato purée looks glossy. ", "Add the sugar, salt and plenty of pepper, then stir in 150ml/¼ pint water and the cream. Bring to a simmer and cook for 2–3 minutes, stirring constantly. Set aside.", "Stir-fry your choice of other ingredients (such as strips of chicken or meat, prawns, vegetables) in a large frying pan or wok until cooked through.", "Pour the curry sauce over the cooked meat or veg and return to a simmer. Cook for 1–2 minutes more, or until hot throughout. Add an extra splash of water if needed. Serve with freshly cooked rice or naan bread."]}, "Quick pineapple cheesecake ": {"ingredients": ["3 ginger biscuits", "1 tbsp butter", "5 tbsp full-fat cream cheese", "2 tbsp double cream or coconut cream", "2 tbsp icing sugar or caster sugar", "½ lime, zest and juice ", "½ 230g tin pineapple chunks or 1-2 pineapple rings in juice, cut into 8 small wedges"], "instructions": ["Put the biscuits in a small, reusable freezer bag and bash gently with the bottom of a saucepan or rolling pin, to make fine crumbs. ", "Melt the butter in a small saucepan or microwave and stir in the biscuit crumbs.", "Spoon the buttered crumbs into the base of a glass tumbler. Use the back of a spoon to press down lightly. ", "Put the cream cheese, double cream, sugar, lime zest and juice in a bowl. Add 2 teaspoons of the pineapple juice from the can and whisk until thickened. ", "Spoon the creamy filling onto the biscuit base. Top with the pineapple chunks then place in the fridge for 30 minutes. Decorate with extra lime zest if you like. "]}, "Quick hummus": {"ingredients": ["200g/7oz canned chickpeas", "2 tbsp lemon juice or more", "2 garlic cloves, crushed", "1 tsp ground cumin", "pinch salt", "1 tbsp tahini (sesame seed paste) ", "4 tbsp water", "2 tbsp extra virgin olive oil", "1 tsp paprika", "4 rounds of pitta bread"], "instructions": ["Drain the chickpeas and rinse. Reserve a few whole chick peas for serving.", "Combine the chickpeas, lemon juice, garlic, cumin, salt, tahini, and water in a food processor, and blend to a creamy purée.", "Add more lemon juice, garlic, cumin or salt to taste. Turn out into a dinner plate, and make smooth with the back of a spoon. Drizzle with extra virgin olive oil and scatter with the reserved chickpeas. ", "Sprinkle with paprika and serve with pita bread, warmed in a moderate oven for three minutes, and cut into quarters."]}, "Quinoa and halloumi burger": {"ingredients": ["250g/9oz quinoa ", "250ml/9fl oz vegetable stock or water", "2 free-range eggs, beaten", "3 tbsp gram flour", "3 tsp dried oregano or thyme", "½ tsp chilli flakes (or chopped fresh chilli, to taste)", "3 garlic cloves, crushed", "5 spring onions, trimmed and finely sliced", "225g/8oz halloumi, diced", "1 tbsp ghee, for frying", "salt and freshly ground black pepper"], "instructions": ["Put the quinoa in a bowl and cover with approximately 500ml/18fl oz cold water. Add a pinch of salt. Set aside to soak overnight (or for at least 8 hours). Drain well.", "Bring the stock  to the boil in a large saucepan. Add the quinoa, stir once, then simmer for 10-12 minutes, or until tender. Remove from the heat and drain well. Set aside to cool.", "Preheat the oven to 190C/170C Fan/Gas 5.", "In a large mixing bowl, beat together the eggs, gram flour, herbs, chilli, and garlic until smooth and well combined. Stir in the spring onions, halloumi and quinoa. Season with salt and pepper. Add a little more gram flour or water if needed.         ", "Shape the burger mixture into 16 equal-shaped patties in your hands. ", "Heat the ghee in a large frying pan over a medium-high heat. When the fat is smoking, add the burger patties, shape with a spoon in the pan. You may need to do this in batches. Fry for 3-4 minutes, or until a golden-brown crust forms, then gently flip with a spatula and fry the other side.", "Transfer the fried burgers to a roasting tray. When all of the burgers have been fried, cook them in the oven for a further 12-15 minutes, or until cooked through. ", "Serve with a green salad with red onion and avocado."]}, "Quinoa salad with mint and mango": {"ingredients": ["110g/4oz quinoa, cooked according to packet instructions", "1 tbsp chopped fresh mint", "4 spring onions, including the green parts, chopped", "2 tbsp chopped fresh coriander", "1 mango, peeled, finely chopped", "2 tbsp olive oil", "½ lemon, juice only"], "instructions": ["Combine all the ingredients in a bowl and mix together. ", "Serve with grilled halloumi, chicken, fish or any leftover meats."]}, "Quick tiramisu": {"ingredients": ["3 espresso cups of strong black coffee, preferably espresso, cooled ", "3 tbsp caster sugar", "6 tbsp Amaretto liqueur", "2 eggs, separated", "250g/8¾oz mascarpone cheese", "250ml/8¾ fl oz whipped cream", "cocoa powder, to dust", "1 packet of Savoiardi (sponge lady finger biscuits)"], "instructions": ["Place the cold coffee in a bowl, add three tablespoons of the Amaretto and put to one side.", "In a separate bowl beat together the egg yolks and sugar for about three minutes until thick and pale. ", "Add the mascarpone and beat until well mixed. Fold in the whipped cream gently with a metal spoon.", "In a separate bowl, beat the egg whites until soft peaks form.  Fold the egg whites quickly but gently into the cream mixture. Add the remaining liqueur, taking care not to loose the volume.", "Dip each biscuit into the coffee liqueur mixture for about two seconds on each side and shake of the excess.", "Cover the bottom of an eight individual 8cm/3in dessert glasses. Spread some of the cream mixture over the biscuits and then repeat the process again, using up the biscuits and finishing with a cream layer.", "Smooth the surface and dust the top with the cocoa powder.  ", "Refrigerate for about two hours or until firm. The longer it is left, the more the flavours will develop."]}, "Quick veggie korma": {"ingredients": ["3 medium onions", "3 cloves of garlic", "a thick slice of butter", "a thumb-sized piece of ginger", "10 green cardamom pods", "a tsp ground cumin", "½ tsp ground turmeric", "a couple of pinches of ground cinnamon ", "a cinnamon stick", "a good pinch of ground chilli ", "3 bay leaves", "650g/1lb 7oz assorted mushrooms", "250g/9oz spinach", "handful skinned hazelnuts", "a generous handful of raisins or golden sultanas", "200g/7oz plain yoghurt", "150g/5oz crème fraîche ", "rice or bread, to serve"], "instructions": ["Peel and slice the onions and garlic. Melt most of the thick slice of butter in a deep-sided pan, reserving a little. Peel and grate the ginger and add to the pan with the onions and garlic. ", "Break open the cardamom pods, discard the green shells and lightly crush the black seeds within. A pestle and mortar is good for this but any heavy weight will do. Add the crushed seeds to the pan with the cumin, turmeric, ground cinnamon, cinnamon stick, chilli and the bay leaves. ", "Cut the mushrooms into large pieces and add to the pan together with the remaining butter (you will find the mushrooms tend to soak it up).  Let the mushrooms cook for a couple of minutes, then stir and cover with a lid. ", "When the mushrooms have softened and darkened a little, add 200ml/7fl oz water. Stir, cover and simmer for 15 minutes. ", "Meanwhile, wash the spinach carefully. Cook briefly in a separate pan until the leaves have wilted but are still bright, about a minute or two. Remove the spinach and cool under running water to keep the colour bright then squeeze dry and add to the pan with the mushrooms. ", "Stir in the skinned hazelnuts and the raisins or sultanas. Gently stir in the yoghurt and crème fraîche. Warm through gently and serve, with rice or bread if you wish."]}, "Quick leek and potato soup": {"ingredients": ["1 tbsp olive oil", "½ potato, peeled and diced", "1 garlic clove, peeled and diced", "1 leek, diced", "55ml/2fl oz white wine", "150ml/5fl oz vegetable stock", "55ml/2fl oz double cream ", "salt and freshly ground black pepper", "1 slice of bread", "35g/1½oz blue cheese"], "instructions": ["Heat the oil in a saucepan and fry the potato and garlic for 3-4 minutes, to soften. ", "Add the leeks and cook for a further few minutes.", "Stir in the wine with the stock and cream then reduce the heat and simmer gently for 10-12 minutes, or until the potatoes are tender.", "Using a hand blender, blend the soup until smooth and season to taste. ", "To serve, toast the bread on one side, under a hot grill, until golden. Turn over and lay the blue cheese on top. Return to the grill and cook until melted and golden.", "Serve the cheese toast on top of the soup."]}, "Quick sausage Bolognese": {"ingredients": ["4–6 good-quality sausages (300–400g/10½–14oz)", "1 tbsp olive oil", "1 small onion, finely chopped", "½–1 tsp dried chilli flakes, according to taste", "400g/14oz tin chopped tomatoes", "2 tbsp tomato purée", "150ml/5fl oz red wine or water", "½ tsp dried oregano", "275g/9¾oz dried tagliatelle or spaghetti", "grated Parmesan, to serve ", "fresh basil leaves, to serve "], "instructions": ["Squeeze the sausagemeat out of the skins into a large non-stick frying pan. Add the oil and onion and cook over a medium heat for 10 minutes, or until lightly browned. Use two wooden spoons to break up the sausagemeat into small mince-like pieces as it cooks. Add the chilli flakes and cook for 1 minute more, stirring. ", "Add the tomatoes, tomato purée, red wine (or water) and oregano. Bring to a gentle simmer and cook for 8–10 minutes, or until the sauce has thickened, stirring regularly. ", "Fill a large saucepan with water and bring to the boil. Add the pasta to the water and cook for 7–9 minutes (or according to the pack instructions) until tender, stirring occasionally to separate the strands. ", "Drain the cooked pasta in a colander and return to the saucepan. Tip the spicy sausage sauce into the same pan and toss well together. Serve topped with grated Parmesan and scattered with torn basil leaves."]}, "Quick flatbreads": {"ingredients": ["200g/7oz plain or wholemeal flour", "¼ tsp salt", "100ml/3½fl oz warm water", "2 tbsp oil (olive, sunflower or vegetable), plus extra for cooking"], "instructions": ["Kid’s job: Place the flour and salt in a large bowl and trickle on the water bit by bit.", "Kid’s job: Mix the water and flour mixture together. Kids can mix using one finger so that they don’t get a whole hand covered in dough. Doughy hands can be cleaned by rubbing a little more flour onto the hands over another bowl or the bin – resist the urge to wash doughy hands as you will block the drain!", "Kid’s job: Add the oil and knead the dough – you are aiming for a soft dough. If it is too sticky, add a little more flour or if it is too dry, add a splash of water. ", "Kid’s job: Knead the dough for 5 minutes – kids can do this in the bowl or on a clean surface using one or two hands.", "You can cook the breads straight away or leave the dough to stand for about 30 minutes. This is a good time to make a quick filling such as a grated salad or dip. Divide the dough into four balls (or six if you have a smaller frying pan).", "Kid’s job: On a clean surface, roll each ball of dough one at a time using a rolling pin. If you pick up and move round the flatbread often you know it hasn’t stuck. (You may need to sprinkle a little flour on the surface but only use a little as too much will dry out the dough.) Don’t worry if they aren’t perfect circles!", "Adult’s job: Heat a large frying pan. Take a sheet of kitchen paper and rub a little oil onto the surface of the pan. Cook each flatbread for about 2 minutes on one side – it should puff up a little. Flip the flatbread over using tongs and then cook for a couple of minutes on the other side. The flatbread should have turned lighter in colour and may have a few spots of brown. Keep the cooked flatbreads warm, wrapped in foil or a clean teatowel, until the others are cooked.", "If you want crisp flatbreads rub them with a little olive oil, chop into strips or triangles with scissors and then ask an adult to fry them for 5–10 minutes, or until crisp. "]}, "Qalb el louz (heart of almonds)": {"ingredients": ["125g/4½oz unsalted butter, melted, plus extra for greasing", "500g/17½oz coarse semolina", "200g/7oz caster sugar", "pinch salt", "4 tbsp orange blossom water", "½ tsp vanilla extract", "130g/4½oz ground almonds", "1 tbsp unsalted butter, melted", "1 tsp ground cinnamon", "300g/10½oz caster sugar", "½ tsp vanilla extract", "4 tbsp runny honey", "60ml/2oz orange blossom water", "9 almonds (skin on)", "100g/3½oz butter, melted"], "instructions": ["To make the semolina layer, stir the melted butter into the semolina, sugar and salt. Mix in the orange blossom water and vanilla essence. Cover and refrigerate overnight.", "Preheat the oven to 190C/170C Fan/Gas 5. Grease a 8in/20cm square loose-bottomed cake tin.", "To make the almond layer, mix the ingredients together in a bowl and set aside.", "Break the cold semolina mix up with your hands until it resembles breadcrumbs. Gradually mix in 60ml/2oz water until well distributed.", "Sprinkle thin layers of the semolina mix followed by the almond mix until it has been used up. Smooth the top with a spatula or spoon. Using a sharp knife, cut the cake into 9 squares (don’t let the knife cut the bottom layer). Place an almond on top of each slice. Brush the melted butter on top of the cake. Bake for 1 hour or until a dark golden-brown.", "Meanwhile, to make the syrup, place all the ingredients into a large saucepan with 1 litre/1¾ pints water and bring to the boil. Stir until the sugar dissolves then reduce the heat to low and simmer for 10 minutes. Set aside to cool completely.", "Slice the cake into 9 squares, following the lines you made before baking. Carefully drizzle over the cooled syrup (you can always save a bit for serving, if it looks like too much). Refrigerate overnight before serving."]}, "Quick blueberry muesli crumble": {"ingredients": ["100g/3½oz caster sugar", "½ cinnamon stick", "640g/1 lb 6½oz fresh blueberries", "1 tbsp unsalted butter", "125ml/4¼fl oz peach liqueur", "50g/1¼oz muesli", "70g/2½oz plain flour", "85g/3oz light brown sugar", "100g/3½oz unsalted butter, cut into cubes", "1 tsp clear honey ", "1 tbsp mascarpone"], "instructions": ["For the filling, heat the sugar, cinnamon stick, blueberries and butter in a pan, stirring continuously, until the mixture is simmering. Continue to simmer for 3-4 minutes, or until the sugar has melted and has turned golden-brown in places and the blueberries have broken down. ", "Add the peach liqueur and bring to the boil for one minute, stirring well. Remove the pan from the heat and set aside. ", "For the crumble topping, place the muesli, flour, brown sugar and butter into a large mixing bowl. Rub together using your fingertips until the mixture resembles breadcrumbs. ", "Transfer the crumble mixture to a dry frying pan and toast over a medium heat until golden-brown. ", "For the honeyed mascarpone, mix together the honey and mascarpone until smooth and well combined. ", "To serve, divide the filling mixture equally among two ramekins. Sprinkle over the crumble topping. Place the ramekins onto serving plates and spoon the honeyed mascarpone alongside."]}, "Quick pan-fried halibut": {"ingredients": ["½ tsp ground turmeric ", "¼ tsp red chilli powder", "1 tsp ground coriander", "pinch carom seeds (ajwain seeds), available in Asian stores and some supermarkets", "¼ tsp salt, or to taste", "2 halibut steaks", "½ tsp grated ginger", "½ tsp crushed garlic", "2 tbsp vegetable oil", "2 tsp flour", "lemon juice, to serve"], "instructions": ["Sprinkle all the spices and seasoning over the fish, then rub in the ginger and garlic and one teaspoon of the oil.", "Heat the remaining oil in a large frying pan over a medium-high heat. Dust the fish with the flour on both sides. Place the fish into the pan, reduce the heat slightly and fry for four minutes. Turn over and fry for another 3-4 minutes, or until cooked through and crisp.", "To serve, place the fish onto serving plates and squeeze over some lemon juice."]}, "Quick tomato sauce": {"ingredients": ["300g/10½oz cherry tomatoes", "2 tsp caster sugar", "salt and freshly ground black pepper, to taste", "25ml/1fl oz olive oil"], "instructions": ["Whizz together the cherry tomatoes, caster sugar and seasoning in a food processor. ", "Slowly add the olive oil until all the ingredients are combined. Check the seasoning, and serve."]}, "Quick bagna cauda (anchovy dip)": {"ingredients": ["125ml/4fl oz extra virgin olive oil", "4-5 cloves of garlic, peeled and crushed", "12 anchovies preserved in olive oil, drained and chopped", "120g/4oz unsalted butter, cut into cubes", "Selection of raw vegetables such as fennel, cauliflower, endive, celery, peppers and courgettes, cut into bite-sized pieces"], "instructions": ["Put the olive oil in a pan with the garlic and anchovies and stir over a low heat for a few minutes.", "Whisk in 90g of the butter, and as soon as it has melted, remove from the heat and whisk a few more times so that everything is creamy and amalgamated.", "Taste, and if you feel you want this dipping sauce, which is meant to be pungent but not acrid, a little more mellow, then whisk in two more tablespoons of butter.", "Pour into a fondue dish over a flame or just serve in a very warm bowl.", "Serve with the vegetable crudités for dipping."]}, "Quick-fix omelette": {"ingredients": ["2-3 new potatoes, halved ", "1 tsp cooking oil or butter", "2 free-range eggs, beaten", "1 or 2 small mushrooms, sliced ", "½ small red pepper, chopped ", "a little grated cheddar", "side salad of your choice, to serve"], "instructions": ["Boil the potatoes for about 10 minutes, or until slightly soft ", "Heat the oil in a frying pan. Once hot, add the cooked potatoes, mushrooms and peppers (or other vegetables of your choice). Once the vegetables are soft and slightly browned, transfer to a bowl. ", "Add the beaten eggs to the pan. When the eggs have set slightly, return the vegetable mixture to the pan. Sprinkle some cheese on top", "Flip the omelette to cook the other side, or fold the omelette in half. Serve with salad."]}, "Quickalilli": {"ingredients": ["1kg/2lb 4oz fruit and veg, include 5-6 types, such as radish pods, cucumber, courgette, nasturtium seeds, peppers, shallots or small onions, cauliflower, albino beetroot, French beans or runner beans", "salt, to taste", "600ml/20fl oz cider vinegar", "150g/5½oz caster sugar", "2 tsp ground turmeric", "40g/1½oz grated fresh root ginger", "3 tsp mustard seeds", "1 tsp cumin seeds", "1 tsp coriander seeds", "30g/1oz cornflour", "2 tsp English mustard powder"], "instructions": ["Break or cut up the veg and fruit, peel and deseed if necessary. Rinse under a tap and place in a colander set over a bowl. Sprinkle with salt and leave, covered, for 24 hours in a dark place.", "Bring the vinegar and sugar to the boil in a preserving pan.", "Crush the turmeric, ginger, mustard seeds, cumin seeds and coriander seeds in a pestle and mortar. Add the cornflour and mustard powder and a little of the heated vinegar and mix to form a paste.", "Add the paste to the simmering vinegar and continue to cook for five minutes. Add all the vegetables and fruit and put in sterilised jars."]}, "Quinoa with leeks and pepper": {"ingredients": ["1 tbsp olive oil", "½ red romero pepper, chopped", "½ leek, chopped", "1 garlic clove, chopped", "100g/3½oz quinoa, cooked according to packet instructions", "splash double cream", "55g/2oz goats' cheese", "salt and freshly ground black pepper", "Greek yoghurt, to serve"], "instructions": ["Heat the oil in a pan over a medium heat. Add the romero pepper and leeks and sauté for 3 minutes, to soften.", "Add the garlic and cook for another minute.", "Stir in the cooked quinoa and the cream and heat through.", "Crumble in the goats' cheese and season to taste with salt and freshly ground black pepper.", "To serve, spoon onto serving plates and add a dollop of Greek yoghurt."]}, "Quick chicken stir-fry": {"ingredients": ["1 tbsp vegetable oil", "1 spring onion, finely chopped", "1 bird's-eye chilli, seeds removed, finely chopped", "2 chicken mini-fillets, chopped into bite-sized pieces", "45g/1½oz frozen soya beans", "200g/7oz ready-cooked noodles ", "2 tsp soy sauce", "½ orange, juice only", "1 tsp sesame seeds", "1 tbsp chopped fresh mint"], "instructions": ["Heat the oil in a wok. Add the spring onion, bird's-eye chilli, chicken and soya beans to the wok and stir fry for three minutes.", "Add the noodles, soy sauce and orange juice to the wok and stir fry for a further 2-3 minutes, or until the chicken is cooked through.", "To serve, stir the sesame seeds and mint through the noodles and pile onto a plate."]}, "Quick prawn cocktail with avocado": {"ingredients": ["1 lemon, juice only", "3 king prawns, peeled and de-veined", "1 tbsp tomato ketchup", "¼ tsp Tabasco sauce", "2 tbsp Greek yoghurt", "½ lime, juice only", "½ avocado, stone removed", "1 sprig fresh dill, to garnish"], "instructions": ["Fill a small saucepan with water and bring it to a simmer.", "Add half of the lemon juice and the three king prawns and reduce to a low simmer. ", "Poach the prawns for three minutes or until cooked all the way through. Remove the pan from the heat and leave to cool. ", "In a small bowl, mix the remaining lemon juice, tomato ketchup, Tabasco sauce, Greek yoghurt and lime juice until well combined.", "When the prawns are cool, drain them and chop roughly. Stir the chopped prawns into the yoghurt mixture.", "Spoon the prawn and yoghurt mixture into the cavity of the avocado.", "Serve straightaway, garnished with fresh dill."]}, "Quail mulligatawny": {"ingredients": ["300ml/10fl oz chicken stock", "1 tbsp fresh thyme leaves", "1 garlic clove, chopped", "4 whole quail", "2 tbsp vegetable oil", "25g/1oz butter", "salt and freshly ground black pepper", "2 onions, peeled and chopped", "1 Granny Smith apple, peeled and grated", "2 tbsp mild curry powder", "2 tbsp plain flour", "400ml/14fl oz tin coconut milk", "25g/1oz sweet potato, peeled and cut into 1cm/½in dice ", "50g/1¾oz red lentils, cooked", "4 onion rings, breadcrumbed and deep-fried, for garnish", "1 small bunch fresh coriander, leaves chopped"], "instructions": ["For the quail, place the chicken stock, thyme and garlic into a pan over a medium heat and bring to a simmer. Add the quail and simmer for 2-3 minutes. ", "Remove the quail with a slotted spoon and drain on kitchen paper, reserving the stock for the soup.", "When cool enough to handle, use a sharp knife to carefully cut the whole quail breasts away from the bone and then cut the legs away from the body.", "Heat a frying pan until hot and then add the oil and butter. When it begins to foam, season the quail breasts and legs with salt and freshly ground black pepper and place them, skin-side down, in the pan. Fry the quail for 3-5 minutes, or until there is moderate resistance when the thickest part of the breast is squeezed and the legs are crisp and golden-brown. ", "Remove the meat from the pan and leave to rest in a warm place for five minutes.", "Meanwhile, melt the remaining butter in a pan and add the onions, apple and a pinch of salt. Cook for 3-4 minutes, or until the onions are soft but not brown, then add the curry powder and flour and cook for two more minutes, stirring frequently. ", "Deglaze the pan with the reserved stock, scraping the bottom of the pan with a wooden spoon to remove the sediment. Simmer for two minutes and then pass through a fine sieve into a clean saucepan.  ", "Add the coconut milk and sweet potato to the pan and simmer for about ten minutes or until the sweet potato is cooked and the soup is thick. Add the cooked lentils, season to taste with salt and freshly ground black pepper and heat through. ", "To serve, spoon the lentils and sweet potato into each dish. Place the quail legs on top followed by the quail breasts, then pour over the soup and garnish with the deep fried onion rings and chopped coriander."]}, "Quiche Lorraine with a fennel and orange salad": {"ingredients": ["200g/7oz plain flour", "100g/3½oz unsalted butter, cold and diced", "1 free-range egg yolk", "pinch of salt", "175g/6oz pancetta, diced", "50g/1¾oz unsalted butter", "1 large onion, thinly sliced ", "4 free-range eggs", "2 free-range egg yolks", "350ml/12fl oz double cream", "175g/6oz Gruyère cheese, grated", "salt and freshly ground black pepper", "1 fennel bulb, thinly sliced and put in ice water", "1 orange, segmented (keep the juice for the dressing)", "1 tbsp olive oil"], "instructions": ["Preheat the oven to 180C/160C Fan/Gas 4. Sieve the flour into a large bowl, then mix in a pinch of salt. Rub in the butter until the mixture resembles breadcrumbs. Add enough cold water to bring everything together into a ball. Wrap in cling film and refrigerate for 30 minutes.", "Remove the pastry from the fridge and roll it out into a circle on a lightly floured surface to line a 22cm/8½in loose-bottomed flan tin. Line the tin with the pastry, then line the pastry with greaseproof paper and fill with uncooked rice or baking beans. Bake for 20 minutes. Remove the rice or beans and brush the tart with egg yolk, then bake for another 5-10 minutes. Leave to cool, then trim the edges.", "Meanwhile, for the filling, heat a frying pan over a medium heat. Fry the pancetta until crispy, then drain on kitchen paper.", "Melt the butter in another frying pan, then gently fry the onion until soft. Put the eggs, yolks and cream in a large bowl, season with salt and pepper and whisk.", "Put half the pancetta, onions and Gruyère in the pastry case, then pour over the cream mixture. Top with the remaining pancetta, onions and cheese and bake for 30-40 minutes, or until set in the centre.", "For the salad, put the fennel and orange segments into a large bowl. Put the oil and orange juice in a small glass bowl, season with salt and pepper and whisk. Pour the dressing over the salad just before serving with the quiche. "]}, "Quail with chestnuts and butternut squash": {"ingredients": ["160g/5¾oz sea salt", "80g/2¾oz caster sugar", "1 sprig rosemary", "2 sprigs thyme", "1 orange, peeled", "1 cinnamon stick", "2 star Anise", "2 cloves", "1-2 small quail ", "1 tbsp olive oil", "salt and freshly ground black pepper", "½ small red onion, finely chopped", "9 fresh chestnuts in shells, roasted, peeled and roughly chopped (reserve 4 to finely chop for the garnish)", "1 tbsp dried cranberries ", "1 tbsp roughly shredded flatleaf parsley", "100g/3½oz butternut squash, peeled and julienned ", "1 tsp wholegrain mustard", "1 tbsp white wine vinegar ", "1 tsp honey", "1 tbsp olive oil", "½ tbsp hazelnut oil", "50g/1¾oz unsalted butter"], "instructions": ["Bring 500ml/18fl oz water and the brine ingredients to the boil then remove from the heat and cool.", "Spatchcock the quail by cutting up the back with a pair of scissors. Place in a bowl and cover with the cooled brine and chill for 30 minutes in the fridge. ", "Remove the quail from the brine and pat dry. Season with the oil and a little salt and pepper.", "Place a large griddle pan over a hih heat. Once hot, cook the quail skin side down for 3½ minutes, then 3½ minutes on the other side. (The quail will still have some pink parts when done.)", "For the salad, mix all of the salad ingredients, except the butternut squash. Set aside. ", "For the dressing, whisk all the dressing ingredients in a small bowl. Put the butternut squash in the dressing for 5 minutes to soften. Just before serving add the dressing to the salad. ", "Heat the oil in a frying pan with the finely chopped chestnuts. Cook for 1-2 minutes.", "Place the quail on serving plates and drizzle over the chopped chestnuts. Serve the salad alongside. "]}, "Quail marinated in plum wine, barley miso and ginger": {"ingredients": ["200ml/7fl oz plum wine", "3 tsp barley miso (available from larger supermarkets and Asian supermarkets)", "4 tsp umeboshi paste (available from Asian supermarkets)", "5 tsp soy sauce", "4 tsp sesame oil", "2 tsp grated fresh ginger", "1 tsp finely chopped garlic", "2 quails, de-boned and cut in half, leaving breast and thigh together", "¼ daikon, very finely sliced into sticks (julienne) and placed in iced water", "4 large shiso leaves", "1 sharon fruit, cut into 1cm/½in cubes or balls", "1 mango, cut into 1cm/½in cubes or balls", "pinch sancho pepper", "pinch sea salt flakes"], "instructions": ["For the marinade, place all of the ingredients except the quail into a bowl and whisk together to combine. Set one quarter of the marinade mixture aside in a bowl to dress the salad later.", "For the quail, place the quail into the main batch of marinade, cover and allow to marinate for 30 minutes.", "Heat a griddle pan until smoking. Add the marinated quail and griddle for 3-4 minutes on each side, basting regularly with the marinade, or until completely cooked through.", "To serve, arrange the drained daikon sticks into four bundles and place onto two plates. Place a shiso leaf on top of each bundle.", "Cut each quail half into two pieces, then place a piece of quail onto each diakon bundle.", "Place the sharon fruit and mango into the reserved dressing (do not use the mixture used to marinate the quail for this step) and mix well to coat. Spoon the dressed fruit over the top of quail pieces. Season with a pinch of the sancho pepper and sea salt."]}, "Queen of puddings": {"ingredients": ["butter, for greasing", "75g/2½oz slightly stale white breadcrumbs", "600ml/1 pint whole milk", "1 vanilla pod, split in half lengthways and seeds scraped out", "50g/1¾oz caster sugar", "1 large free-range egg", "2 large free-range egg yolks", "100g/3½oz raspberry jam", "4 large free-range egg whites", "150g/5½oz caster sugar"], "instructions": ["Preheat your oven to 180C/350F/Gas 4. Butter six ramekins or individual heatproof glass dishes, 10cm/4in in diameter.", "Divide the breadcrumbs between the ramekins, scattering them evenly.", "Put the milk in a saucepan. Add both the vanilla seeds and pod to the saucepan. Slowly bring the milk just to the boil, then remove from the heat.", "Whisk the sugar, egg and egg yolks together in a bowl. Pour on the hot milk and whisk well. Strain this into a jug.", "Pour the custard into the prepared dishes, dividing it equally.", "Stand the dishes in a large roasting dish. Pour enough hot water into the roasting tin to come about halfway up the sides of the ramekins. Bake in the oven for 25–30 minutes, or until the custards are set. Remove from the roasting tin and allow to cool. Discard the hot water. Return the ramekins to the emptied out roasting tin.", "If your jam is very stiff, beat it to soften, or heat it slightly. When the custards are cool, spread the jam over them.", "For the meringue topping, whisk the egg whites with an electric whisk, or using a freestanding mixer with a whisk attachment, until they hold stiff peaks when the whisk is removed. Beat in the sugar a spoonful at a time, until you have a fluffy meringue that holds stiff peaks when the whisk is removed.", "Spoon the meringue into a piping bag fitted with a 1cm/½in nozzle and pipe it on top of the jam-topped custards. Bake for 10–15 minutes, until the meringue is light golden-brown. Serve immediately."]}, "Quesadillas with cheese, tomatoes and chives": {"ingredients": ["8 cherry tomatoes, cut into quarters", "½ tsp caster sugar", "¼ onion, finely chopped", "3 tbsp olive oil", "½ orange, zest only", "½ lime, zest and juice only", "1 tbsp chopped fresh coriander", "3 ready-made flour tortillas", "100g/3½oz mature cheddar, grated"], "instructions": ["Preheat the oven to 180C/350F/Gas 4.", "Put the tomatoes, sugar, onion, 2 tbsp of the olive oil, the orange and lime zest and juice and the coriander into a bowl and mix thoroughly to combine. ", "Heat the remaining oil in an ovenproof frying pan over a medium heat and gently fry one of the tortillas. ", "While it's still in the pan, add a third of the grated cheese to the fried tortilla, then put a third of the tomato mixture on top. Put another tortilla on top and repeat the process with a third of the cheese and a third of the tomato mixture. Finish with the third tortilla. ", "Transfer the pan and its contents to the oven for 2-3 minutes or until the cheese has melted. ", "To serve, remove the tortilla stack from the pan, cut into wedges and put onto a plate. Spoon the remaining third of the tomato salsa around the outside of the stack and sprinkle the remaining cheese over the top."]}, "Quick meatballs with cherry tomato sauce": {"ingredients": ["200g/7oz beef mince ", "½ tsp thyme ", "2 spring onions, finely chopped ", "salt and freshly ground black pepper", "2 tbsp olive oil, for frying", "1 tbsp extra virgin olive oil ", "2 garlic cloves, thinly sliced", "pinch dried chilli flakes (or more if you like spicy food) ", "400g tin cherry tomatoes or chopped tomatoes", "5 basil leaves, shredded (optional)", "200g/7oz fresh tagliatelle, cooked according to packet instructions", "freshly grated Parmesan"], "instructions": ["For the meatballs, put all of the meatball ingredients, apart from the oil, in a bowl. Season with salt and pepper, then use your hands to thoroughly mix everything together. Divide the mixture into 10 evenly sized pieces and roll each piece into a ball, then flatten slightly so they will cook more quickly.", "Heat the olive oil in a large frying pan over a medium heat then add the meatballs and fry for 5-6 minutes, turning once or twice, or until golden-brown on both sides and cooked through.", "For the sauce, heat the olive oil in a saucepan over a medium heat, add the garlic and chilli and fry for 1 minute. Tip in the tomatoes, increase the heat to high, and simmer for 5 minutes to reduce slightly then season with salt and pepper. Stir in the basil leaves, reserving a little for garnish. ", "To serve, spoon the hot tagliatelle into a wide bowl, put the meatballs on top, pour over the tomato sauce, scatter with Parmesan and garnish with a little basil."]}, "Quick broccoli soup": {"ingredients": ["1 tbsp olive oil", "1 broccoli head, chopped, main stem discarded ", "½ onion, chopped ", "250ml vegetable stock ", "2 tbsp double cream"], "instructions": ["Place the olive oil into a medium saucepan over a medium heat. Add the broccoli and onion and fry for two minutes to soften the onion.", "Add the stock, bring to the boil and reduce the heat to simmer for eight minutes, until the broccoli has cooked through.", "Blend with a hand blender until smooth, then pour into a bowl and serve drizzled with cream."]}, "Quesadilla with soured cream dip": {"ingredients": ["1 tbsp olive oil", "1 onion, chopped", "1 garlic clove, chopped", "½ yellow pepper, chopped", "1-2 smoked chipotle chillies, or to taste (available at some supermarkets and from online suppliers)", "100g/3½oz canned black-eye beans, rinsed and drained", "2 tbsp tomato ketchup", "50g/2oz cheddar cheese, grated", "1 tbsp vegetable oil", "2 ready-made flour tortillas ", "1 lime, juice only", "100ml/3½fl oz soured cream", "½ avocado, peeled, stone removed, chopped", "small handful fresh coriander, chopped", "salt and freshly ground black pepper"], "instructions": ["For the quesadilla, heat the olive oil in a frying pan and sauté the onion and garlic until softened.", "Add the yellow pepper, smoked chillies, black-eye beans and ketchup and simmer for 6-8 minutes, or until the vegetables are tender and the sauce has thickened.", "Heat half of the vegetable oil in a frying pan and place a tortilla into the pan. Spread the filling mixture over the tortilla, sprinkle over the grated cheese and fry for 2-3 minutes. Place the remaining tortilla on top.", "Lightly grease another frying pan of the same size with the remaining oil. Place the second frying pan upside down over the top of the quesadilla and carefully turn it into the second pan. Fry the quesadilla on the other side for 2-3 minutes, until golden-brown.", "For the soured cream dip, place all the soured cream dip ingredients into a bowl and mix well until combined.", "To serve, cut the quesadilla into wedges and place onto serving plates with a dollop of the soured cream dip."]}, "Qeema Cheese Puffs": {"ingredients": ["3 tbsp oil", "2 onion, chopped", "3 garlic cloves, chopped", "1 cup bell pepper cubes", "300 grams beef mince", "1 tsp salt", "1tsp black pepper powder", "1 tsp coriander powder", "2 tsp red chili powder", "1 tsp all spice powder", "1 tbsp soy sauce", "1tbsp chili sauce", "1/2 cup fresh coriander", "As required puff pastry sheets", "1 egg", "As required black or white sesame seeds"], "instructions": ["<strongMethod:</strong<br /Preheat the oven .after this in a pan heat oil and fry onion .then add mince and all spices mix and cook .finally add capsicum and sauce add and cook then add coriander then stove off .after this roll out the dough then place mince and roll it .then do the cut mark and sprinkling then sesame seeds and bake 25 minutes for 200 centigrade and serve ."]}, "Qeema Methi": {"ingredients": ["Chicken mince Â½ kg", "Fenugreek leaves Â½ kg", "Oil Â½ cup", "Onions (sliced) 2", "Ginger garlic 1 tbsp", "Cinnamon 1 stick", "Bay leaf 1", "Tomatoes 250 gm", "Black pepper 1 tsp", "Cumin 1 tsp", "Turmeric powder 1 tsp", "Red chili powder 1 tsp", "Salt 1 tsp", "Coriander powder 2 tsp", "Green chilies 10 (small)", "Fresh coriander for garnish"], "instructions": ["<strongMethod:</strong<br /Heat oil in a wok and fry cinnamon, bay leaf, cumin, ginger garlic and sliced onions", "Then add chicken mince and 1 cup water", "Cover and cook until the water dries", "Now add tomatoes, fenugreek leaves, black pepper, turmeric powder, salt, red chili powder and coriander powder", "Mix and cook well", "Lastly add green chilies and garnish with fresh coriander", "Serve hot."]}, "Qabuli Biryani": {"ingredients": ["Rice (boiled) Â½ kg", "Bengal Gram Lentil Â½ kg", "Fried Onion 2 tbsp", "Mint leaves, Coriander Leaves Â½ cup", "Yogurt 4 tbsp", "Red Chili Powder 1 tsp", "Turmeric Â½ tsp", "Salt to taste", "Finely Chopped Onion 1", "Ginger Garlic Paste 1 tbsp", "Finely Chopped Tomatoes 2", "Mix Garam Masala 1 tbsp", "Lemon Juice 2 tbsp", "Clarified butter Â½ cup", "All spice Powder 1 tsp", "Yellow Food Color as required", "Milk 2 tbsp", "Green Chilies 5-6"], "instructions": [""]}, "Quick Kheer": {"ingredients": ["Basmati rice 1 cup", "Water 3 cups", "Milk 1 cup + 1 liter", "Clarified butter 1 tsp", "Saffron Pinch", "Cardamom powder 1 tsp", "Sugar 1- Â½ cup", "Milk powder 2 tbsp", "Almonds pistachios as required", "Cashew nuts as required"], "instructions": ["In a pressure cooker wash 1 tea cup of basmati rice and add 3 cups water, 1 cup milk, 1 tsp desi ghee, pinch of saffron, and 1 tsp elaichi powder", "Cook on high heat till first whistle and low heat for 10 mins", "Add 1 litre milk and blend with hand blender", "Make sure the rice does not remain whole or become paste", "Grind till you can see small grains of rice", "Bring to boil and add 1 ½ cup of sugar, 2 tbsp masala milk powder, and lots of sliced badam, pista and kaju and some charoli", "Cook on low heat for 10-15 min and keep stirring, cook till desired thickness and serve hot or cold as you desire."]}, "Qormay Wali Chicken Biryani": {"ingredients": ["Screwpine Â½ cup", "Chicken 1-1/2 kg", "Rice Â½ kg", "Red chili powder 1 tbsp", "Coriander powder 2 tbsp", "Yogurt 250 gm", "Onion 2", "Ginger garlic paste 1 tbsp", "Black cumin Â½ tsp", "Whole red chilies 1 tbsp", "Cardamom 8", "Salt 1 tsp", "Food color (soaked milk) Â½ tsp", "Clarified butter Â½ cup", "Mint 4-5", "Green chilies as required", "Black pepper as required", "Lemon juice 1 lemon"], "instructions": [">You can also follow some simple steps and your tasty Pakistani Chicken Biryani will be ready in no time, and then you can enjoy it right away!"]}, "Qeema": {"ingredients": ["Minced meat 400 gm", "Large onion chopped 1 large", "Oil 3 tbsp", "Ginger chopped 1 tbsp", "Garlic, chopped 1 tbsp", "Salt 1 tsp", "Red chili powder 1 tsp", "Red chili flakes Â½ tsp", "All spice powder 1 tsp", "Cumin powder 1 tsp", "Coriander powder 1 tsp", "Turmeric powder Â½ tsp", "Julienned ginger 1", "Chopped green chilies 3", "Red chili flakes a pinch"], "instructions": ["<strongMethod:</strong<br /Heat oil, add in onion, cook until brown and add garlic and ginger", "Add the minced meat", "Cook the meat till its color changes to brown", "Add in spices and add 1 cup water", "Cover the sauce pan and leave on low heat till the water evaporates and the mince is cooked", "Garnish with julienned ginger, chopped green chillies, red chili flakes and serve with naan or rice."]}, "Qeema Biryani": {"ingredients": ["Rice Â½ kg", "Mutton mince Â½ kg", "Almonds chopped Â½ cup", "Raisins 6", "Yogurt 1 cup", "Clarified butter 2 tbsp", "Onion sliced 1 cups", "Garlic paste 1 tbsp", "Ginger paste Â½ tsp", "Cardamom 1", "Coriander powder 2 tsp", "Red chili powder 1 tsp", "Milk 1 cup", "Butter 50 gram", "Rose water 1 tbsp", "Mint leaves 5-6", "Ginger sliced 1 piece", "Cumin seeds 2 tsp", "Coriander seeds 2 tsp", "Green cardamom 3-4 pods", "Black cardamom 1", "Cinnamon sticks 3-4", "Mace 2 tsp", "black peppercorns 1 tsp", "cloves 5-6", "Water as required", "Salt to taste"], "instructions": ["<strongMethod :</strong"]}, "Qeema Bindhi": {"ingredients": ["Beef mince Â½ kg", "Lady finger 375 grams", "Onion 2", "Tomatoes 2", "Green chilies 4", "Green coriander Â½ bunch", "Salt 1 tsp", "red chili powder 2 tsp", "coriander powder 2 tsp", "turmeric 1 tsp", "bay leaves 2"], "instructions": ["<strongMethod:</strong<br /heat oil and fry onion .then blend it then add tomato and grind it .now add ginger garlic and mince then roast well .now add tomato ,onion ,salt ,red chili ,coriander ,termeric ,cumin ,bay leaves add and cover it .then add 2 cup of water and cook .when boil then cut the lady finger in the mid and cook for 10 minutes .finally garnish with green chili ,green coriander and serve ."]}, "Qeema Cholay": {"ingredients": ["Mince (beef) Â½ kg", "Chickpeas (boiled) 2 cups", "Onions (chopped) 2", "Tomato paste 2", "Yogurt Â½ cup", "Ginger Garlic Paste 1 tsp", "Oil Â¾ cup", "Coriander Leaves as required", "Green Chilies as required", "Salt to taste", "Red Chili Powder 1 tsp", "Turmeric Â½ tsp", "Ginger (chopped) 1 tbsp", "Whole all spice 1 tbsp", "All spice Powder 1 tsp", "Nigella Seeds Â¾ tsp", "Coriander Powder 1 tsp", "Cumin Seeds (chopped) 1 tsp"], "instructions": ["<strongMethod:</strong<br /In a pan, add onion and fry", "Now add mince, salt, red chili powder, yogurt, tomato paste, ginger garlic paste and mix", "Add garam masala and fry well", "Then add water and cook until chicken is done", "Dry the water, now fry well", "Add garam masala powder, ginger, coriander, cumin seeds, boiled chickpeas, nigella seeds and fry."]}, "Qeema Pulao": {"ingredients": ["Chicken mince Â½ kg", "Rice Â½ kg", "Yogurt Â¾ cup", "Whole all spice 1 tbsp", "White Pepper 1 tsp", "Button Red Chilies 10-12", "Onion 1", "Eggs (boiled) as required", "Salt to taste", "Raisins 4 tbsp", "Milk Â½ cup", "Nutmeg, Mace Powder Â½ tsp", "Finely Chopped Ginger 2 tbsp", "Clarified butter Â¾ cup"], "instructions": ["<strongMethod:</strong<br /Heat clarified butter, add onion and fry.<br /Add whole all spice, ginger garlic paste, salt, white chilies, yogurt, whole red chilies, chicken mince and fry.<br /Then ½ cup of water and cook until mince is done.<br /After this, add ginger, nutmeg, mace, milk and cook.<br /Now add water and cook until boil.<br /Now add rice and let it simmer.<br /Add raisins and take it out in a dish.<br /Garnish with boiled eggs."]}, "Qeema Cutlets": {"ingredients": ["Chicken Mince 600 gms", "Green Chilies 1-1/2 tbsp", "Salt 1-1/2 tsp", "All spice Powder Â¾ tsp", "Ginger Powder 1 tsp", "Onion 1", "Cumin Seeds 1 tsp", "Coriander Leaves as required", "Eggs 2", "Bread Crumbs as required", "Lettuce, Tomatoes for garnish"], "instructions": ["<strongMethod:</strong<br /In a chopper add chicken mince add green chili paste, salt, garam masala powder, onion, coriander leaves, cumin seeds powder, ginger, bread crumbs and chopped well", "Now make thin cutlets and roll in bread crumbs", "Then dip in beaten eggs and fry", "Now garnish with lettuce, tomatoes and serve."]}, "Qeema Bhindi Fry": {"ingredients": ["Chicken mince Â½ kg", "Okra 200gm", "Tomatoes Â½ kg", "Green chilies 6", "Coriander 1bunch", "Black pepper 1tsp", "Cumin 2tsp", "Turmeric 1tsp", "Mango powder 2tsp", "All spice 1tsp", "Fenugreek 1tbsp", "Oil Â½ cup", "Ginger garlic paste 2tbsp"], "instructions": [""]}, "Qeema Aur Matar Walay Chawal": {"ingredients": ["Chicken mince Â½ kg", "Green Peas Â½ kg", "Rice (soaked) Â½ kg", "Tomatoes 250 gms", "Green Chilies 10", "Onions 2", "Salt 2 tsp", "Fennel Seeds 2 tsp", "Whole Coriander 2 tsp", "Cumin seeds 1 tsp", "Cardamoms 4", "Black Cumin Seeds 1 tsp", "Black Pepper Corns 1 tsp", "Bay Leaves 2", "Ginger Garlic Paste 1 tbsp", "Mint Leaves 1 bunch", "Oil Â½ cup"], "instructions": ["<strongMethod:</strong<br /•  In a pan, add onion, tomatoes, whole coriander, fennel seeds, salt , water and cook on low flame.<br /•  When stock is remaining, removes from the stove and sieve it.<br /•  In separate pan, heat oil add onion and fry.<br /•  Add garam masala, ginger garlic paste, green peas and fry well.<br /•  Now add stock , when boil comes add soaked rice.<br /•  When dries water, add mint leaves and green chilies.<br /•  Let it simmer for 15 minutes and take it out in a dish."]}, "Qeema Soya Pulao": {"ingredients": ["Beef minced Â½ kg", "Chopped onion 1", "Ginger garlic paste 1 tbsp", "Salt as required", "White pepper 1 tsp", "Mix all spice 1 tbsp", "Yogurt Â½ cup", "Dill 1-1/2 cup", "Green chilies 4-5", "Oil Â¾ cup", "Rice 400 gm", "Bay leaves 2", "Boiled egg for garnish"], "instructions": ["<strongMethod:</strong<br /Heat oil add onion, whole all spice and bay leaves fry well", "Add minced cook well", "Add ginger garlic paste, salt, white pepper and yogurt cook well", "Also add water cook till boil comes", "Add soaked rice and green chilies cook till water is dries out", "Also add dill leave for simmer", "When simmer comes remove &amp; garnish with boiled eggs."]}, "Qeema Spaghetti": {"ingredients": ["Beef Mince Â½ kg", "Boiled spaghetti 1 packet", "Tomatoes 375 gm", "Green chilies 10", "Onion 2", "Cumin 2 tsp", "Salt 1 tsp", "Turmeric 1 tsp", "Coriander powder 1 tsp", "Capsicum 2", "Red chili 1 tsp", "Ginger garlic paste 2 tbsp", "Oil Â½ cup", "Green coriander 1 bunch"], "instructions": ["<strongMethod:</strong<br /Heat oil and add ginger garlic paste", "Now add mince and cook on high flame", "Then add onion, tomatoes, green chilies, cumin, salt, turmeric, coriander powder, capsicum and red chili, the cover", "Now add boiled spaghetti and mix when water dries then sprinkle green coriander and serve."]}, "Qeema Bhari Shimla Mirch": {"ingredients": ["Oil Â½ cup", "Onion sliced 3", "Ginger garlic paste 1tbsp", "Red chili powder 1tbsp", "Cumin powder 1tsp", "Coriander powder 1 tsp", "Turmeric powder 1/2 tsp", "Salt to taste", "Tomatoes chopped 3 (medium)", "Beef mince 1/2 kg", "Mint leaves 4 tbsp", "Fresh coriander 4 tbsp", "Green chilies 4", "All spice powder 1 tsp", "Capsicums 3-4 large"], "instructions": ["In pot, add oil, onion and fry until golden brown, add ginger garlic paste and beef mince, mix well and cook on medium high flame until water is reduced", "Add red chili powder, cumin powder, coriander powder, turmeric powder, salt, tomatoes, mix well and cook until tomatoes are soft", "Add water and mix well, cover &amp; cook on low flame for 10-15 minutes", "Add mint leaves, fresh coriander, green chilies, all spice powder and mix well.<br /Cut the top of the each capsicum, remove seeds and white part", "Stuffed hollow capsicum with mince and set aside", "Place stuffed capsicum, cover and cook for 10-15 minutes on low flame", "Serve hot."]}, "Qeema Bhari Hari Mirch": {"ingredients": ["Large size green chilies 8-10", "Chicken mince Â½ kg", "Chili powder 1 tsp", "Turmeric Â½ tsp", "Chopped onion 1 cup", "Sliced onion 1 Â½ cup", "Coriander leaves chopped Â½ cup", "Mint leaves chopped Â¼ cup", "Ginger garlic paste 1 tbsp heaped", "Yogurt 1 cup", "Allspice 1 tsp", "Oil Â½ cup", "Salt 1 tsp heaped", "Lemon juice 2 tbsp"], "instructions": ["Heat ½ cup oil, add mince with salt, turmeric, chili powder, ginger garlic, fry till the liquid dries up, add ½ cup water and cook the mince till done, add in chopped onion, chopped mint and coriander, lemon juice, remove from fire and let it cool, cut off the stems and the small part of the upper portion of each chili, scoop out the seeds, cut the chilies, fill the chilies with the half of the cooked mince", "In a separate wok heat the remaining oil, fry the sliced onion till light golden, add the remaining cooked mince with yogurt, fry for 5 mins, add ½ cup water, when the water begins to boil, gently put in the stuffed green chilies, and cook until the chilies are slightly wilted and the oil comes on surface, add allspice powder, serve hot."]}, "Quick Pickled Red Onions Recipe": {"ingredients": ["½ cups apple cider vinegar", "1 tablespoon sugar", "1½ teaspoons kosher salt", "1 red onion, thinly sliced"], "instructions": ["Whisk first 3 ingredients and 1 cup water in a small bowl until sugar and salt dissolve. Place onion in a jar; pour vinegar mixture over. Let sit at room temperature for 1 hour.\nDO AHEAD: Can be made 2 weeks ahead. Cover and chill. Drain onions before using."]}, "Queso ": {"ingredients": ["1 small onion", "3 garlic cloves", "1 tsp. (or more) kosher salt", "⅓ cup pickled jalapeños, plus 1 Tbsp. pickle juice", "8 oz. American cheese", "8 oz. Monterey Jack cheese", "2 Tbsp. unsalted butter", "2 tsp. ground cumin", "½ tsp. cayenne pepper", "2 cups milk", "1 Tbsp. cornstarch", "Chips (for serving)"], "instructions": ["Time to do a little knifework: Peel and finely chop 1 small onion. Peel 3 garlic cloves. Finely chop ⅓ cup pickled jalapeños.", "Using a box grater, coarsely grate 8 oz. American cheese (or tear if using singles) and 8 oz. Monterey Jack cheese (you should have about 4 packed cups). Set aside separately.", "Heat 2 Tbsp. unsalted butter in a medium saucepan over medium until foamy, about 1 minute. Reduce heat to medium-low and add onions. Using a Microplane, finely grate garlic into pot; season with 1 tsp. salt. Cook, stirring occasionally, until onions are tender but haven’t developed any color, about 3 minutes. Add 2 tsp. ground cumin and ½ tsp. cayenne pepper and cook, stirring frequently, until aromatic, about 30 seconds. Stir in 1¾ cups milk and bring to a bare simmer.", "Meanwhile, whisk 1 Tbsp. cornstarch and remaining ¼ cup milk in a small bowl until smooth. By mixing the cornstarch with a portion of the milk before adding it into the pot, you greatly reduce your chance of lumps. (You can also shake milk and cornstarch together in small lidded jar.)", "Add cornstarch mixture to pot and bring to a simmer over medium heat. Cook, stirring constantly, until mixture is thickened (it should coat the back of your spatula) and cornstarch is hydrated—it should simmer for 1 full minute. This is important: If your cornstarch isn't fully hydrated, your queso will be grainy and floury rather than thick and creamy.", "Reduce heat to medium-low and add American cheese. Stir vigorously with a spatula, taking care not to let mixture bubble, until cheese is fully melted, about 3 minutes.", "Add Monterey Jack cheese one handful at a time, stirring vigorously to incorporate fully before adding the next and adjusting heat as needed so mixture doesn't bubble, about 30 seconds between additions and 4 minutes total. After adding all the cheese, stir vigorously to ensure that all cheese is melted, about 1 minute (it will look thick and stringy).", "Remove from heat and stir in 1 Tbsp. pickling liquid and half of jalapeños. Taste and add more salt if needed. Garnish with remaining jalapeños.", "Arrange chips on a platter or baking sheet. Serve queso right out of the pot so it stays warm and can be easily reheated over medium-low heat if needed. If you’re feeling real extra, set pot over another pot or large bowl filled with hot water so it stays gooey for longer."]}, "Quick-Cooked Kale": {"ingredients": ["1 large bunch purple or any other type of kale", "1 Tbsp. grapeseed or extra-virgin olive oil", "2 garlic cloves, finely chopped", "1 Tbsp. perilla (sesame leaf) oil or toasted sesame oil", "1 Tbsp. white or regular soy sauce", "Kosher salt (optional)"], "instructions": ["Trim woody ends from kale stems. Remove ribs and stems from leaves and thinly slice crosswise. Coarsely chop leaves; keep separate from stems. Heat grapeseed oil in a large skillet over medium. Cook stems, tossing occasionally, just until crisp-tender, about 3 minutes. Add leaves a handful at a time, tossing and letting wilt slightly before adding more; cook until all of the leaves are wilted, about 2 minutes. Add garlic, perilla oil, and soy sauce and cook, tossing often, until leaves are soft, about 3 minutes. Season with salt if needed."]}, "Quick Kimchi Pancakes": {"ingredients": ["1 large egg", "1 Tbsp. kimchi brine from jar", "¼ cup soy sauce, divided", "¾ cup plus 1 Tbsp. all-purpose flour", "1½ cups kimchi", "4 scallions", "4 Tbsp. grapeseed or other neutral oil, divided", "3 Tbsp. unseasoned rice or distilled white vinegar"], "instructions": ["Crack 1 egg into a medium bowl. Add 1 Tbsp. kimchi brine, 1 Tbsp. soy sauce, and ¼ cup water and whisk to combine.", "Whisk in ¾ cup plus 1 Tbsp. flour.", "Coarsely chop 1½ cups kimchi, add to bowl, and stir to combine.", "Thinly slice 4 scallions on a diagonal. Add half to batter; reserve remaining scallions for serving.", "Heat 1 Tbsp. oil in a medium nonstick skillet over medium-high. Drop ¼-cupfulls of batter onto opposite sides of skillet (pancakes should be about 4\" in diameter, so you’ll probably only be able to cook 2 at a time).", "Cook pancakes until golden brown on first side, 2–3 minutes, then flip and cook until browned on second side, 2–3 minutes longer. Transfer to a wire rack and let cool. Repeat process in batches with remaining batter and oil; you should have 8 pancakes.", "Combine 3 Tbsp. vinegar and remaining 3 Tbsp. soy sauce in a small bowl.", "Transfer pancakes to a platter. Top with reserved scallions and serve with dipping sauce alongside."]}, "Quick-Pickled Vegetables": {"ingredients": ["½ cup unseasoned rice vinegar", "1 Tbsp. sugar", "2 tsp. kosher salt", "1 cup thinly sliced vegetables (such as carrot, red onion, and/or cucumber)"], "instructions": ["Whisk vinegar, sugar, and salt in a small bowl until sugar and salt are dissolved. Add vegetables and let sit, squeezing gently with your hands occasionally to help them pickle more quickly, 10 minutes.", "Do Ahead: Vegetables can be pickled 3 days ahead. Cover and chill."]}, "Quick Tomato Chicken Curry": {"ingredients": ["3 tablespoons ghee, coconut oil, or extra-virgin olive oil", "1 large red onion, cut into ½-inch wedges", "1 2-inch piece ginger, peeled, finely grated", "4 garlic cloves, crushed", "Kosher salt", "1 tablespoon plus 1 teaspoon garam masala", "1 bay leaf", "½ teaspoon crushed red pepper flakes", "2 tablespoons honey", "1 28-ounce can whole peeled tomatoes", "1 15-ounce can coconut milk", "3 skinless, boneless chicken breasts (about 1½  pounds total), cut into 1-inch-thick pieces", "½ cup whole-milk Greek yogurt", "½ cup coarsely chopped cilantro"], "instructions": ["Heat ghee in a large wide saucepan over medium-high. Add onion and cook, turning occasionally, until undersides are golden brown, about 2 minutes. Add ginger and garlic and cook, stirring, until softened, about 2 minutes; season with salt. Add garam masala, bay leaf, and red pepper and cook until fragrant, about 30 seconds. Stir in honey and cook until slightly caramelized, about 1 minute.", "Add tomatoes along with juices and bring to a boil, smashing down on tomatoes with a wooden spoon until pieces are no bigger than 1\". Reduce heat to medium and cook, stirring often and scraping up browned bits from bottom of pot, until sauce thickens, 8–10 minutes. Add coconut milk and cook, stirring occasionally, until sauce thickens, 20–25 minutes; taste and season with salt, if needed. Add chicken strips and reduce heat to low. Cook, partially covered, until chicken is cooked through, 8–10 minutes. Season with salt.", "Stir yogurt, a big pinch of salt, and 2 Tbsp. water in a small bowl.", "Drizzle yogurt sauce over stew. Top with cilantro before serving.", "Do Ahead: Curry (without yogurt sauce) can be made 2 days ahead. Cover and chill."]}, "Quinoa Bowl with Lentils and Mustard Vinaigrette": {"ingredients": ["½ cup green lentils, rinsed", "½ cup red quinoa, rinsed", "Kosher salt", "2 tablespoons red wine vinegar", "1 tablespoon fresh lemon juice", "2 teaspoons Dijon mustard", "¼ cup extra-virgin olive oil", "Freshly ground black pepper", "3 celery stalks, thinly sliced on a diagonal", "2 cups very thinly sliced green cabbage", "1 cup celery leaves", "1 cup torn mint leaves", "3 ounces semifirm cheese (such as Gouda, Gruyère, or cheddar), shaved"], "instructions": ["Cook lentils and quinoa in a large saucepan of simmering salted water until lentils are tender but still retain their shape, 15–20 minutes. Drain; transfer to a medium bowl.", "Whisk vinegar, lemon juice, and mustard in a large bowl. Whisking constantly, gradually stream in oil; whisk until emulsified. Season with salt and a generous amount of pepper. Add lentils and quinoa, celery stalks, cabbage, celery leaves, and mint and toss to coat. Add cheese and toss again. Taste and season with more salt and pepper if needed.", "Do Ahead: Lentils and quinoa can be cooked 1 day ahead. Let cool; cover and chill."]}, "Quesadillas with Squash Blossoms": {"ingredients": ["2 tablespoons olive oil", "½ white onion, thinly sliced", "2 garlic cloves, thinly sliced", "Kosher salt", "4 corn tortillas", "2 ounces Oaxacan cheese or fresh mozzarella, grated (about ½ cup)", "8 squash blossoms, stems and stamens removed"], "instructions": ["Heat oil in a large skillet, preferably cast iron, over medium. Cook onion and garlic, stirring occasionally, until very soft and golden, 10–12 minutes; season with salt. Transfer to a small bowl and wipe skillet clean.", "Toast a tortilla in the same skillet over medium-high until golden brown but not crunchy on one side, about 1 minute. Turn tortilla over and scatter one-quarter of cheese over one half of toasted side. Arrange 2 squash blossoms and one-quarter of onion mixture on top of cheese and fold tortilla in half to create a half-moon. Press down on it lightly to help tortilla adhere. Continue cooking, turning once or twice and pressing occasionally, until cheese is melted and tortilla begins to brown and crisp in spots (turn down the heat if needed), about 3 minutes. Transfer quesadilla to a plate. Repeat with remaining tortillas, cheese, squash blossoms, and onion mixture to make 3 more quesadillas."]}, "Quick-Pickled Rhubarb Salad": {"ingredients": ["2 rhubarb stalks, sliced on a diagonal", "1 cup red wine vinegar", "½ cup sugar", "1½ teaspoons kosher salt, plus more", "1 fennel bulb, halved, cored, very thinly sliced", "3 celery stalks, thinly sliced on a diagonal, plus celery leaves for serving", "Olive oil (for drizzling)", "Freshly ground black pepper", "A heatproof 1-pint jar"], "instructions": ["Pack rhubarb into jar. Bring vinegar, sugar, 1½ tsp. kosher salt, and ¾ cup water to a boil in a small saucepan, stirring to dissolve sugar and salt. Pour into jar. Cover and chill until cold, at least 1 hour.", "Toss fennel, celery, 1 cup drained pickled rhubarb, and 2 Tbsp. pickling liquid in a large bowl to combine; season with salt.", "Arrange salad on a platter; drizzle with oil and grind some pepper over. Top with celery leaves and remaining drained pickled rhubarb.", "Do Ahead: Rhubarb can be pickled 1 week ahead. Keep chilled."]}, "Quinoa-Banana Muffins": {"ingredients": ["¾ cup white quinoa", "1 teaspoon kosher salt, plus more", "Nonstick vegetable oil spray", "1¼ cups whole wheat flour", "1 teaspoon baking powder", "1 teaspoon ground cinnamon", "2 very ripe bananas", "¼ cup honey", "¼ cup (packed) dark brown sugar", "1 large egg", "½ cup olive oil", "1 teaspoon vanilla extract", "1 cup blueberries", "Raw sugar (for sprinkling)"], "instructions": ["Cook quinoa in a large pot of boiling salted water, stirring occasionally, until tender, 10–12 minutes. Drain well and return to pot. Cover and let steam 10 minutes. Pour off any condensed water, then let cool. Set aside ¼ cup cooked quinoa for topping muffins.", "Preheat oven to 375°. Coat a standard 12-cup muffin pan with nonstick spray (do not use muffin liners). Whisk flour, baking powder, cinnamon, and remaining 1 tsp. salt in a medium bowl.", "Mash bananas, honey, and brown sugar in another medium bowl, preferably with a potato masher, until sugar is dissolved and banana is completely mashed. Add egg and continue to mash until combined. Stir in oil and vanilla.", "Stir banana mixture into dry ingredients just until combined. Stir in blueberries and 2 cups quinoa. Divide batter among muffin cups. Sprinkle lightly with raw sugar and reserved ¼ cup quinoa.", "Bake muffins until tops are firm, just beginning to brown, and a tester inserted into muffins comes out clean, 30–40 minutes. Let cool slightly before serving.", "Do Ahead: Quinoa can be cooked 5 days ahead; cover and chill."]}, "Quince Jam with Cardamom and Pistachios ": {"ingredients": ["2 quinces, cored, peeled, cut into 1-inch pieces, cores reserved (about 1 pound)", "¼ cup fresh lemon juice, divided", "2 cups sugar", "4 cardamom pods, cracked", "¼ cup shelled, unsalted pistachios (optional)"], "instructions": ["Toss quinces with 2 Tbsp. lemon juice in a medium bowl; set aside.", "Bring sugar, cardamom pods, reserved quince cores, and 2½ cups water to a boil in a medium saucepan. Cook, stirring to dissolve sugar, about 5 minutes. Add quince, reduce heat to low, and cook, covered, until quinces develop a deep rose color and are tender but not mushy, 1½ –2 hours. Add remaining 2 Tbsp. lemon juice and bring to a boil. Lower heat and simmer, stirring occasionally, until liquid has slightly thickened, 8–10 minutes. Remove from heat (the syrup will thicken as it cools) and add pistachios (if using). Remove and discard quince cores. Serve warm or at room temperature.", "Do Ahead: Jam can be made 1 week ahead. Cover and chill."]}, "Quick Braised Kabocha Squash": {"ingredients": ["4 1½-inch-thick kabocha squash wedges", "4 shallots, peeled", "2 garlic cloves, peeled", "3 sprigs thyme", "4 tablespoons unsalted butter", "2 tablespoons red wine vinegar", "1 teaspoon honey", "Kosher salt, freshly ground pepper"], "instructions": ["Bring squash, shallots, garlic, thyme, butter, vinegar, honey, a big pinch of salt, and ½ cup water to a boil in a large skillet. Reduce heat to medium-high, cover, and simmer until tender, 12–18 minutes. Uncover and cook, turning squash halfway through, until liquid is evaporated and squash is browned, 5–8 minutes. Transfer vegetables to a platter. Add 1 Tbsp. water to skillet and cook just to scrape up browned bits. Drizzle pan juices over squash; season with salt and pepper."]}, "Quick 5-Ingredient Tomato Sauce": {"ingredients": ["1 28-ounce can whole peeled tomatoes", "3 garlic cloves, smashed", "5 tablespoons olive oil", "Kosher salt", "2 tablespoons unsalted butter"], "instructions": ["Purée tomatoes in a food processor until they’re as smooth or chunky as you like. Transfer tomatoes to a large Dutch oven or other heavy pot. (Or, use an immersion blender and blend directly in pot.) Add garlic, oil, and a 5-finger pinch of salt. Bring to a boil and cook, stirring occasionally, until sauce is reduced by about one-third, about 20 minutes. Stir in butter.", "Do Ahead: Sauce can be made 5 days ahead; cover and chill. Or let cool to room temperature and freeze up to 3 months."]}, "Quick-Pickled Chiles": {"ingredients": ["3 Fresno chiles, thinly sliced on a diagonal", "2 Hungarian wax chiles, thinly sliced on a diagonal", "1 cup Sauvignon Blanc vinegar or white wine vinegar", "½ cup sugar", "1 tablespoon kosher salt", "A 1-pint heatproof jar"], "instructions": ["Place chiles in jar. Bring vinegar, sugar, and salt to a boil in a small saucepan, stirring to dissolve sugar and salt. Pour brine over chiles, seal jar, and let cool.", "Do Ahead: Chiles can be pickled 1 week ahead. Chill."]}, "Quick-Pickled Strawberries": {"ingredients": ["1 pound ripe but firm strawberries, hulled, halved if large", "1½ cups white balsamic vinegar", "¼ cup sugar", "2 tablespoons kosher salt"], "instructions": ["Place strawberries in a 1-qt. heatproof jar. Bring vinegar, sugar, salt, and ⅔ cup water to a boil in a small saucepan over medium heat, stirring to dissolve sugar and salt. Pour over strawberries. Let cool; cover and chill.", "Do Ahead: Strawberries can be pickled 5 days ahead. Keep chilled."]}, "Queso Fundido": {"ingredients": ["1 small tomato, chopped", "1 serrano chile, seeded, chopped", "2 tablespoons chopped fresh oregano", "Kosher salt", "8 ounces coarsely grated mild yellow cheddar", "8 ounces coarsely grated Monterey Jack", "1 tablespoon all-purpose flour", "1 4-ounce link fresh chorizo or hot Italian sausage, casing removed", "1/2 cup minced onion", "1/2 cup lager", "Tortilla chips"], "instructions": ["Mix tomato, chile, and oregano in a small bowl. Season with salt; let salsa stand for 30 minutes.", "Meanwhile, toss both cheeses with flour in a medium bowl. Cook chorizo in a medium saucepan over medium heat, breaking up with a wooden spoon, until it begins to render, about 1 minute. Add onion and continue cooking until chorizo is cooked and onion is soft and translucent, about 5 minutes.", "Transfer chorizo mixture to a small bowl; return saucepan to heat. Add beer; simmer, stirring occasionally and scraping up any browned bits. Whisking constantly, add cheese mixture a 1/4-cupful at a time, allowing it to become blended and smooth between additions. Stir in chorizo mixture. DO AHEAD Queso can be made 30 minutes ahead. Let stand at room temperature.", "To reheat, warm skillet with queso fundido over medium heat; stir until melted and bubbly.", "Using a slotted spoon, spoon salsa over queso. Serve in skillet with a basket of tortilla chips on the side."]}, "Quick Aleppo Dill Pickles": {"ingredients": ["8 Persian cucumbers, quartered lengthwise", "¼ cup coarsely chopped fresh dill", "2½ cups distilled white vinegar", "⅓ cup sugar", "1 garlic clove, finely grated", "1 tablespoon Aleppo pepper", "1 tablespoon fresh lemon juice", "1 tablespoon kosher salt", "1 teaspoon crushed red pepper flakes", "1 teaspoon freshly ground black pepper", "Za’atar and flaky sea salt (for serving)", "Za’atar, a Middle Eastern spice blend that includes sumac, herbs, and sesame seeds, can be found at Middle Eastern markets, specialty foods stores, and online."], "instructions": ["Pack cucumber and dill into a large heatproof jar. Bring vinegar, sugar, garlic, Aleppo pepper, lemon juice, kosher salt, red pepper flakes, and black pepper to a boil in a medium saucepan, stirring to dissolve sugar. Let cool slightly, then pour brine over cucumbers to submerge. Seal jar and chill at least 30 minutes.", "To serve, remove cucumber spears from brine, lightly shaking off excess liquid but leaving on any seasonings; sprinkle with za’atar and sea salt.", "Do Ahead: Cucumber can be made 2 days ahead. Remove from brine (do not dry) and chill in an airtight container."]}, "Quick Miso Soup": {"ingredients": ["2 tablespoons grated carrot", "1 scallion, thinly sliced", "2 tablespoons finely diced silken tofu", "1 tablespoon white miso", "Smoked Salt Furikake (click here for recipe), for serving"], "instructions": ["Combine all ingredients in a travel mug. To serve, pour 8 oz. boiling water into the cup and stir until miso is well blended. Let sit 2 minutes before eating."]}, "Quince and Mission Fig Preserves": {"ingredients": ["6 large quince or 8 medium green apples (about 3 lb.), divided", "1 cup dried Mission figs, halved, quartered if large", "Zest of 1 lemon, thinly sliced", "¼ cup fresh lemon juice", "2 cups sugar", "½ teaspoon ground cardamom", "Three heatproof 12-oz. glass jars"], "instructions": ["Rub quince with a damp paper towel to remove fuzz. Cut 4 quince (6 apples) into large pieces (no need to peel, core, or remove seeds). Place in a large heavy pot and cover with cold water. Bring to a boil, reduce heat, and simmer until quince are very soft, 60–75 minutes.", "Strain cooking liquid into a large bowl; discard quince. Wipe out pot; reserve.", "Plump figs in a small bowl of hot water until soft, about 15 minutes. Drain.", "Meanwhile, peel, core, and thinly slice remaining 2 quince. Add to quince pot along with lemon zest and juice, sugar, cardamom, figs, and reserved cooking liquid and bring to a boil. Reduce heat and very gently boil, stirring often and skimming surface occasionally, until quince is translucent and a spoon dragged across pot leaves a line that quickly disappears, 25–30 minutes, or 40–50 minutes if using apples.", "Divide preserves among jars. Let cool; cover and chill.", "DO AHEAD: Preserves can be made 2 weeks ahead. Keep chilled."]}, "Quinoa with Walnuts and Shallots": {"ingredients": ["3 tablespoons walnuts", "1 cup red quinoa", "1 tablespoon olive oil", "2 shallots, sliced", "1/2 teaspoon kosher salt, plus more to taste"], "instructions": ["Preheat oven to 350°. Toast walnuts on a small rimmed baking sheet, stirring occasionally, until fragrant and slightly darkened in color, 6–8 minutes. Let cool; coarsely chop.", "Meanwhile, thoroughly rinse quinoa; drain.", "Heat oil in a medium saucepan over medium heat. Add shallots and ½ tsp. salt; stir to coat.", "Cook, stirring occasionally, until shallots have softened, about 5 minutes. Add quinoa and stir to coat. Pour in 1½ cups water, increase the heat, and bring to a boil. Reduce heat to low and cover. Cook until quinoa is tender and the germ has unfurled, 15–18 minutes. Season with salt. Just before serving, toss in toasted walnuts. Reserve ½ cup quinoa for Quinoa and Roasted Vegetable Salad."]}, "Quick Pickled Onions": {"ingredients": ["1/2 cup cider vinegar", "1 tablespoon honey", "1 tsp kosher salt", "1 tsp yellow mustard seeds", "1/2 teaspoon crushed red pepper flakes", "1 bay leaf", "1 medium red onion, thinly sliced"], "instructions": ["Bring vinegar, honey, salt, mustard seeds, red pepper flakes, and bay leaves to a boil in a medium saucepan; add onions. Reduce heat and simmer 1 minute. Let cool.", "Do Ahead: Onion can be pickled 2 weeks ahead. Refrigerate tightly for up to 2 weeks. Cover and chill."]}, "Quinoatmeal with Apple and Toasted Walnuts": {"ingredients": ["1/4 cup red quinoa", "1/4 cup steel-cut oats", "1/2 cup almond milk, plus more for serving", "1 pinch kosher salt", "1 pinch ground cinnamon, plus more for serving", "1 tbsp chopped walnuts", "1/2 apple, shredded"], "instructions": ["The night before cooking, rinse quinoa thoroughly and drain. Combine oats and quinoa in a medium saucepan and cover with 1 cup boiling water.", "In the morning, bring oats and quinoa to a boil. Stir in almond milk, salt, and cinnamon and reduce heat to low. Cook, stirring occasionally, until quinoa grains are tender, 8–10 minutes. Meanwhile, preheat oven to 350°. Toast walnuts on a small rimmed baking sheet, stirring occasionally, until fragrant and slightly darkened in color, about 4 minutes. Let cool slightly.", "Top quinoatmeal with apple, walnuts, and more cinnamon, if desired. Drizzle with almond milk."]}, "Quinoa and Roasted Vegetable Salad": {"ingredients": ["1 cup leftover Roasted Beets, Carrots, and Jerusalem Artichokes with Lemon", "1/2 cup leftover Quinoa with Walnuts and Shallots", "4 cups tender salad greens such as spinach, arugula, or baby kale", "2 tablespoons Whole Grain Mustard Dressing", "Kosher salt, freshly ground black pepper"], "instructions": ["Toss roasted vegetables, quinoa, and greens with mustard dressing in a large bowl. Season with salt and pepper."]}, "Quick Pickled Daikon and Watermelon Radishes": {"ingredients": ["1 cup apple cider vinegar", "1 cup unseasoned rice vinegar", "1/2 cup sugar", "1/4 cup kosher salt", "2 tbsp fresh lime juice", "2 red Thai chiles, split lengthwise", "1 teaspoon coriander seeds", "1 medium daikon (Japanese white radish), peeled, very thinly sliced", "1 medium watermelon radish, peeled, very thinly sliced"], "instructions": ["Bring cider vinegar, rice vinegar, sugar, salt, lime juice, chiles, coriander seeds, and ¼ cup water to a boil in a medium saucepan over medium-high heat, stirring to dissolve sugar. Let cool 10 minutes.", "Place daikon and radish in a large bowl and add pickling liquid. Cover and chill at least 4 hours and up to 5 days. Serve with Korean Fried Chicken Wings (click for recipe)."]}, "Quick Pickled Cucumbers, Carrots, and Shallots": {"ingredients": ["2 cups unseasoned rice vinegar", "1/2 cup sugar", "2 tablespoons fresh lime juice", "2 tablespoons kosher salt", "1 red jalapeño, with seeds, thinly sliced crosswise", "4 kirby cucumbers, sliced 1/4\" thick", "1 large yellow or orange carrot, peeled, thinly sliced on a diagonal", "2 medium shallots, thinly sliced into rings"], "instructions": ["Bring vinegar, sugar, lime juice, salt, jalapeño, and 1/4 cup water to a boil in a medium saucepan over medium-high heat, stirring to dissolve sugar. Let cool 10 minutes.", "Place cucumbers, carrot, and shallots in a large bowl and add pickling liquid. Cover and chill at least 4 hours and up to 5 days. Serve with Korean Fried Chicken Wings (click for recipe)."]}, "Quinoa Salad with Peaches and Pickled Onions": {"ingredients": ["1 1/2 cups quinoa (any color) rinsed well", "1 medium red onion, sliced ¼” thick", "1/2 cup apple cider vinegar", "3 Tbsp. sugar", "2 large ripe firm peaches, cut into ½” pieces", "1/2 bunch arugula, thick stems trimmed, leaves torn (about 2 cups)", "2 cups small cherry tomatoes (about 1 pint), halved", "1/4 cup olive oil", "1/2 cup ½” pieces chives, divided", "4 tsp. kosher salt plus more", "Freshly ground black pepper"], "instructions": ["Bring quinoa and 4 cups water to a boil in a medium saucepan. Season with salt. Cover, reduce heat, and simmer until quinoa is tender, 8–10 minutes. Drain, return quinoa to pan, and cover. Remove from heat and let sit 15 minutes. Fluff with a fork and spread out on a rimmed baking sheet; let cool.", "Meanwhile, place onion in a small bowl. Bring vinegar, sugar, and 4 tsp. salt to a boil in a small saucepan, stirring to dissolve sugar and salt. Pour over onion and let stand 20 minutes. Drain, reserving pickling liquid.", "Toss pickled onion, peaches, arugula, tomatoes, oil, ¼ cup chives, and 3 Tbsp. reserved pickling liquid in a large bowl; season with salt, pepper, and more pickling liquid, if desired. Fold in quinoa.", "Serve salad topped with remaining ¼ cup chives.", "DO AHEAD: Quinoa salad can be made 6 hours ahead (do not add arugula and chives). Cover and chill. Bring to room temperature and toss in arugula and chives just before serving."]}, "Quick-Pickled Shrimp": {"ingredients": ["1 pound shell-on medium shrimp", "Kosher salt", "1/2 medium fennel bulb, thinly sliced", "1/2 medium onion, thinly sliced", "2 garlic cloves, thinly sliced", "1/2 Fresno chile or red jalapeño, thinly sliced, seeded", "1/2 cup fresh lemon juice", "1/4 cup apple cider vinegar", "1/4 cup extra-virgin olive oil", "2 tablespoons fennel fronds", "Freshly ground black pepper", "1/2 loaf ciabatta or country-style bread, sliced 1/2-inch thick, toasted", "Mayonnaise (for serving; optional)"], "instructions": ["Cook shrimp in a large pot of boiling salted water until just opaque in the center, about 2 minutes. Drain; rinse under cold running water to cool. Peel and devein, leaving tails intact, if desired.", "Combine shrimp, fennel bulb, onion, garlic, chile, lemon juice, vinegar, oil, and fennel fronds in a medium bowl. Season with salt and pepper and toss to combine. Let sit, tossing occasionally, at least 20 minutes.", "Serve shrimp with toast and mayonnaise, if using.", "DO AHEAD: Pickled shrimp can be made 2 days ahead. Cover and chill."]}, "Quick Pomodoro Sauce": {"ingredients": ["1 28-ounce can whole peeled tomatoes", "½ cup olive oil", "2 garlic cloves, chopped", "¼ teaspoon sugar", "Kosher salt"], "instructions": ["Pulse tomatoes with juices in a blender to form a coarse purée. Heat oil in a medium saucepan over medium heat. Add garlic and cook, stirring often, until beginning to brown, about 2 minutes. Add tomato purée and sugar and season with salt. Bring to a boil, reduce heat, and simmer gently until sauce is slightly thickened, 10-15 minutes.", "DO AHEAD: Sauce can be made 3 days ahead. Cover and chill, or freeze for up to 3 months."]}, "Quick-Pickled Jalapeños": {"ingredients": ["1 cup apple cider vinegar", "2 tablespoons sugar", "A pinch of kosher salt", "8 jalapeños (about 1/2 pounds), with seeds, thinly sliced"], "instructions": ["Whisk vinegar, sugar, and salt in a medium bowl until sugar is dissolved. Add jalapeños; toss to coat. Let stand at room temperature, tossing occasionally, for at least 30 minutes and up to 2 hours. DO AHEAD: Pickled jalapeños can be made 1 day ahead. Cover and chill."]}, "Quinoa Fritters with Ají Amarillo Aioli": {"ingredients": ["1 cup mayonnaise", "2 tablespoons fresh lime juice", "2 tablespoons (or more) ají amarillo chile paste or other chile paste", "1 tablespoon minced flat-leaf parsley", "1/2 teaspoon kosher salt", "2/3 cup quinoa, rinsed, drained", "1/4 cup all-purpose flour", "1/4 cup finely crumbled Cotija cheese or feta", "3/4 teaspoons kosher salt", "Freshly ground black pepper", "4 scallions, white and pale-green parts only, minced (about 1/3 cup)", "1/4 cup chopped flat-leaf parsley", "1 large egg", "1 large egg yolk", "Vegetable or grapeseed oil (for frying)"], "instructions": ["Whisk mayonnaise, lime juice, 2 Tbsp. chile paste, parsley, and salt in a medium bowl. Season to taste with more chile paste, if desired. Cover and chill. DO AHEAD: Aioli can be made 1 day ahead. Keep chilled.", "Heat a dry medium saucepan over high heat. Add quinoa; cook, stirring constantly, until toasted and golden brown, about 5 minutes. Add 1 1/3 cups water; bring to a boil. Reduce to a simmer, cover, and cook until quinoa is tender and water is absorbed, 11–12 minutes. Remove from heat and let stand, covered, for 15 minutes. Uncover and let cool. Transfer to a large bowl.", "Add flour, cheese, and salt to quinoa; toss to coat. Season with pepper. Add scallions, parsley, egg, and egg yolk. Stir until a dough forms (mix gently to prevent quinoa from breaking apart).", "Scoop up some dough with a soup spoon; use a second spoon to scoop dough out of first spoon, smoothing and forming dough into an oval shape. Repeat until a football-like shape forms (in kitchen speak, what you've just made is called a quenelle). Alternatively, scoop out dough with a small ice cream scoop. Place quenelles on a large plate or baking sheet and repeat with remaining dough.", "Pour oil into a large heavy skillet to a depth of 1/2-inch. Heat oil over medium-high heat. Working in batches, place quenelles in oil and fry, turning occasionally, until cooked through and all sides are golden, 4–5 minutes. Using a slotted spoon, transfer fritters to paper towels to drain.", "Serve fritters warm with ají amarillo aioli alongside for dipping."]}, "Quinoa Tabbouleh ": {"ingredients": ["1 cup quinoa, rinsed well", "1/2 teaspoon kosher salt plus more", "2 tablespoons fresh lemon juice", "1 garlic clove, minced", "1/2 cup extra-virgin olive oil", "Freshly ground black pepper", "1 large English hothouse cucumber or 2 Persian cucumbers, cut into 1/4-inch pieces", "1 pint cherry tomatoes, halved", "2/3 cup chopped flat-leaf parsley", "1/2 cup chopped fresh mint", "2 scallions, thinly sliced"], "instructions": ["Bring quinoa, 1/2 tsp. salt, and 1 1/4 cups water to a boil in a medium saucepan over high heat. Reduce heat to medium-low, cover, and simmer until quinoa is tender, about 10 minutes. Remove from heat and let stand, covered, for 5 minutes. Fluff with a fork.", "Meanwhile, whisk lemon juice and garlic in a small bowl. Gradually whisk in olive oil. Season dressing to taste with salt and pepper.", "Add cucumber, tomatoes, herbs, and scallions to bowl with quinoa; toss to coat. Season to taste with salt and pepper. Drizzle remaining dressing over.", "DO AHEAD: Can be made 1 day ahead. Cover remaining dressing and quinoa separately; chill."]}, "Quinoa, Broccoli, and Feta Salad": {"ingredients": ["1 1/2 cups red or white quinoa, rinsed, drained", "1 pound broccoli, trimmed, cut into small florets", "9 tablespoons extra-virgin olive oil, divided", "Kosher salt and freshly ground black pepper", "3 tablespoons fresh lemon juice", "2 tablespoons unseasoned rice vinegar", "1/4 cup thinly sliced shallot", "1/2 cup coarsely chopped flat-leaf parsley", "1/2 cup coarsely chopped fresh cilantro", "1/2 cup coarsely chopped fresh mint", "4 ounces feta, cut into 1/4-inch cubes", "4 tablespoons pine nuts, toasted, divided"], "instructions": ["Preheat oven to 450°. Bring quinoa and 4 cups water to a boil in a medium saucepan. Cover, reduce heat to medium-low, and simmer until quinoa is tender but not mushy, 12–15 minutes for red quinoa or 8–10 minutes for white. Drain; return quinoa to hot saucepan. Cover and let sit for 15 minutes. Fluff with a fork and transfer to a large bowl.", "Meanwhile, toss broccoli with 2 Tbsp. oil on a rimmed baking sheet. Season with salt and pepper and toss to evenly coat broccoli. Roast, stirring occasionally, until nicely browned and cooked through, about 15 minutes. Let cool slightly; add to bowl with quinoa.", "Whisk remaining 7 Tbsp. oil, lemon juice, vinegar, and shallot in a small bowl. Season to taste with salt and pepper. Add parsley, cilantro, mint, feta, and 2 Tbsp. pine nuts to quinoa; pour vinaigrette over. Mix well. Season to taste with salt and pepper and garnish with remaining 2 Tbsp. pine nuts."]}, "Quinoa Salad with Peas and Cashews ": {"ingredients": ["1/3 cup fresh lime juice", "1/4 cup olive oil", "4 teaspoons finely grated lemon zest", "1 teaspoon honey", "1 small garlic clove, minced", "1/2 teaspoon sea salt", "1 cup quinoa (white, black, red, or a mix), rinsed well", "Kosher salt", "2 cups fresh (or frozen, thawed) peas", "1 1/2 cups chopped fresh cilantro leaves and stems, divided", "1 cup toasted cashews", "5 scallions, thinly sliced", "Freshly ground black pepper"], "instructions": ["Combine all ingredients in a jar; cover with a lid and shake vigorously to blend. Set aside.", "Bring quinoa, a large pinch of salt, and 2 cups water to a boil in a medium pot. Reduce heat to low, cover, and cook until water is absorbed, 15–20 minutes. Transfer to a large bowl. Let cool; fluff with a large fork.", "Cook peas in a large saucepan of boiling salted water until crisp-tender, 2–3 minutes. Drain; run under cold water to cool and drain well. Add cooked peas, 1 cup cilantro, cashews, and scallions to quinoa and stir.", "Drizzle dressing over salad; toss to coat. Season to taste with salt and pepper. Garnish with remaining ½ cup cilantro."]}, "Quinoa, Fennel, and Pomegranate Salad": {"ingredients": ["1/4 cup plus 1 tablespoon olive oil", "2 medium fennel bulbs (2 1/2 pounds), cut lengthwise into 1/4'-thick slices", "Kosher salt and freshly ground black pepper", "2 tablespoons fresh lemon juice", "1 1/2 teaspoons ground cumin", "1 teaspoon sugar", "1 cup quinoa, rinsed", "1 lemon", "1 serrano chile, seeded, chopped", "1/2 cup chopped fresh cilantro", "1/2 cup chopped fresh mint", "1 teaspoon chopped fresh dill", "1/4 cup pomegranate seeds (from 1/2 small pomegranate)"], "instructions": ["Heat 1/4 cup oil in a large skillet over medium heat. Add fennel; season with salt and pepper. Cook, stirring occasionally, until fennel is just tender and lightly golden, 10–12 minutes. Stir in lemon juice, cumin, and sugar; cook for 1 minute. Season with salt and pepper. Set aside.", "Meanwhile, bring quinoa and 3 cups water to a boil in a medium saucepan. Cover, reduce heat to low, and simmer until quinoa is cooked, about 10 minutes. Drain; return to pan. Cover; let sit for 15 minutes. Fluff with a fork; transfer to a large bowl.", "Using a small sharp knife, cut all peel and white pith from lemon. Cut between membranes to release segments; discard membranes and roughly chop. Add lemon with any juices and remaining 1 Tbsp. oil to quinoa; stir. Add fennel mixture, chile, and herbs. Toss gently to incorporate. Season with salt and pepper. Transfer salad to a platter; sprinkle with pomegranate seeds."]}, "Quinoa and Spring Vegetable Pilaf": {"ingredients": ["1 1/2 cups quinoa, well rinsed", "1 cup vegetable broth", "2 cups frozen petite peas, thawed, divided", "5 tablespoons chopped fresh mint leaves, divided", "1 garlic clove, peeled", "3 tablespoons butter", "1 large leek (white and pale green parts only), halved, thinly sliced (about 1 cup)", "3/4 cup sliced shallots", "8 ounces fresh shiitake mushrooms, stemmed, thickly sliced", "1 14-ounce bunch asparagus, trimmed, cut on diagonal into 1-inch pieces"], "instructions": ["Bring 2 1/2 cups water to boil in small saucepan. Add quinoa and 1 teaspoon salt; return to boil, then reduce heat to low, cover, and simmer until quinoa is tender and water is absorbed, 15 to 17 minutes. Drain if necessary.", "Puree broth, 1 cup peas, 4 tablespoons mint, and garlic in blender until smooth.", "Melt butter in large nonstick skillet over medium heat. Add leek and shallots; sauté until soft and light brown, about 4 minutes. Stir in mushrooms, then asparagus; sauté until mushrooms are tender and asparagus is crisp-tender, about 5 minutes. Mix in puree and 1 cup peas; stir until heated through, about 2 minutes. Add quinoa; stir to coat.", "Divide pilaf among bowls; sprinkle with remaining 1 tablespoon mint and serve."]}, "Quick Coq au Vin": {"ingredients": ["4 bacon slices, coarsely chopped", "4 skinless boneless chicken breast halves", "3 tablespoons chopped fresh Italian parsley, divided", "8 ounces large crimini (baby bella) mushrooms, halved", "8 large shallots, peeled, halved through root end", "2 garlic cloves, pressed", "1 1/2 cups dry red wine (such as Syrah)", "1 1/2 cups low-salt chicken broth, divided", "4 teaspoons all purpose flour"], "instructions": ["Preheat oven to 300°F. Sauté bacon in large nonstick skillet over medium-high heat until crisp. Using slotted spoon, transfer to bowl.", "Sprinkle chicken with salt, pepper, and 1 tablespoon parsley. Add to drippings in skillet. Sauté until cooked through, about 6 minutes per side; transfer to pie dish (reserve skillet). Place in oven to keep warm.", "Add mushrooms and shallots to skillet; sprinkle lightly with salt and pepper. Sauté until brown, about 4 minutes. Add garlic; toss 10 seconds. Add wine, 1 1/4 cups broth, bacon, and 1 tablespoon parsley. Bring to boil, stirring occasionally. Boil 10 minutes.", "Meanwhile, place flour in small cup. Add 1/4 cup broth, stirring until smooth.", "Add flour mixture to sauce. Cook until sauce thickens, 3 to 4 minutes. Season sauce to taste with salt and pepper.", "Arrange chicken on platter; stir juices from pie dish into sauce and spoon over chicken. Sprinkle with 1 tablespoon parsley."]}, "Quick-Preserved Lemon": {"ingredients": ["1 large lemon, cut crosswise into 1/4-inch-thick rounds", "1/2 cup fresh lemon juice", "1 tablespoon coarse sea salt"], "instructions": ["Combine all ingredients in small skillet. Bring to boil over high heat, stirring to dissolve salt. Cover; reduce heat to low. Simmer until lemon slices are almost tender (peel will look translucent), about 10 minutes. Cool. DO AHEAD Can be made 1 week ahead. Transfer to bowl. Cover; chill."]}, "Quick-Brined Grilled Pork Chops with Treviso and Balsamic Glaze": {"ingredients": ["3 tablespoons coarse kosher salt", "1 1/2 tablespoons sugar", "4 3/4- to 1-inch-thick pork rib chops", "1 head of Treviso radicchio", "1 head of Belgian endive", "3 tablespoons (about) extra-virgin olive oil", "3/4 cup balsamic vinegar", "1 tablespoon butter", "Chopped fresh Italian parsley"], "instructions": ["Prepare barbecue (medium-high heat).", "Mix 1 1/2 cups water, coarse salt, and sugar in 11x7x2-inch glass baking dish; stir until salt and sugar dissolve. Add pork chops; let brine 20 minutes, turning occasionally.", "Cut Treviso and endive lengthwise into quarters, keeping some core attached to each piece. Place on baking sheet; brush with some oil. Sprinkle with salt and pepper. Boil vinegar in small skillet until reduced to 1/4 cup, about 5 minutes. Whisk in butter. Season glaze with salt and pepper.", "Remove pork from brine; pat dry. Brush with oil; sprinkle with pepper. Grill pork, Treviso, and endive until vegetables are softened and thermometer inserted horizontally into center of chops registers 150°F, 2 to 3 minutes per side for vegetables and 7 to 8 minutes per side for chops.", "Transfer pork and vegetables to plates. Drizzle glaze over; sprinkle with parsley."]}, "Quick-Pickled Cherry Tomatoes with Dill": {"ingredients": ["3/4 cup apple cider vinegar", "3/4 cup water", "4 teaspoons coarse kosher salt", "2 teaspoons sugar", "1 3x1/2-inch strip lemon peel (yellow part only, removed with vegetable peeler)", "12 ounces cherry tomatoes, grape tomatoes, and/or pear tomatoes", "1/4 cup coarsely chopped fresh dill", "2 garlic cloves, thinly sliced", "1/4 teaspoon dried crushed red pepper"], "instructions": ["Pour vinegar and 3/4 cup water into small saucepan. Add salt, sugar, and lemon peel. Bring to boil, stirring to dissolve sugar and salt. Remove from heat. Let cool 20 minutes.", "Pierce each tomato 2 times with slender wooden skewer. Toss tomatoes, dill, garlic, and crushed red pepper in large bowl. Add cooled vinegar mixture. Let stand at room temperature at least 2 hours and up to 8 hours."]}, "Quinoa, Garbanzo, and Spinach Salad with Smoked Paprika Dressing": {"ingredients": ["1 1/2tcups quinoa (9 to 10 ounces), rinsed, drained", "4 cups (packed) baby spinach leaves", "2 15- to 16-ounce cans garbanzo beans (chickpeas), rinsed, drained", "1 3/4 cups 1/3-inch cubes unpeeled English hothouse cucumber", "1 1-pint container multicolored baby heirloom tomatoes, halved (2 1/2 cups)", "1 cup (packed) fresh mint leaves", "1 1/2tcups coarsely crumbled feta cheese (about 7 ounces), divided", "1/4 cup Sherry wine vinegar", "2 1/2tteaspoons smoked paprika", "1/2 cup olive oil"], "instructions": ["Place quinoa in large saucepan; add enough salted water to cover quinoa by 1 inch. Bring to boil. Reduce heat to medium-low; cover and simmer until quinoa is tender, 15 to 16 minutes. Drain. Chill until cool.", "Meanwhile, combine spinach leaves, garbanzos, cubed cucumber, halved tomatoes, mint leaves, and half of feta cheese in extra-large bowl. Add cooled quinoa and toss gently to blend.", "Whisk vinegar and smoked paprika in small bowl. Gradually whisk in oil. Season dressing with salt and pepper. Pour dressing over salad; toss to coat. Season generously with salt and pepper. Sprinkle remaining feta over."]}, "Queen's Park Swizzle": {"ingredients": ["1/4 cup sugar", "1/4 cup water", "24 fresh mint leaves, divided", "3 tablespoons fresh lime juice, divided", "1/2 cup white rum, divided", "4 cups (about) crushed ice, divided", "1 teaspoon angostura bitters, divided"], "instructions": ["Bring sugar and 1/4 cup water to boil in small saucepan, stirring until sugar dissolves. Boil 1 minute. Transfer simple syrup to small bowl and chill until cold.", "Place 2 highball glasses in freezer to chill 15 minutes. Combine 12 mint leaves, 1 1/2 tablespoons lime juice, and 1 1/2 tablespoons simple syrup in each chilled highball glass. Using muddler or handle of wooden spoon, mash mint mixture in each glass until mint begins to break apart. Add 1/4 cup rum, then 1 cup crushed ice to each glass; swizzle or stir to blend. Add more crushed ice to each glass to fill glass completely, mounding at top of glass. Drizzle 1/2 teaspoon angostura bitters over top of ice in each glass and serve with straw."]}, "Queimada (Flaming Galician Punch)": {"ingredients": ["3 lemons", "3 cups grappa*", "1 cup sugar", "2 tablespoons whole coffee beans", "6 cinnamon sticks, broken in half"], "instructions": ["Using vegetable peeler, remove peel from lemons in long strips (yellow part only). Place in heavy large pot, keeping lid handy. Add grappa, sugar, coffee beans, and cinnamon sticks to pot. Stir over medium-low heat until sugar dissolves. Turn off heat. Standing back and using long match or ignition-style lighter, set grappa on fire. Allow to burn until flame turns blue, about 3 minutes. Cover pot with lid to extinguish flame (if flame becomes too high, use lid to extinguish flame earlier). Ladle into cordial glasses and serve."]}, "Quick Chicken Paella with Sugar Snap Peas": {"ingredients": ["½ cup dry white wine", "½ teaspoon saffron threads", "1½ teaspoons kosher salt", "1¼ teaspoons smoked paprika", "1 teaspoon freshly ground black pepper", "6 large chicken thighs with skin and bones, excess skin and fat trimmed (about 2½ pounds)", "4 ounces ¼-inch-thick slices fully cooked smoked Spanish chorizo", "1 tablespoon olive oil", "1½ cups chopped onion (about 1 large)", "4 garlic cloves, minced", "1½ cups long-grain rice", "2 cups low-sodium chicken broth", "1 14.5-ounce can diced tomatoes in juice", "¼ cup chopped roasted red peppers from jar", "2½ cups sugar snap peas, trimmed (about 8 ounces)"], "instructions": ["Preheat oven to 400°F. Mix white wine and saffron threads in small measuring cup; set aside. Combine salt, smoked paprika, and black pepper in small bowl; rub spice mixture all over chicken thighs. Heat heavy large ovenproof skillet over medium-high heat. Add chorizo and sauté until fat begins to render and sausage browns, stirring occasionally, about 3 minutes. Transfer chorizo to large plate. Add olive oil to skillet. Add chicken thighs to skillet and cook until browned, about 4 minutes per side. Transfer chicken to plate with chorizo.", "Pour off all but 1 tablespoon drippings from skillet. Reduce heat to medium. Add chopped onion and cook until translucent, stirring often, about 5 minutes. Add minced garlic and stir 30 seconds. Add long-grain rice and stir to coat. Add wine-saffron mixture and bring to boil, scraping up browned bits from bottom of skillet. Add chicken broth, tomatoes with juice, and roasted red peppers. Bring to simmer. Stir in browned chorizo. Place chicken thighs, skin side up, atop mixture in skillet. Cover skillet tightly with foil, then cover skillet with lid. Bake paella until rice is almost tender, about 25 minutes.", "Transfer chicken to plate. Stir rice; season to taste with salt and pepper. Scatter snap peas over. Return chicken to skillet, nestling into rice. Cover with foil and lid. Bake until snap peas are crisp-tender, rice is tender, and chicken is cooked through, about 10 minutes longer."]}, "Quinoa Risotto with Mushrooms and Thyme": {"ingredients": ["1 cup quinoa, rinsed", "1 tablespoon olive oil", "1 1/2 cups chopped onion", "1 garlic clove, pressed", "1 8-ounce package sliced crimini (baby bella) mushrooms", "6 ounces fresh shiitake mushrooms, stemmed, sliced", "3 teaspoons chopped fresh thyme, divided", "1 cup dry white wine", "Grated Parmesan cheese"], "instructions": ["Bring 2 cups salted water to boil in medium saucepan. Add quinoa, reduce heat to medium-low, cover, and simmer until tender and water is absorbed, about 13 minutes.", "Meanwhile, heat oil in large skillet over medium-high heat. Add onion and sauté until onion begins to brown, 5 minutes. Add garlic; stir 30 seconds. Add mushrooms and thyme. Sauté until mushrooms are tender, 6 minutes. Add wine; stir until reduced and syrupy, 2 minutes.", "Mix quinoa into mushroom mixture; season with salt and pepper. Pass cheese separately."]}, "Quinoa Pasta with Spinach and Tomatoes": {"ingredients": ["1 8-ounce package gluten-free quinoa spaghetti", "2 tablespoons olive oil", "2 10- to 12-ounce containers grape tomatoes or cherry tomatoes", "3 garlic cloves, pressed", "2 5- to 6-ounce packages baby spinach", "6 tablespoons finely grated Parmesan cheese, divided", "3 teaspoons chopped fresh marjoram, divided", "1/4 teaspoon dried crushed red pepper", "Additional finely grated Parmesan cheese"], "instructions": ["Cook pasta in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain, reserving 1/2 cup pasta cooking liquid. Return cooked pasta to same pot.", "Meanwhile, heat oil in heavy large skillet over medium-high heat. Add tomatoes; sprinkle with salt and freshly ground black pepper and sauté until beginning to soften and brown in spots, 3 to 4 minutes. Add garlic; stir 30 seconds.", "Add 1/4 cup reserved pasta cooking liquid to skillet and stir, scraping up browned bits. Add tomato mixture with juices, spinach, 4 tablespoons cheese, 2 teaspoons marjoram, and crushed red pepper to pasta in pot; toss over low heat just until spinach begins to wilt, adding more pasta cooking liquid by tablespoonfuls if dry, about 2 minutes. Season to taste with salt and pepper. Transfer to large bowl; sprinkle with 2 tablespoons cheese and remaining 1 teaspoon marjoram. Serve, passing additional cheese."]}, "Quick Sautéed Kale with Toasted Pine Nuts": {"ingredients": ["4 bunches kale (about 2 pounds)", "1/4 cup olive oil", "1 large red onion, chopped", "2 garlic cloves, minced", "1/3 cup pine nuts, toasted"], "instructions": ["Fold each kale leaf lengthwise in half; cut stem away along crease. Tear leaves coarsely. DO AHEAD Can be prepared 1 day ahead. Pack kale into resealable plastic bags and chill.", "Heat oil in heavy large pot over medium-high heat. Add onion and garlic; sauté until onion is soft, about 6 minutes. Add half of kale, packing slightly. Cook until kale wilts, tossing often, 2 to 3 minutes. Add remaining kale and half of pine nuts. Toss until kale is just tender and still bright green, about 3 minutes longer. Season to taste with salt and pepper. Transfer to bowl. Sprinkle with remaining toasted pine nuts and serve."]}, "Quince-Date Chutney": {"ingredients": ["1/2 cup apple cider vinegar", "1/2 cup (packed) golden brown sugar", "3 large quinces (about 21 ounces), peeled, quartered, cored, cut into 1/2-inch dice", "2 large Granny Smith apples (about 24 ounces), peeled, quartered, cored, cut into 1/2-inch dice", "1/2 cup water", "2 tablespoons minced peeled fresh ginger", "2 teaspoons ground coriander", "1 teaspoon ground cardamom", "1 teaspoon salt", "1 cinnamon stick, broken in half", "1 teaspoon minced serrano chile with seeds", "1 cup coarsley chopped pitted Medjool dates (about 7 ounces)", "2 tablespoons fresh lime juice"], "instructions": ["Combine vinegar and brown sugar in heavy large saucepan. Bring to boil over medium heat, stirring until sugar dissolves. Add quinces; cover and simmer until quinces are tender and liquid is absorbed, stirring occasionally, about 20 minutes. Add apples, 1/2 cup water, ginger, coriander, cardamom, salt, cinnamon stick, and chile; bring to simmer over medium heat. Cover and simmer until apples are tender, about 10 minutes. Stir in dates and lime juice. Transfer chutney to bowl and cool. Cover and refrigerate overnight. DO AHEAD: Can be prepared 2 weeks ahead. Keep refrigerated. Bring to room temperature before serving."]}, "Quick Omega-3 Granola ": {"ingredients": ["4 tablespoons walnut oil, divided", "3/4 cup (packed) dark brown sugar", "1/4 cup egg whites", "1/2 teaspoon (scant) coarse kosher salt", "3 cups organic old-fashioned oats", "1 cup walnut halves, broken in half", "1/2 cup flaxseed meal*", "1 cup pitted dates, coarsely chopped or torn into pieces", "1/4 cup honey"], "instructions": ["Preheat oven to 350°F. Brush heavy large rimmed baking sheet with 2 tablespoons oil. Whisk 2 tablespoons oil, sugar, egg whites, and salt in large bowl. Add oats, walnuts, and flaxseed; toss well.", "Spread mixture evenly on prepared sheet. Bake 15 minutes. Using metal spatula, stir granola. Bake 15 minutes longer. Stir again. Sprinkle dates over; drizzle with honey. Bake until golden brown, about 10 minutes longer. Stir to loosen. Transfer to clean baking sheet to cool completely. DO AHEAD Can be made 1 week ahead. Keep chilled in airtight container.", "*Ground flaxseeds; available at natural foods stores."]}, "Quince and Cranberry Sauce": {"ingredients": ["5 quinces (2 to 2 1/4 pounds), peeled, cored, cut into 1-inch chunks", "3 cups water", "1 1/2 cups sugar", "3 1/2 tablespoons fresh lemon juice", "2 teaspoons finely grated lemon peel", "", "1 1/4 cups fresh or frozen cranberries (about 4 ounces)", "1/4 teaspoon coarse kosher salt"], "instructions": ["Bring first 5 ingredients to boil in heavy large saucepan over medium-high heat, stirring until sugar dissolves. Reduce heat to medium-low. Cover and simmer until quinces are soft, stirring occasionally, about 20 minutes. Pour mixture into large strainer set over bowl; reserve juices.", "Return quince mixture to same saucepan; mash with potato masher. Add cranberries; cook over medium heat until most of berries burst, stirring frequently, about 8 minutes. Stir in salt. Transfer sauce to bowl. Cover and refrigerate sauce and reserved juices separately until cold, about 3 hours. DO AHEAD Can be made 2 days ahead. Keep chilled. Before serving, stir enough reserved juices into sauce to thin to desired consistency. Serve sauce cold or at room temperature."]}, "Quince Tarte Tatin": {"ingredients": ["1 1/2 cups all purpose flour", "1 1/2 tablespoons sugar", "1 teaspoon salt", "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes", "3 tablespoons (or more) ice water", "1 1/2 teaspoons cider vinegar", "1 cup sugar", "1/4 cup water", "1 tablespoon honey", "5 tablespoons unsalted butter, room temperature", "1/2 teaspoon ground cinnamon", "8 small quinces (about 3 1/4 pounds), peeled, each cut into 1-inch-wide wedges, cored"], "instructions": ["Mix first 3 ingredients in processor. Using on/off turns, cut in butter until mixture resembles coarse meal. Mix 3 tablespoons ice water and vinegar in small bowl; add to processor. Blend until moist clumps form, adding more ice water by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap in plastic; refrigerate at least 1 hour. DO AHEAD: Can be made 1 day ahead. Keep refrigerated. Soften slightly at room temperature before rolling out.", "Fill large skillet with ice cubes; set aside.", "Combine first 3 ingredients in heavy 11-inch-diameter ovenproof skillet. Stir over medium heat until sugar dissolves. Increase heat to medium-high; boil until caramel is deep amber color, occasionally brushing down sides of skillet with wet pastry brush and swirling skillet, about 8 minutes. Remove from heat; stir in butter and cinnamon. Immediately place skillet with caramel atop ice in large skillet; let stand until caramel is cold and hardened, about 30 minutes. Remove skillet from ice.", "Position rack in center of oven; preheat to 400°F. Arrange quince wedges tightly together, rounded side down, in concentric circles atop caramel in skillet. Fill center with any broken quince pieces. Roll out dough on lightly floured surface to 12 1/2-inch round. Place dough atop quinces; tuck edges of dough down around sides of quinces. Make three 2-inch-long cuts in center of dough to allow steam to escape during baking. Place skillet on rimmed baking sheet. Bake until quinces are tender and crust is deep golden brown, about 1 hour 15 minutes. Remove from oven; let cool 30 minutes.", "Place large platter atop skillet. Using oven mitts, hold platter and skillet firmly together and invert, allowing tart to slide out onto platter. Rearrange any dislodged quince wedges, if necessary. Serve warm or at room temperature."]}, "Quick Sausage and Mushroom Lasagna": {"ingredients": ["2 tablespoons olive oil", "2 8-ounce packages sliced crimini (baby bella) mushrooms", "1 large onion, chopped (about 2 cups)", "2 tablespoons dried Italian seasoning blend", "1 pound hot Italian sausages, casings removed", "3 garlic cloves, pressed", "1 cup dry red wine", "4 2/3 cups marinara sauce (from two 26-ounce jars)", "1 9-ounce package no-cook lasagna noodles", "1 15-ounce container ricotta cheese", "2 8-ounce bags Italian blend grated cheese (4 cups)"], "instructions": ["Preheat oven to 400°F. Heat oil in heavy large pot over high heat. Add mushrooms, onion, and seasoning blend; sauté until vegetables begin to soften, about 6 minutes. Add sausage and sauté until brown and cooked through, breaking up with back of spoon, about 5 minutes. Add garlic and stir 1 minute. Add wine; cook until almost all liquid evaporates, scraping up browned bits, about 2 minutes. Set aside.", "Spread 2/3 cup marinara sauce over bottom of 13x9x2-inch baking dish. Place noodles (about 4) over sauce, forming 1 layer (noodles may overlap slightly). Spread 1 cup sauce over noodles. Top with 1/3 of ricotta, then 1 cup grated cheese. Spoon 1/3 of sausage mixture over. Repeat 2 more times with noodles, sauce, ricotta, grated cheese, and sausage mixture. Cover with 4 more noodles. Spoon remaining 1 cup sauce over; sprinkle remaining 1 cup grated cheese over. Cover with foil, tenting in center to prevent cheese from touching foil. Bake lasagna 45 minutes; remove foil. Bake until bubbling at edges and cheese is browned, about 10 minutes longer. Let stand 15 minutes."]}, "Quick Tartar Sauce": {"ingredients": ["1 cup mayonnaise", "6 tablespoons sweet pickle relish or finely chopped bread-and-butter pickles", "2 tablespoons fresh lemon juice"], "instructions": ["Mix all ingredients in small bowl. Cover; chill."]}, "Quinoa with Black Beans and Cilantro": {"ingredients": ["1 tablespoon vegetable oil", "2 cups chopped white onions", "1 cup chopped red bell pepper", "1 cup quinoa,* rinsed, drained", "2 teaspoons chili powder", "1/2 teaspoon ground cumin", "1/2 teaspoon salt", "1 1/2 cup water", "1 15-ounce can black beans, rinsed, drained", "1/2 cup chopped fresh cilantro, divided", "Crumbled Cotija cheese or feta cheese (optional)"], "instructions": ["Heat oil in heavy medium saucepan over medium-high heat. Add onions and red pepper; sauté until beginning to soften, about 5 minutes. Stir in next 4 ingredients. Add water; bring to boil. Cover, reduce heat to medium-low, and simmer until quinoa is almost tender, about 14 minutes. Add beans and 1/4 cup cilantro; cook uncovered until heated through and liquid is fully absorbed, about 3 minutes. Transfer to bowl; sprinkle with 1/4 cup cilantro and cheese, if desired.", "*A grain with a delicate flavor and a texture similar to that of couscous; available at natural foods stores."]}, "Quinoa with Grilled Zucchini, Garbanzo Beans, and Cumin": {"ingredients": ["1 15-ounce can garbanzo beans (chickpeas), drained", "3 tablespoons fresh lemon juice", "5 tablespoons extra-virgin olive oil, divided", "2 garlic cloves, peeled", "2 teaspoons cumin seeds", "1 teaspoon turmeric, divided", "1 teaspoon smoked paprika,* divided", "2 cups water", "1 cup quinoa (about 6 ounces),** rinsed well, drained", "1 teaspoon coarse kosher salt", "1 1/2 pounds medium zucchini (about 5), trimmed, quartered lengthwise", "1 1/2 teaspoons ground cumin", "4 green onions, thinly sliced", "1/4 cup chopped fresh Italian parsley"], "instructions": ["Combine garbanzo beans and lemon juice in large bowl. Add 3 tablespoons oil; press in garlic and stir to combine. Let marinate at least 15 minutes and up to 2 hours.", "Heat 1 tablespoon oil in medium saucepan over medium-high heat. Add cumin seeds, 1/2 teaspoon turmeric, and 1/2 teaspoon paprika; stir until fragrant, about 1 minute. Add 2 cups water, quinoa, and coarse salt; bring to simmer, stirring occasionally. Reduce heat to medium-low. Cover and simmer until all water is absorbed, about 16 minutes.", "Meanwhile, prepare barbecue (medium high heat). Place zucchini on rimmed baking sheet. Drizzle with 1 tablespoon oil. Sprinkle with ground cumin, 1/2 teaspoon turmeric, and 1/2 teaspoon paprika. Toss to coat evenly.", "Place zucchini on grill; sprinkle generously with salt and pepper. Grill until tender and browned on all sides, 10 to 12 minutes. Transfer to work surface. Cut crosswise into 1/2-inch pieces. Add zucchini, green onions, and parsley, then garbanzo bean mixture to quinoa. Toss to blend. Season with salt and pepper. DO AHEAD Can be made 2 hours ahead. Let stand at room temperature."]}, "Quick Brie and Olive Pizza": {"ingredients": ["1 refrigerated pie crust, room temperature", "1 1/2 tablespoons Dijon mustard", "1 8-ounce Brie cheese, rind removed, cheese cut into 1/2-inch cubes", "2 plum tomatoes, halved crosswise, seeded, cut into thin rounds", "10 Kalamata olives or other brine-cured black olives, pitted, halved", "2 tablespoons minced red onion", "1 tablespoon minced fresh oregano", "2 tablespoons coarsely grated Parmesan cheese"], "instructions": ["Preheat oven to 400°F. Unfold crust on lightly floured rimless baking sheet. Fold 1/2 inch of edge over; crimp decoratively. Spread crust with mustard; sprinkle with half of Brie. Top with tomatoes, then olives. Sprinkle with onion, remaining Brie and oregano, then Parmesan cheese. Bake pizza until crust is crisp and cheeses melt, about 20 minutes."]}, "Quick & Spicy Asian Pickles": {"ingredients": ["1/4 cup rice vinegar", "4 teaspoons sugar", "1 teaspoon soy sauce", "1 teaspoon fish sauce", "1/2 teaspoon dried crushed red pepper", "2 small English hothouse cucumbers"], "instructions": ["Whisk rice vinegar, sugar, soy sauce, fish sauce, and crushed red pepper in large bowl. DO AHEAD: Can be made 1 day ahead; cover and chill. Slice cucumbers crosswise into 1/4-inch-thick rounds. Add cucumber slices to vinegar mixture; toss. Cover and chill ten minutes to 1 hour, tossing occassionally."]}, "Quick Chocolate-Cinnamon Mousse with Cherries": {"ingredients": ["8 ounces fresh Bing cherries, pitted", "1/3 cup black cherry preserves or other cherry preserves", "1/3 cup ruby Port or cherry juice", "1 1/4 cups chilled heavy whipping cream, divided", "1/8 teaspoon (generous) ground cinnamon", "4 ounces bittersweet or semisweet chocolate, chopped"], "instructions": ["Combine cherries, cherry preserves, and Port in heavy small saucepan. Bring to boil over high heat. Reduce heat to medium and boil until juices thicken to syrup consistency, stirring frequently, about 10 minutes. Remove from heat. Transfer to small bowl and chill until cold, about 3 hours. DO AHEAD Can be made 1 day ahead. Cover and keep chilled.", "Combine 1/4 cup cream and cinnamon in small saucepan; bring to boil. Remove from heat. Add chocolate and whisk until melted and smooth. Transfer chocolate mixture to large bowl. Using electric mixer, beat remaining 1 cup cream in medium bowl until soft peaks form. Fold 1/4 of whipped cream into lukewarm chocolate mixture. Fold remaining whipped cream into chocolate mixture in 3 additions just until incorporated. Divide mousse among 4 glasses or bowls. Chill until set, about 4 hours. DO AHEAD Can be made 1 day ahead. Cover; keep chilled.", "Spoon cherries with syrup atop mousse and serve."]}, "Quickest Madeira-Mushroom Gravy ": {"ingredients": ["2 tablespoons olive oil", "1 large chopped onion", "2 cups sliced and stemmed shiitake mushrooms", "1/3 cup Madeira", "1 tablespoon chopped fresh rosemary", "2 cups purchased high-quality gravy", "1 cup low-salt chicken broth", "1/2 cup whipping cream", "Salt", "Pepper"], "instructions": ["Heat oil in large saucepan; add onion. Sauté until golden. Add mushrooms; sauté until soft. Add Madeira, rosemary, gravy, chicken broth, and whipping cream. Simmer 5 minutes, whisking constantly. Season with salt and pepper."]}, "Quick Collard Greens with Merguez Sausage and Couscous": {"ingredients": ["2 pounds collard greens, stemmed", "", "1 1/2 pounds merguez sausage links", "1/2 cup water", "", "2 tablespoons olive oil", "1 cup chopped onion", "1/4 teaspoon dried crushed red pepper", "1 garlic clove, minced", "1/4 teaspoon ground cumin", "1/4 teaspoon ground cinnamon", "1/2 cup dried currants", "", "1/4 cup chopped fresh cilantro", "2 tablespoons unsalted butter", "10 ounces plain couscous, cooked according to package directions"], "instructions": ["Bring large pot of salted water to boil; add collard greens and boil until soft, about 2 minutes. Drain, reserving 1 cup cooking liquid. Cool greens slightly and cut into 1-inch strips.", "Place sausages and 1/2 cup water in heavy large skillet. Cook over medium heat until water evaporates and sausages start to brown, about 12 minutes. Continue cooking until sausages are cooked through, 12 to 15 minutes longer, depending on size of links.", "Meanwhile, heat oil in another heavy large skillet over medium heat. Add onion and sauté until translucent, about 5 minutes. Add dried crushed red pepper and next 3 ingredients; stir 1 minute. Add greens and cook 5 minutes, stirring occasionally. Stir in currants. Add reserved 1 cup cooking liquid to skillet; bring to simmer. Partially cover pan and cook until liquid has reduced slightly, about 5 minutes. Season to taste with salt and pepper.", "Stir cilantro and butter into hot couscous; divide among plates. Top with greens and sausages.", "Merguez sausage is a spicy North African-style blend of lamb and beef. Different-size links are available at some specialty foods stores and from Surfas (310-559-4770; surfasonline.com)."]}, "Quinoa with Moroccan Winter Squash and Carrot Stew": {"ingredients": ["2 tablespoons olive oil", "1 cup chopped onion", "3 garlic cloves, chopped", "2 teaspoons Hungarian sweet paprika", "1 teaspoon salt", "1/2 teaspoon ground black pepper", "1/2 teaspoon ground coriander", "1/2 teaspoon ground cumin", "1/2 teaspoon turmeric", "1/2 teaspoon ground ginger", "1/2 teaspoon cayenne pepper", "Pinch of saffron", "1 cup water", "1 14 1/2-ounce can diced tomatoes, drained", "2 tablespoons fresh lemon juice", "3 cups 1-inch cubes peeled butternut squash (from 1 1/2 pound squash)", "2 cups 3/4-inch cubes peeled carrots", "1 cup quinoa*", "1 tablespoon butter", "1 tablespoon olive oil", "1/2 cup finely chopped onion", "1/4 cup finely chopped peeled carrot", "2 garlic cloves, minced", "1/2 teaspoon salt", "1/2 teaspoon turmeric", "2 cups water", "1/2 cup chopped fresh cilantro, divided", "2 teaspoons chopped fresh mint, divided"], "instructions": ["Heat oil in large saucepan over medium heat. Add onion; sauté until soft, stirring often, about 5 minutes. Add garlic; stir 1 minute. Mix in paprika and next 8 ingredients. Add 1 cup water, tomatoes, and lemon juice. Bring to boil. Add squash and carrots. Cover and simmer over medium-low heat until vegetables are tender, stirring occasionally, about 20 minutes. Season with salt and pepper. (Can be prepared 1 day ahead. Cover and chill.)", "Rinse quinoa; drain. Melt butter with oil in large saucepan over medium heat. Add onion and carrot. Cover; cook until vegetables begin to brown, stirring often, about 10 minutes. Add garlic, salt, and turmeric; sauté 1 minute. Add quinoa; stir 1 minute. Add 2 cups water. Bring to boil; reduce heat to medium-low. Cover; simmer until liquid is absorbed and quinoa is tender, about 15 minutes.", "Rewarm stew. Stir in half of cilantro and half of mint. Spoon quinoa onto platter, forming well in center. Spoon stew into well. Sprinkle remaining herbs over."]}, "Quick Cioppino": {"ingredients": ["3 tablespoons olive oil", "2 cups finely chopped onions", "2 large garlic cloves, minced", "2 teaspoons chopped fresh rosemary", "1/4 teaspoon dried crushed red pepper", "1 2/3 cups canned crushed tomatoes in puree (from one 28-ounce can)", "2 8-ounce bottles clam juice", "3/4 cup dry white wine", "12 ounces halibut fillets, cut into 1-inch pieces", "1/2 pound uncooked peeled deveined medium shrimp", "1/2 pound bay scallops", "1/3 cup chopped fresh parsley, divided"], "instructions": ["Heat oil in large pot over medium-high heat. Add next 4 ingredients; sauté 6 minutes. Add tomatoes, clam juice, and wine; bring to boil. Reduce heat to medium; simmer 18 minutes, stirring occasionally. Add all seafood and 2 tablespoons parsley. Simmer until seafood is opaque in center, about 3 minutes. Season to taste with salt and pepper, ladle into bowls, and sprinkle with parsley."]}, "Quince and Currant Chutney": {"ingredients": ["1 pound", "1 1/2 cups", "1 1/2 cups", "1/2 cup", "1/2 cup", "1/2 cup", "1/4 cup", "2 teaspoons", "1", "1 teaspoon", "1/2 teaspoon", "1/2 teaspoon", "1/8 teaspoon salt"], "instructions": []}, "Quick Chunky Plum and Cherry Jam": {"ingredients": ["1 1/2 pounds dark-skinned plums (about 6 large), quartered, pitted", "1 cup sweet cherries, pitted", "1 cup sugar", "3/4 teaspoon ground allspice"], "instructions": ["Mix plums, cherries, sugar, and allspice in heavy large saucepan. Cover and cook over low heat until sugar dissolves and juices form, stirring occasionally, about 15 minutes. Uncover and increase heat to medium. Cook until plums start to fall apart and preserves are thickened and reduced to 2 1/4 cups, stirring occasionally, about 25 minutes longer. If desired, break up any large plum pieces. Transfer to bowl and refrigerate until cold, about 2 hours."]}, "Quick Strawberry-Orange Marmalade": {"ingredients": ["3 cups halved hulled strawberries (about 16 ounces)", "1/4 cup sugar", "1 cup orange marmalade (about 10 1/2 ounces)", "1 cinnamon stick, broken in half"], "instructions": ["Place strawberries in heavy medium saucepan; stir in sugar. Let stand until juices are released, stirring occasionally, about 15 minutes. Cook strawberry mixture over high heat 3 minutes, stirring occasionally. Add marmalade and cinnamon stick pieces; bring mixture to boil. Reduce heat to medium and cook until mixture is thick enough to coat spoon, stirring occasionally, about 15 minutes. Transfer to bowl. Refrigerate until cold, then cover and keep refrigerated. DO AHEAD Can be made 2 days ahead."]}, "Quick Apple Tart": {"ingredients": ["1 sheet frozen puff pastry (half of 17.3-ounce package), thawed", "3 medium Golden Delicious apples, peeled, cored, very thinly sliced", "2 tablespoons (1/4 stick) unsalted butter, melted", "3 tablespoons cinnamon sugar (or 3 tablespoons sugar mixed with scant 1/2 teaspoon ground cinnamon)", "1/4 cup apricot jam, melted"], "instructions": ["Preheat oven to 400°F. Line baking sheet with parchment paper. Unfold pastry on parchment paper. Using tines of fork, pierce 1/2-inch border around edge of pastry, then pierce center all over. Arrange apples atop pastry in 4 rows, overlapping apple slices and leaving border clear. Brush apples with melted butter; sprinkle with cinnamon sugar. Bake 30 minutes. Brush melted jam over apples. Bake tart until golden, about 8 minutes longer. Serve warm or at room temperature."]}, "Quick Ragù Bolognese ": {"ingredients": ["2 tablespoons olive oil", "18 ounces meat loaf mix or 6 ounces each lean ground beef, lean ground veal, and lean ground pork", "1 medium onion, chopped", "1/3 cup coarsely chopped carrot", "1/3 cup coarsely chopped celery", "3 garlic cloves, finely chopped", "1/2 cup red wine", "2 14 1/2-ounce cans diced tomatoes with balsamic vinegar, basil, and olive oil in juice", "1/3 cup half and half", "2 tablespoons chopped fresh oregano", "", "1 pound spaghetti", "Grated Parmesan cheese"], "instructions": ["Heat oil in heavy large saucepan over medium-high heat. Add meat, onion, carrot, celery, and garlic; sauté until meat begins to brown, about 8 minutes. Add wine and cook until wine evaporates, stirring often, about 3 minutes. Stir in tomatoes with juices, half and half, and oregano. Reduce heat to medium-low and simmer until thickened, about 25 minutes. Season sauce to taste with salt and pepper.", "Meanwhile, cook pasta in large pot of boiling salted water until tender but still firm to bite. Drain and divide among 4 plates. Spoon sauce over pasta. Sprinkle with Parmesan cheese and serve."]}, "Quick Curried Cauliflower Soup": {"ingredients": ["2 tablespoons olive oil", "1 large onion, chopped", "1 1/2 tablespoons sugar", "4 teaspoons curry powder", "8 cups cauliflower florets (from 1 large head), chopped", "10 ounces Yukon Gold potatoes, peeled, diced into 1/2-inch cubes (about 1 1/4 cups)", "7 cups low-salt chicken broth", "Plain yogurt", "Chopped fresh mint"], "instructions": ["Heat oil in heavy large pot over medium-high heat. Add onion and sauté until translucent, stirring often, about 5 minutes. Add sugar and curry powder; stir 1 minute. Add cauliflower and potatoes; stir 1 minute. Add broth and bring to boil. Reduce heat to medium, cover, and simmer until vegetables are tender, about 35 minutes. Working in batches, puree soup in blender. Return soup to same pot and bring to simmer. Season with salt and pepper. Ladle soup into bowls; top with yogurt and some mint."]}, "Quick Pear Tarts with Ice Cream": {"ingredients": ["1 17.3-ounce package frozen puff pastry (2 sheets), thawed", "2 large Bosc pears, peeled, halved, cored, cut lengthwise into 1/8-inch-thick slices", "2 tablespoons (1/4 stick) unsalted butter, melted", "4 tablespoons sugar", "Vanilla ice cream", "Brandy"], "instructions": ["Preheat oven to 425°F. Roll out 1 pastry sheet on floured work surface to 1/8-inch thickness. Using 6-inch plate as aid, cut out 2 rounds. Repeat rolling and cutting with second pastry sheet, forming 4 rounds total. Place rounds on heavy large baking sheet, spacing apart. Using 1 pear half for each tart, fan out pear slices in center of each round. Brush tarts with melted butter; sprinkle each with 1 tablespoon sugar. Bake until pears are tender and pastry is golden, about 22 minutes. Transfer tarts to plates. Top each with ice cream and drizzle with brandy."]}, "Quick Choucroute Garnie": {"ingredients": ["2 tablespoons vegetable oil", "1 pound fully cooked smoked sausage (such as kielbasa), cut into 3-inch lengths, then halved lengthwise", "2 cups chopped onions", "1 1/2 teaspoons caraway seeds", "1 bay leaf", "1 pound purchased sauerkraut, drained", "2/3 cup dry white wine"], "instructions": ["Heat oil in heavy large skillet over medium-high heat. Add sausage, cut side down, and cook until browned on bottom, about 3 minutes. Turn over sausage; add onions, and sauté until onions are beginning to soften, stirring occasionally, about 5 minutes. Stir in remaining ingredients. Cover and simmer until flavors blend, stirring occasionally, about 10 minutes. Discard bay leaf. Season to taste with salt and pepper and serve."]}}