{"Ultimate mashed potato": {"ingredients": ["1kg/2¼lb charlotte potatoes", "1 tbsp salt", "300g/10½oz cold butter, cut into cubes", "warm milk, to taste"], "instructions": ["Peel the potatoes and cut them into 2.5cm (1in) slices. Run the slices under cold water to wash off surface starch. Heat a large pan of water until it reaches a temperature of 80C/175F (you'll need to use a good-quality heat thermometer, with the probe placed in the water. Add the potatoes and simmer for half an hour being careful to maintain the temperature at 70C/160F. Drain the potato slices and run them under cold water until completely cool.", "Rinse the pan and refill with cold water. Salt the water and bring it to the boil, then lower to a simmer. Add the cooked, cooled potatoes and cook until soft. Drain the potatoes, then place them back in the pan. Shake the pan over a gentle heat to get rid of any remaining water.", "Tip the potatoes into a ricer and rice the potatoes over a bowl containing the cold butter. Push the buttery riced potatoes through a fine-meshed drum sieve for a silky, light texture. You can prepare the purée in advance up to this stage and store it in the fridge. To serve, reheat it gently in a pan, while gradually whisking in a little warm milk."]}, "Union Jack fondant fancies": {"ingredients": ["175g/6oz unsalted butter, softened", "175g/6oz caster sugar", "3 free-range eggs, lightly beaten", "175g/6oz self-raising flour", "1-2 tbsp milk", "50g/1¾oz caster sugar", "50ml/2fl oz water", "¼ tsp lemon essence", "150g/5½oz icing sugar", "75g/2¾oz butter, softened", "3-5  tbsp strawberry jam", "2 tbsp apricot jam, warmed gently, then passed through a sieve", "250g/9oz marzipan", "450g/1 lb fondant icing sugar", "red and blue food colouring"], "instructions": ["Preheat the oven to 190C/375F/Gas 5. Grease and line a 20cm/8in square cake tin.", "Beat together the butter and sugar in a bowl until light and fluffy. Beat in the eggs, a little at a time, until well combined. (If the mixture looks like it is curdling add a spoonful of the flour.)  Fold in the flour and add a little milk if the mixture looks stiff.", "Spoon the cake batter into the cake tin and level using the back of a spoon.  Bake for 35-40 minutes, or until golden-brown and a skewer inserted into the middle comes out clean. ", "Remove the cake from the oven, set aside to cool for 5 minutes, then turn out and allow to cool completely, upside down, on a wire rack.", "Meanwhile, for the sugar syrup, heat the sugar and water in a saucepan until the sugar has dissolved. Stir in the lemon essence.", "For the filling, beat the butter in a bowl until soft and smooth, slowly beat in the icing sugar. Continue to beat until fluffy. ", "Very carefully, using the longest knife you have, remove the dark crust from the top of the cake and turn the cake upside down.  Then cut the cake in half horizontally.", "Drizzle or brush the bottom cake layer with the sugar syrup and then spread with the buttercream. Top with the jam and carefully sandwich with the top half of the cake. ", "Wrap the cake in cling film and chill for 2-3 hours, this will make it easier to cut the cake later. ", "Lightly dust the work surface with icing sugar and roll out the marzipan to the same size as the cake.  Once the cake is chilled, brush the top of the cake with the sieved apricot jam.  Carefully lift the marzipan onto the cake, smooth it flat along the top of the cake and cut off any excess marzipan. Cut the cake into equal 25 x 4cm/1½in squares. ", "Sieve the fondant icing sugar into a small bowl and stir in enough hot water to make a smooth icing thick enough to coat the cakes. Reserving three tablespoons of the icing into two bowls, cover with cling film and set aside.  ", "Coat the cake squares with the icing, easing the icing down the sides of the cakes until you have an even coating all over the cakes.  Sit the cakes on a cooling rack until the icing is set. ", "Add a few drops of blue food colouring to one of the bowls of icing, mix to a smooth paste and spoon into a piping bag with a very fine nozzle.  Repeat with the other bowl of icing using the red food colouring. ", "Use these two colours to pipe the union jack onto the fondant fancies. Be as simple or as intricate as you dare! Carefully remove the cakes from the rack and sit in paper cases."]}, "Udon noodle soup": {"ingredients": ["5cm/2in piece kombu seaweed ", "1½ tsp dashi powder ", "2½cm/1in piece fresh ginger, peeled and grated ", "1 tbsp white miso paste", "pinch caster sugar ", "2 tbsp mirin ", "75g/2½oz tofu, cubed into 1cm/½in pieces", "1 tbsp vegetable oil", "1 garlic clove, finely sliced ", "4 shiitake mushrooms, sliced ", "2 heads bok choi, sliced in quarters ", "75g/2½oz kale, shredded ", "1 small courgette, sliced ", "50g/2¾oz sugar snap peas ", "2 tbsp Japanese soy sauce ", "40g/2½oz enoki mushrooms, broken into pieces ", "4 spring onions, finely sliced ", "1 tsp shichimi pepper ", "1 tsp sesame seeds ", "1 x 150g/5oz packet udon rice noodles "], "instructions": ["For the miso broth, place a saucepan of water over a medium heat and add the kombu seaweed. ", "Add the dashi powder, stir and leave to simmer for a few minutes. Add the grated ginger, white miso paste, sugar and mirin.  Taste and adjust the amount of sugar or mirin if necessary. Keep warm. To finish the miso broth, add the tofu cubes to the broth.", "For the stir-fried greens, heat a wok with a little vegetable oil until shimmering, add the sliced garlic and fry gently for 10 seconds. Tip in the sliced mushrooms, bok choi, kale, courgette and sugar snap peas.", "Keep stirring the contents of the wok and cook for two minutes or so, then add the soy sauce, enoki mushrooms and all but a teaspoon of the spring onions. Fry the vegetables until slightly softened, then add all but a pinch of the schicimi pepper and sesame seeds.", "Meanwhile, bring a second pan, filled with water, to the boil.  Drop the udon noodles into the boiling water and cook for a few minutes, or until heated through, and then drain.", "To serve, lay the udon noodles in the bottom of a bowl, place the stir-fried greens on top and then ladle over the miso broth.  Finish with the reserved finely sliced spring onion and a pinch of both the shichimi and sesame seeds."]}, "Upside-down pineapple pancakes": {"ingredients": ["135g/4¾oz plain flour", "1 tsp baking powder", "pinch salt", "1 tbsp caster sugar", "125ml/4½fl oz milk", "1 free-range egg", "2 tbsp melted butter, plus extra for cooking", "435g tin pineapple slices, drained", "maple syrup, to serve (optional)"], "instructions": ["Put the flour, baking powder, salt and sugar into a large bowl. ", "Pour the milk and melted butter into a jug, crack in the egg and whisk well using a fork.", "Pour the liquid into the flour mixture and, using the fork, beat until smooth. ", "Melt a knob of butter in a frying pan over a medium heat. Add two small ladlefuls of batter to create pancakes a little larger than a pineapple ring. Leave to cook for 15 seconds, then top each pancake with a pineapple ring. ", "When the top of the pancake begins to bubble, turn it over and cook until golden brown and the pancake has risen to about 1cm/½in thick.", "Repeat until all the batter is used up. Serve the pancakes with maple syrup if you like. "]}, "Unicorn cupcakes": {"ingredients": ["200g/7oz salted butter, at room temperature", "200g/7oz caster sugar", "4 large free-range eggs, lightly beaten", "1½ tbsp vanilla extract", "200g/7oz self-raising flour", "100g/3½oz multi-coloured sprinkles or funfetti", "375g/13oz salted butter, at room temperature", "750g/1lb 10oz icing sugar", "1½ tbsp vanilla extract", "50g/1¾oz icing sugar", "50g/1¾oz cornflour", "750g/1lb 10oz white fondant icing", "edible lustre powder or spray", "2 dashes pink and purple food colouring ", "50g/1¾oz sprinkles", "black writing icing"], "instructions": ["Preheat the oven to 170C/150C Fan/Gas 3. Line a 12 hole muffin tray with 12 muffin cases. ", "To make the cupcakes, beat the butter and sugar together in a stand mixer or with a handheld electric whisk on a high speed until pale and fluffy. Turn the mixer to low speed and add the eggs bit by bit, mixing on high speed after each addition. Add the vanilla, then add half of the flour. Mix until combined, then add the rest of the flour and mix until you have a smooth cake batter. Add the sprinkles and fold them through with a spatula.", "Divide the cake batter between the 12 muffin cases using an ice cream scoop or two spoons. Bake for 20-25 minutes, turning after 17 minutes so they colour evenly. Some cupcakes may bake more quickly than others so don’t be afraid to remove some from the oven earlier than others. Remember to remove the cupcakes from the tin once they are out of the oven, otherwise the cases may steam off. Leave to cool on a wire rack while you make the buttercream. Once cool, place the cupcakes in the freezer for 10 minutes – it’ll make them easier to work with when decorating.", "To make the buttercream, place the salted butter in the bowl of an electric mixer. Sift the icing sugar on top, bring the mixture together at a low speed, then beat at high speed for a few minutes until the mixture is pale and fluffy. Add the vanilla extract and beat to combine.", "Put a generous spoon of buttercream on each cupcake, and smooth around with a small palette knife to make a dome. Set aside the remaining buttercream.", "To make the decorations, mix the icing sugar and cornflour together in a bowl. Dust your palm with the cornflour mixture and use that to smooth the cupcake domes. Repeat this for all the cupcakes.", "Dust a clean work surface with some more of the cornflour mixture and roll out the white fondant icing to 4mm/ ¼in thick. Cut a circle of fondant with the 7.5cm/3in diameter circular pastry cutter and smooth it over the dome of the cupcake, gently stretching it down using your index finger. Repeat this for all 12 cupcakes then leave them to stand at room temperature. ", "Bring the remaining fondant back together and colour half of it with pink food colouring. On a surface dusted with the cornflour mixture, roll out both the pink and white fondant to 2mm/⅛in thick and cut out the ear shapes as shown in the picture. Use a tiny amount of water to stick the pink inner ear section to the white outer ear.", "Use the scraps of pink fondant to make the horns. Take a ball of pink fondant the size of a walnut then roll it into a thin tube shape with tapered ends. Bend the tube in the middle to bring the ends together, then twist the ends around each other to make a spiral. Leave the decorations to dry overnight on greaseproof paper, or dry them out for 30 minutes in a 60C oven. Leave to cool, then brush the horns with the lustre dust or spray. ", "Add a dash of purple colouring to the remaining buttercream and mix until you have the desired colour. Fit the piping bag with the star nozzle and pipe swirls on the ‘forehead’ of a cupcake. Decorate with the horn and the ears, then scatter on the sprinkles. Do one cupcake at a time, otherwise the buttercream will dry out and the sprinkles won’t stick. Repeat with the remaining cupcakes, then pipe on the eyes as shown in the picture, using writing icing or a fine brush dipped in food colouring, thinned out with water."]}, "Ultimate Korean fried chicken with pickled radish": {"ingredients": ["110ml/3¾fl oz rice vinegar", "110g/4oz caster sugar", "1 tsp kosher salt or sea salt ", "500g/1lb 2oz daikon, cut into 10mm/½in cubes", "35g/1¼oz cornflour", "2½ tsp kosher salt or sea salt", "½ tsp baking powder", "freshly ground black pepper", "2 chicken legs, thighs and wings (with tips), bone in, skin on", "vegetable oil, for deep-frying", "70g/ 2½oz cornflour", "35g/1¼oz fine matzo meal or fine dried breadcrumbs", "35g/1¼oz plain flour", "2 tbsp chilli flakes, preferably Korean chilli flakes (gochugaru)", "1 tbsp kosher salt or sea salt", "2½ tsp garlic granules", "2½ tsp onion granules", "¼ tsp baking powder", "5 tbsp vodka", "2 tbsp chilli paste, preferably Korean chilli paste (gochujang)", "70g/2½oz  chilli paste, preferably Korean chilli paste (gochujang)", "4 tsp soy sauce", "1 tbsp rice wine vinegar", "70g/2½oz dark brown sugar", "3 garlic cloves, crushed", "2 tsp grated fresh ginger", "4 tsp sesame oil", "1 tsp roasted white sesame seeds", "¼ bunch fresh chives, chopped", "2 tsp black sesame seeds"], "instructions": ["For the pickled radish, put the rice vinegar, sugar, salt and 110ml/3¾fl oz water in a bowl. Whisk until the sugar and salt have dissolved. Add the radish and toss to coat. Cover and leave at room temperature for 24 hours, then place in the fridge. ", "For the coating, put the cornflour, salt, baking powder and pepper in a large mixing bowl and whisk together. Add the chicken and toss well until evenly coated. Transfer the chicken to a rack, shaking well to get rid of any excess coating.  Leave to rest for 1 hour in the fridge. ", "Pour enough oil into a large casserole dish to reach a depth of 5cm/2in. Heat the oil over a medium-high heat until it reaches 175C/350F (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "For the batter, mix the dry ingredients in a large bowl. In a separate bowl whisk the wet ingredients and 235ml/8¼fl oz water together. Just before frying, whisk the wet mixture into the dry mixture.  The consistency should be relatively thin and runny. ", "Dip each piece of chicken into the batter, letting excess batter drip off.  Suspend the chicken in the oil for a couple of seconds for it to set before letting it slip completely into the oil. You may need to do this in batches. ", "Fry the chicken for 15-20 minutes, or until golden brown and cooked through. Transfer to a wire rack to drain. ", "For the red chilli sauce, put all of the ingredients in a small saucepan and simmer over medium heat for 2 to 3 minutes, whisking well to make sure ingredients are dissolved and incorporated. ", "Place the chicken and pickled radishes on a serving plate with the sauce.  Garnish with fresh chives and sesame seeds. "]}, "Ultimate vegan stew": {"ingredients": ["4 tbsp vegan margarine ", "2 x 540g tins (or 3 x 400g tins) jackfruit in brine, drained and rinsed", "2 tbsp soy sauce", "1 brown onion, chopped", "2 celery sticks, finely chopped", "4 garlic cloves, finely chopped", "2 tbsp plain flour", "250ml/9fl oz vegan-friendly red wine", "4 sprigs fresh thyme, leaves picked", "4 carrots, cut into 1cm/½in slices", "750g/1lb 10oz potatoes, peeled and cut into bite-size chunks", "2 bay leaves", "500ml/18fl oz vegetable stock", "250ml/9fl oz hot water", "salt and pepper"], "instructions": ["Put 3 tablespoons of the margarine in a large lidded saucepan over a medium heat. Add the jackfruit and a small pinch of salt and pepper. Fry for 15–20 minutes, or until golden brown, adding more margarine if necessary.", "Once the jackfruit is golden brown, remove from the heat and stir in 1 tablespoon of soy sauce, then tip the jackfruit into a bowl and wipe out the pan.", "Put the pan back over a medium heat and add the remaining 1 tablespoon of margarine. Add the onion and celery and fry for 8 minutes. Add the garlic and fry for 1 minute, then stir in the flour.", "Pour in the wine and simmer for 2 minutes. Add the thyme, carrots, potatoes, bay, stock, hot water and the remaining tablespoon of soy sauce. Bring to the boil, then reduce the heat, put the lid on and simmer for 40–50 minutes, or until the vegetables are tender."]}, "Upside-down apple pie with butterscotch sauce": {"ingredients": ["50g/1¾oz cold unsalted butter, cut into small pieces", "50g/1¾oz sugar ", "5 Braeburn apples, peeled, cored and cut into quarters ", "100g/3½oz good quality all-butter puff pastry ", "170g/6oz muscovado sugar ", "2 tsp Cabernet Sauvignon vinegar ", "170ml/6fl oz double cream ", "large pinch sea salt", "20g/¾oz cold butter, cubed", "good-quality vanilla ice cream"], "instructions": ["Preheat the oven to 180C/160C Fan/Gas 4.", "In a 20cm/8in ovenproof frying pan, arrange a layer of butter cubes and using a spoon squash the cubes to form an even layer. Sprinkle over the sugar, covering all the butter. Arrange the apples on top. ", "Roll out the pastry on a lightly floured surface to the thickness of a pound coin. Cut out a circle slightly bigger than your frying pan. Place the pastry on top of the apples and gently push down at the edges all the way around the pan. Bake for 1 hour, or until the puff pastry is crisp. Remove from the oven and leave to cool. ", "To make the sauce, heat the muscovado sugar with 30g/1oz water in a saucepan, stirring until the sugar has dissolved then stop stirring and boil until a caramel has formed. (CAUTION: Boiling sugar gets very hot. Take care not to burn yourself.) Add the vinegar, cream and salt and whisk to combine. Now add the chilled butter very slowly, whisking between each addition until you have a smooth butterscotch sauce. Remove from the heat and keep warm until ready to serve. ", "To turn out your apple pie, warm the pan in the oven for about 7 minutes and then turn out onto a plate. Spoon over some the butterscotch sauce and serve with a generous amount of vanilla ice cream. "]}, "Ultimate burger in a brioche bun": {"ingredients": ["800g/1lb 12oz best-quality beef steak, minced", "3 egg yolks", "1 tbsp Dijon mustard", "300ml/10½fl oz rapeseed oil", "25g/1oz beer mustard or wholegrain mustard", "½ lemon, juice only", "2 tbsp vegetable oil", "4 brioche rolls, cut in half", "4 tbsp ready-made mild chilli relish", "½ round lettuce, leaves separated", "2 tomatoes, sliced", "200g/7oz cheese, preferably Monterey Jack, sliced", "8 gherkins, drained, sliced", "1 red onion, peeled, sliced", "salt and freshly ground black pepper"], "instructions": ["Season the steak mince with salt and freshly ground black pepper and mix in a bowl using your hands. Divide the mince into four equally-sized balls and press each one between your palms to form a patty. Place the patties on a plate, cover, and chill in the fridge for an hour.", "Thirty minutes before you want to eat, light your barbecue. Allow the flames to flare up and die down.", "Meanwhile, in a bowl, whisk together the egg yolks and mustard until well combined. Gradually add the rapeseed oil in a thin stream, whisking continuously, until the mixture thickens to a mayonnaise and all of the oil has been incorporated. Stir in the beer mustard and lemon juice, then season, to taste, with salt and freshly ground black pepper.", "When the barbecue coals are just glowing, rub the patties with the vegetable oil and cook for 3-4 minutes on each side, or until cooked to your liking. (Alternatively, cook over a high heat on a griddle pan.) ", "Place each brioche onto the barbecue, cut-side down, and cook for one minute, or until chargrill marks appear on the bread. Set aside.", "To assemble the burgers, spread a little of the chilli relish onto the base of each brioche bun. Place a lettuce leaf and a slice of tomato on top, then add a burger, a slice of cheese, and a dollop of the mustard mayonnaise. Top with a few gherkin and red onion slices, then place the top half of the brioche bun on top.", "Place the burgers onto serving plates, keeping them from toppling over by spearing them with wooden skewers, if desired."]}, "Ultimate festive cheese toastie": {"ingredients": ["2–3 stalks of parsley, leaves picked, finely chopped", "2 spring onions, finely sliced", "100g/3½oz hard cheese, grated (such as strong cheddar, gruyère)", "75g/2¾oz soft cheese, diced (such as camembert, soft blue)", "4 slices firm bread (such as boule or sourdough)", "your favourite mustard, for spreading ", "2 tbsp fruity chutney (festive leftovers such as cranberry sauce or membrillo work well)", "50g/1¾oz butter, softened", "salt and freshly ground black pepper", "pickled walnuts, cornichons, thinly sliced apple, to serve (optional)"], "instructions": ["Tip the parsley and spring onions into a bowl with the cheeses, some pepper and a little salt. Mash together well with a fork.", "Spread two of the bread slices with mustard (or butter if you’re not a mustard fan), and the other two with fruity chutney. Divide the cheese mixture between the chutney-topped slices, sandwich with the others and firmly squash down. Generously butter the outsides.", "Heat a large frying pan over a medium–high heat. Put the sandwich in the pan and weigh it down with another heavy pan (or a couple of fish slices/spatulas topped with heavy tins). Cook for 3 minutes on each side until the outsides are crisp and golden brown, the insides oozy. ", "Cut in half and serve with your favourite cheeseboard accompaniments, such as pickled walnuts or cornichons"]}, "Ultimate English breakfast omelette": {"ingredients": ["8 new potatoes", "2–3 tbsp vegetable oil, for frying", "100g/3½oz black pudding, cut into rings and then into quarters", "100g/3½oz bacon lardons", "100g/3½oz cooking chorizo  ", "2 banana shallots, thinly sliced into rings", "2 garlic cloves, grated or crushed", "1 green chilli, thinly sliced", "6 free-range eggs, beaten", "1 tbsp freshly chopped rosemary", "1 bunch flatleaf parsley, leaves picked and chopped", "salt and freshly ground black pepper"], "instructions": ["Cook the new potatoes in salted boiling water for 12–15 until just soft. Drain in a colander then leave to steam dry and cool. When cool, cut them in half and set aside.", "Preheat the oven to 220C/200C Fan/Gas 7.", "Heat a 25cm/10in ovenproof frying pan on a medium heat and add a little oil. Fry the black pudding until crisp, remove from the pan and drain on  kitchen roll. Add the bacon to the pan and fry until it starts to brown and the fat renders out. Add the whole chorizo to the pan and fry with the bacon. The smoky red paprika oil will start to come out of the chorizo. Remove the bacon and chorizo from the pan and drain on some kitchen roll. When the chorizo is cool enough to handle, slice it thinly.", "Add one of the sliced banana shallots and the grated garlic to the pan with all of the rendered oil still in it, and cook on a low heat until soft. Add the halved potatoes and stir around, then put the cooked meats back into the pan and add the green chilli.", "Pour the eggs into the pan, add the rosemary and half the chopped parsley. Season with salt and pepper and stir slowly over a low heat until it starts to firm up. Put the pan in the oven and cook for 5-8 minutes, or until the eggs are set and puffed up.", "Remove the pan from the oven, sprinkle on the remaining raw shallot and chopped parsley. Serve immediately."]}, "Ultimate quiche Lorraine": {"ingredients": ["180g/6¼oz plain flour, plus extra for dusting", "100g/3½oz cold unsalted butter, cubed", "50g/2oz parmesan, grated", "2 tsp thyme, leaves only ", "1 free-range egg yolk", "1 tsp chilled water (more if needed)", "3 free-range eggs", "150g/5¼oz pancetta, cubed", "250ml/9fl oz crème fraîche", "150g/5¼oz Gruyère", "freshly ground black pepper"], "instructions": ["Preheat the oven to 180C/160C Fan/Gas 4.", "For the pastry, sieve the flour into a mixing bowl. Add the butter, parmesan and thyme and rub into the flour until the mixture resembles breadcrumbs. ", "Add the egg yolk and the water and mix to form a firm dough. Wrap the dough in cling film and place in the fridge for 30 minutes.", "On a floured surface, roll out the pastry to fit one large flan tin. Line the tin with the pastry, then place a circle of baking paper over the pastry and fill with baking beans.", "Transfer to the oven and bake for 15 minutes. Remove the beans and paper and return to the oven for five minutes.", "For the filling, place all the ingredients (except 50g/2oz of the Gruyère) into a large bowl and mix gently, to avoid filling the mixture with air.", "Spoon the filling into the pastry case and sprinkle the remaining Gruyère on top.", "Bake the quiche for 15 minutes, or until the filling is set. Serve hot or cold with a green salad."]}, "Ultimate indulgence mirror glaze cake": {"ingredients": ["40g/1½oz unsalted butter, melted, plus extra for greasing", "5 medium free-range eggs", "165g/5¾oz caster sugar", "2 large oranges, finely grated zest only", "pinch salt", "165g/5¾oz plain flour", "55g/2oz unsalted butter", "130g/4⅔oz soft light brown sugar", "5 tbsp double cream", "1 tsp sea salt", "600ml/20fl oz double cream", "1 tbsp butter (to thicken, if necessary)", "ivory gel food colour (optional)", "150ml/5fl oz double cream", "135g/5oz caster sugar", "55g/2oz cocoa powder", "3 leaves gelatine ", "100g/3½oz granulated sugar", "50g/1¾oz blanched hazelnuts", "chocolate curls (optional)"], "instructions": ["Preheat the oven to 180C/170C Fan/Gas 4. Grease and line two 20cm/8in springform cake tins with baking paper.", "For the génoise, half fill a large saucepan with water and bring to a simmer. In a large heatproof mixing bowl, combine the eggs and sugar, then place the bowl over the saucepan (creating a bain-marie). Make sure the bottom of the bowl doesn’t touch the water.", "Using a hand-held electric whisk, vigorously whisk the mixture for around 7 minutes, or until trebled in volume, pale and it leaves ribbons on the surface when the beater is lifted. Remove the mixture from the heat as soon as it is warm to the touch to avoid cooking the eggs.", "Gently fold in the orange zest and salt. Sift the flour into the mixture in three batches, gently folding in each batch before adding the next. Slowly pour the melted butter down the side of the bowl and fold in.", "Divide the mixture equally between the prepared cake tins, pouring from as low a height as possible. Place on the middle shelf of the oven and bake for 18-20 minutes, or until they are coming away from the sides of the tin and a cake skewer inserted in the middle comes out clean. Cool in the tin for 5 minutes then transfer to a wire rack to cool completely.", "For the salted caramel sauce, put the butter and light brown sugar in a small saucepan over a low heat and stir until the sugar is melted (about 3 minutes). Drizzle in the double cream, mixing well – take care as the mix may splatter. Bring to the boil and simmer for 1 minute, then remove from the heat. Stir in the sea salt and set aside to cool, stirring frequently to prevent a crust forming. When cooled, whisk it for 1-2 minutes to incorporate some air.", "For the cream base, whisk the double cream until stiff peaks form. Then whisk in the salted caramel to make a salted caramel cream. If the mixture is too loose, beat the butter until smooth and add to the salted caramel cream as necessary. Use a toothpick to add enough ivory food colouring to make a light brown/orange colour (if using).", "To assemble the cake, cut each cake in half horizontally to make four layers. Carefully place the first layer on a cake board. Using a palette knife, spread about 5mm of cream on top in an even layer. Place the next layer of génoise on top and repeat the cream and cake layers until you have four layers of génoise with salted caramel cream on top of each layer.", "Apply a ‘crumb coat’ of cream all over the cake, ensuring any gaps are filled to give a smooth surface. Make sure there are no overhanging edges as this will affect the mirror glaze later. Transfer the cake to the fridge for 20-30 minutes.", "Remove the cake from the fridge and add a final layer of cream all over, finishing it carefully using a palette knife (the smoother the cream, the better the final finish will be). Place back in fridge for 20 minutes, along with any remaining cream.", "For the chocolate glaze, add the cream, sugar, cocoa powder and 150ml/5fl oz water to a small saucepan and heat gently until the sugar is fully dissolved. Keep stirring during heating. Bring to the boil and simmer for 2 minutes. Remove from the heat and leave to cool for 10 minutes.", "Soak the gelatine leaves in a bowl of cold water for 5 minutes. Squeeze any excess water from the leaves and stir into the glaze until fully dissolved. Use a sugar thermometer to check the temperature of the glaze and cool to a maximum of 38C before using. ", "Pass the glaze through a fine sieve into a measuring jug and tap on a hard surface to encourage any air bubbles to pop.", "Once the cake has finished cooling in the fridge, transfer to a wire cooling rack placed on a large baking tray to catch any excess glaze as you pour it over the cake.", "Pour the glaze evenly over the top of the cake. Check the sides of the cake are covered and add more glaze if needed by reusing any excess glaze caught in the baking tray. Immediately transfer the cake to the fridge to firm up. ", "To decorate, make a caramel. Put the sugar and 1-2 tablespoons water in a small pan over a medium heat. Do not stir, just swirl the pan. Heat until the sugar is an amber caramel colour, then remove from the heat.", "Meanwhile, attach each hazelnut to the end of a cocktail stick. Very carefully dip each hazelnut into the caramel (the caramel will be very hot, so take care not to burn yourself) and hang over the edge of a work surface, using a heavy chopping board to hold the cocktail stick in place – protect the floor and any cupboards and with newspaper as the caramel will drip. This will form a caramel ‘spike’ as the caramel stretches. Once all hazelnuts are coated, trim the spikes to the same length using scissors and remove from the cocktail sticks onto a sheet of parchment paper.", "To finish, put the cake on a serving plate and pipe small circles of salted caramel cream around the top edge of the cake and place a caramelised hazelnut on each circle. "]}, "Union Jack battenberg cake": {"ingredients": ["175g/6oz softened butter, plus extra for greasing", "175g/6oz caster sugar", "3 free-range eggs", "175g/6oz self-raising flour", "½ tsp vanilla extract", "blue food colouring ", "300g/10½ icing sugar", "150g/5¼oz butter, softened", "6 tbsp good-quality strawberry jam", "500g/1lb 2oz white, ready-made marzipan", "2-3 tbsp icing sugar, for dusting"], "instructions": ["Preheat the oven to 190C/375F/Gas 5. Grease and line a 20cm/8in square cake tin.", "Beat together the butter and sugar in a bowl until light and fluffy. Beat in the eggs, a little at a time, until well combined. (If the mixture looks like it is curdling add a spoonful of the flour.)  Fold in the flour. Gradually add a few drops of blue food colouring (don’t add too much or the cake will look green.)", "Spoon the cake batter into the cake tin and level using the back of a spoon.  Bake for 35-40 minutes, or until golden-brown and a skewer inserted into the middle comes out clean.", "Remove the cake from the oven, set aside to cool for five minutes, then turn out and cool, upside down, on a wire rack.", "For the  buttercream filling, beat the butter in a bowl until soft and smooth, slowly beat in the icing sugar. Continue to beat until fluffy.", "To assemble the cake, slice the cake in half lengthways, place one sponge half on top of the other and trim off the edges, ensuring that both cakes are the same size.", "Cut the cakes in half again lengthways to make four long rectangles.", "Slice each rectangle diagonally along the length to make two triangular cakes", "Spread each cut side of the triangle with buttercream and jam and sandwich together with the other triangle to make four rectangular sections. Wrap each rectangular section in clingfilm and chill for at least an hour.", "Stack the rectangular sections into a square, so that the cross-section resembles a Union Jack (use an image of the Union Jack as a guide).", "Assemble the bottom half of the cake first by spreading each of the long inside edges with buttercream and jam and sandwiching together. Repeat with the top layer and chill both cakes for one hour. ", "Finally, sandwich the two cakes together by spreading the top of the bottom layer and the bottom of the top layer with buttercream icing.  Spread the bottom layer with jam and sandwich together. Chill the cake for one hour.", "Meanwhile, roll the marzipan out on a surface dusted with icing sugar to a 5mm/¼in thickness, it should be large enough to cover the cake.", "Warm a little strawberry jam and use this to brush the outside of the chilled cake. ", "Turn the cake upside down on the marzipan and brush the underside of the sponges with the jam.", "Wrap the marzipan around the cake, pressing it gently onto the surface of the sponges, and press the edges together to make a firm join.", "Turn back over with the seam underneath, trim a thin slice off each end and place on a serving plate.  Take a slice from each end of the cake to neaten the edge and it should reveal a cake version of the Union Jack. "]}, "Upside-down cherry tomato tarte tatin": {"ingredients": ["2 tbsp olive oil", "200g/7oz cherry tomatoes", "100g/3½ oz caster sugar", "1 tbsp chopped fresh sage", "100g/3½oz plain flour, plus extra for dusting", "55g/2oz butter", "2 tbsp olive oil", "2 tbsp cold water", "2 tbsp balsamic vinegar, to serve"], "instructions": ["Preheat the oven to 200C/400F/Gas 6.", "For the filling, heat the oil in a small ovenproof frying pan. Add the tomatoes and sugar and fry until the tomatoes just start to soften and the sugar becomes light golden-brown in colour. Scatter the chopped sage over the tomatoes.", "For the pastry, place the flour and butter into a food processor. Blend until it resembles breadcrumbs.", "Add the oil and water and blend for a few seconds more. Tip out onto a work surface lightly sprinkled with flour and knead lightly to form a soft dough.  ", "Using a rolling pin, roll out to a round circle slightly bigger than the frying pan. ", "Place the pastry on top of the fried tomatoes and tuck the edges into the filling. ", "Put the frying pan into the oven and cook for about 12 minutes, until the pastry is golden-brown and cooked on top. ", "Carefully turn out onto a large plate, so that the tomatoes are on top. Drizzle with balsamic vinegar and serve warm."]}, "Upside-down winter pudding": {"ingredients": ["4 tbsp demerara sugar", "3 English pears, peeled, cored and halved lengthways", "6 glacé cherries", "100g/4oz unsalted butter", "100g/4oz golden syrup ", "100g/4oz black treacle ", "1 large free-range egg ", "150ml/5fl oz tepid milk ", "1 tsp bicarbonate of soda", "225g/8oz plain flour", "1 heaped tsp ground cinnamon ", "1 heaped tsp ground ginger", "75g/3oz soft light brown sugar ", "vanilla ice cream, to serve"], "instructions": ["Preheat the oven to 180C/350F/gas 4. Line the base and sides of a deep-sided 20cm/8in round cake tin with a non-stick baking parchment. Sprinkle the base with the demerara sugar. ", "Place a cherry in the cavity of each pear half where the core has been removed then place the pears, cut side down, on the sugar in the cake tin, radiating from the centre of the tin.", "Melt the butter, syrup and treacle together in a small pan over a low heat, then set aside. In a jug, mix together the egg, milk, and bicarbonate of soda.", "Sift the flour, cinnamon and ginger into a mixing bowl and stir in the soft brown sugar.  Make a well in the centre and pour in the melted ingredients and the egg and milk mixture. Stir thoroughly until well combined. Pour over the pears into the prepared cake tin.", "Bake in the centre of the oven for about 45 minutes, or until well risen, golden-brown and firm to the touch. Cool in the tin for 3-4 minutes then turn out onto a serving plate, pear-side-up. Cut into thick slices and serve warm with vanilla ice cream."]}, "Upside Down Kiwi Trifle": {"ingredients": ["Heavy cream 1 cup", "Yogurt 1 cup", "Sugar Â¼ cup", "Pound cake 1 cup", "Kiwi rings 4", "Pineapple rings Â½ cup", "Orange rings 2", "Cherries for garnish", "Mint leaves for garnish"], "instructions": ["<strongMethod:</strong<br /Cover the bowl with plastic wrap", "Then whip cream", "Now add yogurt and sugar", "Mix well", "Then cut the cake slices", "Now in a bowl spread kiwi rings, orange rings and pineapple rings", "Then add the layer of cream, then cake, then cream, again fruits and cover with cake", "Allow it to cool", "Now place it in a serving platter", "In the end garnish with cherries and mint leaves", "Serve."]}, "Ultra Pastry": {"ingredients": ["Brown sugar 300gm", "Butter 140gm", "Egg 2", "Butter Milk 200gm", "Flour 250gm", "Cocoa Powder 30gm", "Chocolate chip 100gm", "Baking Powder 1/5 tsp", "Baking Soda 1tsp", "Dark chocolate 400gm", "Cream 400gm", "White chocolate chips as required", "Dark chocolate chips as required"], "instructions": ["Frosting k liye ek bowl me dark chocolate add kar k melt karlen or esme whipy whip cream add kar k achay se mix kar k ganache bana k frosting karen"]}, "Udon in Buttery Tomato and Soy Broth": {"ingredients": ["2 large beefsteak tomatoes, halved crosswise, seeds removed", "¼ cup vegetable oil", "2 large onions, very thinly sliced", "4 garlic cloves, thinly sliced", "1 1\" piece ginger, peeled, finely grated", "1½ tsp. freshly ground black pepper", "2 whole star anise", "1 3\" cinnamon stick", "Kosher salt", "2 7-oz. packages instant udon noodles, flavor packets discarded", "3 Tbsp. low-sodium soy sauce", "3 Tbsp. unsalted butter", "Toasted sesame oil (for serving)", "4 scallions, thinly sliced", "½ cup coarsely chopped cilantro leaves with tender stems"], "instructions": ["Starting at cut end, grate tomatoes on the largest holes of a box grater into a medium bowl until all that’s left is the flattened tomato skins; discard skins. Set grated tomato aside.", "Heat vegetable oil in a medium pot over medium. Cook onions, stirring occasionally, until starting to soften, 5–7 minutes. Add garlic and cook, stirring often, until onions are very soft and evenly golden, about 5 minutes. Add ginger and pepper and cook until fragrant, about 20 seconds. Add grated tomato and cook, stirring, until thickened, about 3 minutes. Add star anise, cinnamon stick, and 5 cups water; season with salt. Bring to a simmer over medium-high, then reduce heat to medium-low and simmer gently until flavors come together, 8–10 minutes.", "Meanwhile, cook udon according to package directions. Drain and set aside.", "Add soy sauce and butter to broth and stir until butter is melted. Fish out star anise and cinnamon stick and discard. Season with more salt if needed.", "Divide noodles among bowls; ladle broth over. Add a few drops of sesame oil; scatter scallions and cilantro on top."]}, "Upside-Down Apricot Tart": {"ingredients": ["¼ cup honey", "¼ cup sugar", "½ tsp. kosher salt", "2 Tbsp. unsalted butter", "1 Tbsp. apple cider vinegar", "1 lb. apricots (about 6), halved lengthwise, pits removed", "1 sheet frozen puff pastry (one 14-oz. package or half of a 17.3-oz. package), thawed", "¼ cup raw pistachios, finely chopped", "Whipped cream or vanilla ice cream (for serving; optional)"], "instructions": ["Place a rack in middle of oven and preheat to 425°. Cook honey, sugar, salt, and 2 Tbsp. water in a small saucepan over medium-high heat, stirring occasionally, until caramel turns dark amber in color (because of the honey, it can be hard to tell when the color changes; it should look like maple syrup). Remove caramel from heat and add butter and vinegar (be careful; mixture will bubble up). Stir with a wooden spoon or heatproof rubber spatula to incorporate.", "Pour caramel into a 9\"- or 10\"-diameter cake, tart, or springform pan or skillet and swirl to evenly coat the bottom.", "Arrange apricots, cut side down, in pan, letting them overlap slightly if needed. (Depending on the pan you use, you may not need all of them.)", "Unfold pastry and gently roll out on a lightly floured surface just to soften the creases and corners. Prick pastry all over with a fork. Drape over pan, then, using kitchen shears, trim to make a circle that’s slightly larger than the circumference of the pan (remember, the dough will shrink as it bakes) and tuck into pan.", "Bake tart until pastry is puffed and just golden, 15–20 minutes. Reduce oven temperature to 375° and continue to bake until pastry is deep golden brown and fruit juices are bubbling, 15–20 minutes longer. Transfer tart to a wire rack and let cool 10 minutes.", "Invert a large plate over the top of the pan. Using a dish towel or oven mitts, flip tart over onto plate. Carefully remove pan. Top tart with pistachios.", "Serve tart with whipped cream or ice cream if desired.", "Do Ahead: Tart can be baked 4 hours ahead. Leave in pan at room temperature. If caramel has set too firmly to release from pan, heat in a 375° oven 5 minutes to warm and loosen before turning out."]}, "Universal Marinade": {"ingredients": ["2 lemongrass stalks, trimmed, tough outer layers removed", "1 serrano chile", "3 garlic cloves", "1 1\" piece ginger, peeled", "1 Tbsp. dark brown sugar", "1 Tbsp. extra-virgin olive oil", "1 Tbsp. fish sauce", "1 Tbsp. soy sauce"], "instructions": ["Using a Microplane, finely grate lemongrass, chile (seeds and all!), garlic, and ginger into a medium bowl. (Alternatively, you can chop very finely, then mash to a paste using the side of your knife.) Add brown sugar, oil, fish sauce, and soy sauce and mix well."]}, "Upside-Down Caramelized Leek Tart": {"ingredients": ["1 14-oz. package frozen puff pastry, thawed", "All-purpose flour (for surface)", "6 leeks, root ends and dark green parts removed, cut in half lengthwise", "2 Tbsp. extra-virgin olive oil", "½ tsp. kosher salt", "½ tsp. freshly ground black pepper, plus more", "¼ cup white wine vinegar", "2 Tbsp. unsalted butter", "1 tsp. sugar", "1 tsp. thyme leaves, plus more for serving", "2 Tbsp. Dijon mustard", "2 oz. Parmesan, finely grated (about ½ cup)", "Flaky sea salt"], "instructions": ["Place a rack in center of oven; preheat to 400°. Roll out puff pastry on a lightly floured surface to a 12\" square. (If you have 2 sheets of pastry, stack and gently roll out to adhere.) Using a 10\" cast-iron skillet turned upside down as your guide, trace a circle with a sharp knife around circumference of skillet. Reserve scraps for another use. Prick pastry round all over with a fork. Roll dough onto rolling pin, then unfurl onto a rimmed baking sheet and chill until ready to use.", "Toss leeks, oil, kosher salt, and ½ tsp. pepper on another rimmed baking sheet. Arrange leeks cut sides down and roast until tender and lightly browned in spots, about 20 minutes. Let cool. Remove tough, leathery outer layer, then transfer leeks to a cutting board.", "Meanwhile, bring vinegar to a simmer in 10\" cast-iron skillet over medium-high heat and cook, stirring occasionally, until slightly reduced, about 1 minute. Add butter, sugar, and 1 tsp. thyme and continue to cook, stirring occasionally, until butter has melted, about 2 minutes. Remove from heat and let cool slightly.", "Arrange leeks cut sides down and side by side in rows in vinegar mixture, trimming as needed so they all fit snugly in skillet. If there are any gaping holes, fill in with small pieces. You may have a leek or two left, but better to err on the side of having too many than not enough.", "Brush leeks with mustard. Sprinkle with 2 oz. Parmesan. Drape chilled pastry over leeks, tucking edges inside skillet with a spoon. Cut three 3\"-long slits into pastry (cutting all the way through) to let steam escape—this will help the pastry cook more evenly. Bake tart until pastry is deeply golden brown and puffed, 35–45 minutes.", "Let tart cool slightly, about 5 minutes. Carefully place a large plate on top of skillet. Using towels, invert tart onto plate. If some of the leeks get left behind in skillet, use a butter knife or offset spatula to release and nestle them back into tart.", "Top tart with thyme. Season with sea salt and pepper.", "Do Ahead: Dough can be prepped 8 hours ahead. Cover with plastic and keep chilled."]}, "Umami Gravy": {"ingredients": ["1 Tbsp. (or more) vegetable oil", "1 turkey neck (reserved from Dry-Rubbed Roast Turkey), patted dry", "1 cup chopped shiitake mushrooms", "1 medium onion, finely chopped", "A small handful of rosemary sprigs, thyme sprigs, and/or bay leaves", "½ cup dry white wine", "6 cups (or more) low-sodium chicken broth or turkey stock", "3 Tbsp. unsalted butter", "¼ cup Wondra or all-purpose flour", "1 tsp. soy sauce", "Kosher salt, freshly ground pepper"], "instructions": ["Heat oil in a large saucepan over medium-high. Cook turkey neck until golden brown all over, about 3 minutes per side. Transfer to a plate.", "Add mushrooms to the same saucepan and cook over medium-high, stirring occasionally, until browned all over, about 5 minutes. If pan is starting to look dry, add another teaspoonful or two of oil. Add onion and cook, stirring occasionally, until brown around the edges and softened, 6–8 minutes. Add herbs and cook, stirring constantly, until fragrant, about 1 minute. Pour in wine and use a wooden spoon to scrape up any browned bits stuck to the bottom of the pan. Bring to a boil and cook until wine is almost completely evaporated, about 5 minutes.", "Return turkey neck to pan and add broth; bring to a boil. Reduce heat and simmer, stirring occasionally, until liquid is reduced by a third, 25–30 minutes. Strain fortified broth through a fine-mesh sieve into a large heatproof measuring glass or small bowl; discard solids. (You should have 4 cups. If needed, add more broth or water to get you there.) Keep warm while you make the roux.", "Heat butter in a medium saucepan over medium.", "Once butter is melted, whisk in flour and cook, whisking constantly, until roux is golden brown and looks smooth and shiny, about 3 minutes.", "Whisking constantly, ladle fortified broth into roux, pouring in gradually and incorporating after each addition before adding more. Simmer, whisking often, until gravy is reduced to about 3 cups (it should be thick enough to coat a spoon), 12–15 minutes.", "Stir in soy sauce for that last umami hit. Taste and season with salt (if needed) and pepper.", "Do Ahead: Gravy can be made 2 days ahead. Let cool; cover and chill. Reheat over low, stirring occasionally, until warmed through."]}, "Use-It-Up Frittata": {"ingredients": ["6 large eggs", "6 ounces leftover roasted vegetables, cut into ½-inch pieces (about 1½ cups)", "½ cup leftover cooked grains", "1 ounce coarsely grated or crumbled cheese", "1 tablespoon finely chopped tender herbs, such as thyme, basil, and/or chives", "Kosher salt", "Freshly ground black pepper", "2 tablespoons extra-virgin olive oil, divided"], "instructions": ["Vigorously whisk 6 eggs in a medium bowl until streak-free.\n→  Here's how to buy the best eggs possible.", "Add 5 oz. vegetables, ½ cup grains, 1 oz. grated cheese, and 1 Tbsp. herbs; season with salt and pepper. Mix with a rubber spatula to combine.", "Heat 1 Tbsp. oil in a medium nonstick skillet over medium; swirl skillet to coat with oil.", "Add egg mixture and cook until edges are set, about 30 seconds.", "Using spatula, agitate eggs by scraping bottom of skillet in a small circular motion and bringing edges toward center of pan to form large curds, then let mixture sit undisturbed until edges are set again, about 1 minute.", "Reduce heat to low and continue to cook, tilting skillet and lifting edges up with spatula to allow uncooked egg to flow underneath and around sides, until surface is wet but center is mostly set when you shake the pan, about 5 minutes.", "Shake skillet to loosen frittata. Place a large plate over skillet and invert frittata onto plate.", "Heat remaining 1 Tbsp. oil in skillet over medium, swirling to coat. Slide frittata back into skillet; reduce heat to low. Cook until set all the way through, about 3 minutes.", "Let frittata cool in skillet 5 minutes, then invert onto a cutting board.", "Season frittata with salt and pepper. Cut into wedges to serve.", "Do Ahead: Frittata can be made 1 day ahead. Cover and chill. Bring to room temperature before serving."]}, "Ube (Purple Yam) Candies": {"ingredients": ["12 ounces purple- or orange-fleshed sweet potatoes (about 2 medium)", "7 ounces sweetened condensed milk", "½ cup nonfat instant dry milk", "½ teaspoon finely grated lime zest", "Pinch of kosher salt", "2 tablespoons sugar, plus more", "A potato ricer or food mill"], "instructions": ["Preheat oven to 350°. Roast sweet potatoes on a rimmed baking sheet until tender, 40–50 minutes. Let cool. Halve lengthwise and scoop flesh from skins; discard skins. Press flesh through ricer into a bowl (you should have 1 packed cup).", "Cook sweet potato and condensed milk in a medium nonstick saucepan or skillet over medium heat, stirring often, until thickened and jammy, 6–8 minutes. Stir in powdered milk, lime zest, salt, and 2 Tbsp. sugar. Cook, stirring often, until slightly shiny, about 3 minutes. Transfer to a small bowl; cover with plastic wrap, pressing directly onto surface. Let cool.", "Turn out ube mixture onto a work surface and roll into ½\"-thick logs. Sprinkle sugar over surface; roll logs in sugar until generously coated. Cut into 1½\" pieces.", "Do Ahead: Candies can be made 2 weeks ahead. Wrap tightly and chill."]}, "Ultra-Creamy Mashed Potatoes": {"ingredients": ["4 pounds medium Yukon Gold potatoes, scrubbed", "4 teaspoons kosher salt, plus more", "1½ cups whole milk", "½ cup heavy cream", "1 head of garlic, halved crosswise", "3 sprigs rosemary", "1 cup (2 sticks) unsalted butter, room temperature, cut into pieces", "Freshly ground black pepper", "A potato ricer or food mill fitted with fine disk"], "instructions": ["Place potatoes in a large pot and pour in cold water to cover by 1\". Add a large handful of salt (water should taste briny, like the ocean) and bring to a boil. Reduce heat and simmer until potatoes are very tender but not crumbly, 30–35 minutes. Drain, briefly rinse with cool water to remove any excess starch, and return potatoes to warm pot (off heat) to dry while you heat the milk mixture.", "Warm milk, cream, garlic, and rosemary sprigs in a small saucepan over medium until fragrant, about 5 minutes. Remove pan from heat.", "Pass hot potatoes through ricer or food mill into a large bowl (cold potatoes will become gummy). Add butter and 4 tsp. salt and stir until butter is completely incorporated. Strain warm milk mixture through a fine-mesh sieve into a large measuring glass. Pour into potatoes ½-cupful at a time, stirring after each addition until liquid is fully incorporated and mixture is smooth before adding more.", "Serve mashed potatoes topped with a few grinds of pepper.", "Do Ahead: Mashed potatoes can be made 1 day ahead. Cover and chill. Reheat over medium, stirring often and adding ¼ cup milk or stock to thin out if needed."]}, "Ultimate Zoodles": {"ingredients": ["¼ cup vegetable oil", "1 serrano chile, thinly sliced", "4 large scallions, thinly sliced, divided", "Kosher salt", "¼ cup raw, unsalted sunflower seeds", "2 tablespoons sesame seeds", "1 teaspoon coriander seeds, crushed", "1 teaspoon cumin seeds, crushed", "¼ cup fresh lime juice", "1½ teaspoons honey", "2 large zucchini (about 1¼ pounds), spiralized using a medium blade", "½ English cucumber, spiralized using a medium blade", "1 cup cilantro leaves with tender stems"], "instructions": ["Heat oil in a small saucepan over medium. Cook chile and half of the scallions, stirring occasionally, until golden brown and crisp, 4–5 minutes.  With a slotted spoon, transfer chiles and scallions to paper towels; season with salt.", "Add sunflower, sesame, coriander, and cumin seeds to saucepan and cook over medium heat, stirring, until seeds are lightly golden and spices are fragrant, about 1 minute. Transfer to a large bowl and whisk in lime juice and honey; season with salt. Add zucchini, cucumber, cilantro, and remaining scallions. Toss to coat, season with salt, and top with fried chiles and scallions. Serve immediately."]}, "Under-the-Mistletoe Punch": {"ingredients": ["1⅓ cups raw sugar", "3 tablespoons allspice berries, cracked", "2 tablespoons whole cloves", "2 3-inch cinnamon sticks", "1 750 ml bottle amontillado sherry (preferably Lustau)", "1 750 ml bottle dry vermouth (preferably Dolin)", "1½ cups plus 1 tablespoon cranberry juice cocktail", "1½ cups plus 1 tablespoon fresh lemon juice", "Blood orange or navel orange wheels, fir sprigs (optional), cranberries, and cinnamon sticks (for serving)"], "instructions": ["Bring raw sugar, allspice, cloves, cinnamon, and 1⅓ cups water to a simmer in a small saucepan over medium heat. Remove from heat and let spices steep 10 minutes. Strain through a fine-mesh sieve into a small measuring glass or bowl (you’ll have 1½–1¾ cups syrup); let syrup cool. Cover and chill until cold, at least 30 minutes.", "Do Ahead: Syrup can be made 1 month ahead. Keep chilled.", "Stir spiced syrup, sherry, vermouth, cranberry juice, and lemon juice in a large pot or bowl.", "If serving from a dispenser with a spigot, line sides at the bottom with a row of orange wheels and fill one-quarter full with crushed ice to hold orange wheels against sides. Create another layer of orange wheels and add just enough ice to hold them against sides. Repeat until dispenser is full. Pour punch over ice and top with fir sprigs, if desired. Serve punch in ice-filled glasses garnished with cranberries, cinnamon sticks, and orange wheels.", "If serving in a punch bowl, add 4 cups ice cubes to punch and stir until very cold, about 1 minute. Remove ice with a slotted spoon. Ladle into ice-filled glasses garnished with cranberries, cinnamon sticks, and orange wheels.", "Do Ahead: Punch (stirring in ice if serving in a punch bowl) can be made 8 hours ahead. Cover and chill."]}, "Ultimate Caprese Salad": {"ingredients": ["1 pint mixed cherry tomatoes, preferably heirloom, halved", "7 tablespoons (or more) extra-virgin olive oil, divided", "Flaky sea salt", "2 pounds mixed medium and large tomatoes, preferably heirloom, cut into thin slices and/or wedges", "8 ounces buffalo mozzarella or mozzarella, room temperature, torn into pieces", "Coarsely ground black pepper", "Small basil leaves and toasted country bread (for serving)"], "instructions": ["Toss cherry tomatoes with 1 Tbsp. oil in a small bowl; season with salt.", "Arrange tomato slices on a platter, slightly overlapping; season generously with salt. Arrange mozzarella over tomatoes; lightly season mozzarella with salt. Spoon cherry tomatoes over salad and drizzle with 6 Tbsp. oil; season with pepper. Let stand 30 minutes to let flavors meld and release juices from tomatoes and mozzarella.", "Top salad with basil and additional salt and oil, if desired. Serve with bread alongside."]}, "Ultimate BLT Recipe": {"ingredients": ["¼ cup (packed) dark brown sugar (optional)", "4 teaspoons chipotle chile powder (optional)", "4 teaspoons smoked paprika (optional)", "1½ teaspoons kosher salt, divided (optional)", "¼ cup pure maple syrup (optional)", "2 tablespoons plus 2 teaspoons Dijon mustard (optional)", "¼ teaspoon cayenne pepper (optional)", "2 pounds thick-cut bacon", "2 heads of red romaine lettuce, separated into individual leaves", "4 large beefsteak tomatoes, sliced ¼-inch thick", "16 ½-inch slices white bread, toasted, such as pan de mie", "Mayonnaise, Sriracha Mayonnaise, and/or Lemon-Herb Mayonnaise (for serving)", "Flaky sea salt, freshly ground pepper"], "instructions": ["Place racks in upper and lower thirds of oven; preheat to 400°.", "If making brown-sugar rub, whisk brown sugar, chile powder, paprika, and 1 tsp. kosher salt in a small bowl.", "If making maple-mustard glaze, whisk maple syrup, mustard, cayenne, and remaining ½ tsp. kosher salt in another small bowl.", "For plain bacon, divide between 2 wire racks set inside large foil-lined rimmed baking sheets. Bake, rotating baking sheets front to back and top to bottom halfway through, until brown and crisp, 35–50 minutes (depending on the thickness of the bacon). Transfer to paper towels to drain.", "For flavored bacon, generously sprinkle desired amount (you’ll have enough rub and glaze for 1 lb. bacon each) with rub or brush with glaze about 5 minutes before it is done cooking. Rub should be melted and bubbling and glaze should look thick and caramelized.", "Arrange bacon on a large platter and serve with lettuce, tomatoes, toast, mayonnaise, Sriracha Mayonnaise, Lemon-Herb Mayonnaise, sea salt, and pepper alongside for building sandwiches."]}, "Ultimate Veggie Burger": {"ingredients": ["¼ cup pearl barley", "Kosher salt", "1 pound shiitake mushrooms, stemmed", "2 tablespoons olive oil, divided", "Freshly ground black pepper", "1 14.5-ounce can black beans, drained", "1 medium onion, finely chopped", "2 garlic cloves, finely chopped", "½ cup unsalted, roasted cashews", "1 tablespoon old-fashioned oats", "¼ cup mayonnaise", "1 large egg yolk", "1 tablespoon miso", "1 teaspoon chili powder", "½ teaspoon agave nectar", "½ teaspoon smoked paprika", "Pinch of cayenne pepper", "½ cup shredded sharp cheddar (about 2 ounces)", "¼ cup Cotija cheese or Greek feta, finely crumbled (about 1 ounce)", "1 tablespoon olive oil", "6 slices cheese, such as American or cheddar (optional)", "6 seeded hamburger buns, lightly toasted", "Special Sauce, bread-and-butter pickles, torn lettuce, sliced tomatoes, and Dijon mustard (for serving)"], "instructions": ["Preheat oven to 350°. Cook barley in a small pot of boiling salted water until very tender, 40–50 minutes. Drain; let cool.", "Meanwhile, chop mushrooms into ¼\"–½\" pieces. Arrange in an even layer on a large rimmed baking sheet. Drizzle with 1 Tbsp. oil, season with salt and pepper, and toss to coat. Roast until mushrooms have lost half of their volume and are tender, 12–15 minutes. This step is essential—it removes much of the excess liquid from the mushrooms, which would lead to a mushy patty. Let cool.", "Spread beans on another large rimmed baking sheet and roast, tossing once, until most of them have split open and look dry around the edges, 8–10 minutes. The beans are an essential addition for binding the patty, and add protein. Let cool.", "Meanwhile, heat remaining 1 Tbsp. oil in a medium skillet over medium. Cook onion and garlic, stirring frequently, until soft, 8–10 minutes. Let cool. Pulse cashews and oats in a food processor until finely chopped.", "Whisk mayonnaise, egg yolk, miso, chili powder, agave, paprika, and cayenne in a large bowl. Add cooled barley, mushrooms, beans, onion mixture, and cashew mixture. Mash with a potato masher until mixture is well blended and sticky, about 2 minutes. Transfer one-quarter of the mixture to food processor and pulse until very finely chopped. Return to bowl with remaining patty blend. Stir in cheddar and Cotija cheese; season with salt and pepper. Form mixture into 6 patties (lightly oiling your hands will prevent it from sticking).", "Do Ahead: Patties can be made 2 days ahead; wrap tightly and chill. Or, freeze in a single layer, then wrap tightly up to 3 months. Thaw before cooking.", "Heat oil in a large cast-iron skillet over medium. Working in batches, cook patties until dark brown on both sides, about 10 minutes total. Place cheese slices over burgers, if using; cover and cook just long enough for cheese to melt, about 1 minute. Serve on buns with your choice of toppings."]}, "Upside-Down Blood Orange–Polenta Cake": {"ingredients": ["Nonstick vegetable oil spray", "¾ cup (packed) light brown sugar", "¾ cup (1½ sticks) unsalted butter, room temperature, divided", "6 blood oranges, peel and white pith removed, each sliced into 4 rounds, seeds removed", "1½ cups all-purpose flour", "3 tablespoons polenta (not quick-cooking)", "1½ teaspoons kosher salt", "1½ teaspoons baking powder", "½ teaspoon baking soda", "1 cup granulated sugar", "1 vanilla bean, split lengthwise", "4 large eggs, room temperature", "¾ cup buttermilk, room temperature", "Lemon omani (dried black limes), green cardamom pods, and softly whipped cream (for serving; optional)", "A 9-inch springform pan"], "instructions": ["Preheat oven to 350°. Coat pan with nonstick spray and place on a foil-lined rimmed baking sheet. Cook brown sugar, ¼ cup butter, and 2 Tbsp. water in a small saucepan over medium heat, stirring, until sugar is dissolved and mixture is smooth. Bring to a boil and cook, without stirring, 2 minutes (it should be slightly thickened). Pour caramel into prepared pan and let rest until set, about 5 minutes.", "Arrange orange slices in concentric circles in a single layer over caramel. (Start with larger slices around the outside, then use smaller ones as you work toward the center. Cut up leftover citrus to fill in the gaps.)", "Whisk flour, polenta, salt, baking powder, and baking soda in a medium bowl. Place granulated sugar and remaining ½ cup butter in a large bowl; scrape in vanilla seeds and save pod for another use. Using an electric mixer on high speed, beat until light and fluffy, about 4 minutes. Add eggs one at a time, beating to blend between additions; beat until mixture is very fluffy, about 3 minutes.", "Reduce mixer speed to low. Add dry ingredients in 3 additions alternating with buttermilk in 2 additions, beginning and ending with dry ingredients; mix just until batter is smooth. Scrape batter into prepared pan (be careful not to disturb orange slices) and smooth surface with an offset spatula.", "Bake cake until golden brown and a tester inserted into the center comes out clean, 50–65 minutes. Transfer pan to a wire rack and let cake cool 10 minutes. Run a knife around edges of cake to loosen, then unmold. Invert cake onto rack and carefully remove bottom of pan. Let cool completely.", "Finely grate lemon omani and cardamom pods over cake and whipped cream, if desired. Serve cake with whipped cream alongside."]}, "Ultimate Sugar Cookies": {"ingredients": ["¾ teaspoon kosher salt", "½ teaspoon baking powder", "3 cups all-purpose flour, plus more for rolling", "1¼ cups (2½ sticks) chilled unsalted butter, cut into ½-inch pieces", "1 cup sugar", "1 large egg", "1 large egg yolk", "1 teaspoon vanilla extract"], "instructions": ["Whisk salt, baking powder, and 3 cups flour in a small bowl. Using an electric mixer on high speed, beat butter and sugar until well combined (butter does not need to be fluffy), about 3 minutes. Add egg, egg yolk, and vanilla; beat just to combine. Reduce speed to low and gradually add dry ingredients; mix just to combine. Form dough into two ¾\"-thick disks; wrap in plastic. Chill at least 2 hours.", "Place racks in lower and upper thirds of oven; preheat to 325°. Let 1 disk of dough sit at room temperature until softened slightly, about 5 minutes. Roll out on a lightly floured sheet of parchment paper until about ¼\" thick, dusting with flour as needed (if dough gets soft or sticky, chill on parchment until firm). Cut out shapes with floured cookie cutters; transfer to parchment-lined baking sheets.", "Bake cookies, rotating baking sheets halfway through, until edges are golden, 12–16 minutes, depending on size. Transfer to wire racks and let cool. Repeat with scraps and remaining dough.", "Decorate cooled cookies as desired.", "Do Ahead: Cookie dough can be made 1 month ahead; freeze instead of chilling. Cookies can be baked (left undecorated) 2 weeks ahead; wrap tightly and freeze."]}, "Udon Noodle Soup with Vegetables": {"ingredients": ["2 tablespoons (or more) udon soup base", "1 tablespoon (or more) reduced-sodium soy sauce", "1 teaspoon (or more) yuzu juice or fresh lime juice", "8 asparagus spears, trimmed, sliced on a diagonal into 1-inch pieces", "6 crimini (baby bella) mushrooms, quartered", "2 celery stalks, thinly sliced on a diagonal", "1 sweet potato, peeled, cut into 1/2-inch pieces", "1 teaspoon toasted sesame oil", "12 ounces fresh (or frozen, thawed) udon", "2 cups (packed) arugula, torn", "1 cup (loosely packed) fresh cilantro leaves", "4 hard-boiled, poached, or fried eggs (optional)", "Shichimi togarashi"], "instructions": ["Bring 4 cups water to a boil in a large pot. Stir in soup base, soy sauce, and yuzu juice. Cover broth and set aside.", "Place a steamer basket in a medium pot. Pour in water to a depth of 1\" and bring to a boil over medium-high heat. Add asparagus, cover, and reduce heat to medium. Steam asparagus, stirring once, until crisp-tender, about 4 minutes. Using a slotted spoon, transfer asparagus to a baking sheet; chill. Repeat process with mushrooms, celery, and sweet potato, steaming in individual batches until just tender. (Add more water to pot if necessary to maintain depth of 1\".) Transfer all vegetables to baking sheet and chill.", "Pour steaming liquid from bottom of pot into reserved broth. Bring broth to a boil and add chilled vegetables. Season broth to taste with more soup base, soy sauce, and yuzu, if desired, and drizzle with oil.", "Boil noodles according to package directions. Using tongs or a large slotted spoon, transfer noodles to serving bowls, dividing evenly. Ladle broth and vegetables over. Garnish soup with arugula and cilantro. Add an egg to each soup, if desired, and sprinkle with shichimi togarashi."]}, "Ultimate Turkey Stock": {"ingredients": ["5 1/2 pounds turkey wings", "Neck, heart, and gizzard reserved from turkey", "12 cups low-salt chicken broth", "3 large carrots, cut into chunks", "3 large celery stalks, chopped", "2 medium onions, quartered", "2 medium whole leeks (including dark green parts), split lengthwise, rinsed, chopped", "Stems from 2 bunches parsley", "6 large fresh thyme sprigs", "3 Turkish bay leaves"], "instructions": ["Place turkey wings and neck, heart, and gizzard in large pot. Add all remaining ingredients; bring to boil. Reduce heat to medium-low; simmer gently until gizzard is tender, 1 1/2 to 2 hours.", "Using tongs, transfer neck, heart, and gizzard to plate; reserve. Discard wings. Strain stock and spoon off fat from surface. Measure stock and, if necessary, boil until reduced to 81/2 to 9 cups. DO AHEAD Can be made 3 days ahead. Cool 1 hour. Chill uncovered until cold, then cover and keep chilled. Wrap and chill turkey neck, heart, and gizzard separately for making gravy."]}, "Udon with Mushroom Broth, Cabbage, and Yams": {"ingredients": ["10 cups Light Vegetable Broth (see recipe) or good-quality canned vegetable broth (such as Swanson)", "3 cups water", "1 1/2 cups coarsely chopped fresh cilantro", "1 1/2 ounces dried shiitake mushrooms, rinsed", "3/4 cup thinly sliced peeled fresh ginger", "2 lemongrass stalks, outer dark layers removed, all but bottom 4 inches cut off and discarded", "2 6-inch strips dried kombu", "2 teaspoons tamari soy sauce", "1 teaspoon unseasoned rice vinegar", "2 cups 1/2-inch cubes peeled yams (red-skinned sweet potatoes)", "5 ounces snow peas, trimmed", "4 cups 1/2-inch-wide crosswise slices cored Napa cabbage", "5 ounces slender carrots (preferably assorted colors), peeled, thinly sliced on diagonal", "10 ounces Japanese-style udon noodles or soba noodles", "1 cup sliced green onions", "1/4 cup matchstick-size strips peeled fresh ginger", "4 to 6 ounces semi-firm tofu, cut into 1/2-inch cubes (optional)", "Sambal oelek", "Tamari soy sauce"], "instructions": ["Bring broth and 3 cups water to simmer in large pot over medium heat. Add cilantro, mushrooms, sliced ginger, and lemongrass. Cover; simmer until mushrooms are tender, about 30 minutes. Rinse kombu; add to broth. Simmer 1 minute. Using tongs, remove kombu and mushrooms; discard kombu. Transfer mushrooms to work surface; cut off stems and discard. Cut each mushroom into 3 to 4 strips. Strain broth through fine-mesh strainer into another large pot; discard solids in strainer. Add tamari and rice vinegar to broth. DO AHEAD Can be made 1 day ahead. Cover and chill mushrooms. Cool, cover, and chill broth.", "Bring large pot of salted water to boil. Cook yams until just tender, 4 to 5 minutes. Using skimmer, transfer to medium bowl. Cook snow peas, cabbage, and carrots separately until crisp-tender (snow peas, 30 seconds; cabbage, 1 1/2 minutes; carrots, 2 minutes). Using kimmer, transfer vegetables to separate bowls. Reserve cooking liquid. DO AHEAD Vegetables can be cooked 2 hours ahead. Let vegetables and liquid stand at room temperature.", "Bring cooking liquid to boil. Sprinkle with salt. Add noodles; cook until tender but still firm to bite, stirring often. Drain; rinse.", "Meanwhile, bring vegetable broth to simmer. Add green onions and ginger strips. Season with salt and pepper.", "Using tongs, divide noodles among bowls. Divide mushrooms, yams, snow peas, cabbage, and carrots among bowls, each in separate mound. Divide tofu, if using, among bowls. Ladle broth over and serve, passing sambal oelek and tamari separately."]}, "Ultimate Grilled Cheese Sandwich": {"ingredients": ["Butter", "4 slices country white sourdough bread, cut on deep diagonal into 1/3-inch-thick slices (each about 7x3 1/2 inches)", "4 thin slices prosciutto", "8 large fresh basil leaves", "8 1/4-inch-thick slices young Asiago cheese or drained fresh mozzarella cheese", "1/4 teaspoon dried crushed red pepper", "2 tablespoons olive oil", "6 1/3-inch-thick slices heirloom tomato (from about 1 large)"], "instructions": ["Preheat oven to 400°F. Lightly butter 1 side of each bread slice. Place 2 bread slices, buttered side down, on work surface. Top each with 2 prosciutto slices, then 4 basil leaves, then 4 cheese slices. Sprinkle with salt and crushed red pepper. Top with remaining 2 bread slices, buttered side up. Heat olive oil in heavy large ovenproof skillet over medium-high heat. Add sandwiches to skillet and cook until golden on bottom, about 4 minutes. Turn sandwiches over; transfer skillet to oven and bake until golden and cheese melts, about 5 minutes. Remove from oven. Carefully lift off top bread slices from sandwiches and insert 3 tomato slices into each, then cover with bread tops and serve."]}, "Upside-Down Mascarpone Cheesecake": {"ingredients": ["Nonstick vegetable oil spray", "3 1/4 cups red seedless grapes, divided", "2 tablespoons frozen grape juice concentrate (with Concord grapes), thawed", "1 cup sugar, divided", "2 teaspoons cornstarch", "1 1/2 teaspoons raspberry vinegar", "1 1/2 8-ounce packages cream cheese, room temperature", "1 1/2 cups all purpose flour", "1 8-ounce container mascarpone cheese*", "3 large eggs"], "instructions": ["Preheat oven to 350°F. Spray 9-inch-diameter cake pan with 2-inch-high sides with nonstick spray. Puree 1 cup grapes and grape juice concentrate in blender until as smooth as possible. Pour puree into medium saucepan. Add 1/4 cup sugar and cornstarch; stir to dissolve cornstarch. Add remaining 2 1/4 cups grapes. Stir over medium heat until mixture thickens, boils, and becomes clear, 2 to 3 minutes (grapes will remain whole); mix in vinegar. Pour into prepared cake pan. Spread grapes in single layer; cool.", "Beat cream cheese, flour, and 3/4 cup sugar in large bowl until smooth. Beat in mascarpone, then eggs, 1 at a time. Spoon batter over grape mixture.", "Bake cake until just set in center, about 45 minutes. Place cake directly into refrigerator; chill uncovered until cold, at least 4 hours and up to 1 day.", "Cut around cake. Place plate over pan; hold plate and pan together and invert. Lift off pan. Cut cake into wedges.", "*An Italian cream cheese; sold at many supermarkets and at Italian markets."]}, "Ultimate Sticky Buns": {"ingredients": ["1 cup warm water (105°F to 115°F)", "4 teaspoons dry yeast", "2/3 cup sugar", "1/2 cup (1 stick) unsalted butter, room temperature", "1/2 cup dry nonfat milk powder", "1 1/4 teaspoons salt", "2 large eggs", "4 1/4 cups (or more) all purpose flour", "1 1/4 cups (packed) golden brown sugar", "3/4 cup (1 1/2 sticks) unsalted butter, room temperature", "1/4 cup honey", "1/4 cup dark corn syrup", "1/4 cup water", "2 cups pecan halves", "4 teaspoons sugar", "4 teaspoons ground cinnamon"], "instructions": ["Mix 1/4 cup warm water, yeast and pinch of sugar in small bowl. Let stand until foamy, about 8 minutes. Using electric mixer, beat remaining sugar, butter, milk powder and salt in large bowl until well blended. Beat in eggs 1 at a time. Mix in remaining 3/4 cup warm water and yeast mixture, then 3 cups flour, 1 cup at a time. Using rubber spatula, mix in 1 cup flour, scraping down sides of bowl frequently (dough will be soft and sticky). Sprinkle 1/4 cup flour onto work surface and knead until smooth and elastic, adding more flour if sticky, about 8 minutes.", "Butter another large bowl. Add dough; turn to coat. Cover bowl with plastic wrap and let dough rise in warm area until doubled, about 2 1/2 hours.", "Butter two 10-inch round cake pans with 2-inch high sides. Beat brown sugar, 1/2 cup butter, honey, corn syrup and 1/4 cup water in medium bowl to blend. Spread half of glaze in bottom of each prepared pan. Sprinkle 1 cup pecans over each.", "Punch down dough. Divide dough in half. Roll each dough piece out on floured work surface to 12x9-inch rectangle. Brush any excess flour off dough. Spread remaining butter over dough rectangles, dividing equally. Mix 4 teaspoons sugar and cinnamon in small bowl. Sprinkle cinnamon sugar over rectangles. Starting at 1 long side, tightly roll up each rectangle into log. Cut each log into 12 rounds. Place 12 rounds, cut side down, in each prepared pan, spacing evenly. Cover with plastic wrap. DO AHEAD Can be made 1 day ahead; refrigerate. Let buns rise in warm area until almost doubled, about 1 hour (or 1 hour 25 minutes if refrigerated).", "Preheat oven to 375°F. Bake buns until deep golden brown, about 30 minutes. Run small knife around pan sides to loosen sticky buns. Turn hot buns out onto platter. Cool about 30 minutes and serve."]}, "Upside-Down Honey Cheesecakes": {"ingredients": ["1 cup sugar", "1/3 cup honey", "1/4 cup (1/2 stick) unsalted butter", "1/3 cup water", "", "3 (8-ounce) packages cream cheese, room temperature", "2/3 cup (packed) golden brown sugar", "1 cup sour cream", "2 teaspoons fresh lemon juice", "2 teaspoons vanilla extract", "4 large eggs, room temperature", "", "Assorted fresh berries (for garnish)"], "instructions": ["Preheat oven to 300°F. Butter twelve 3/4-cup ramekins or custard cups. Place 1 cup sugar, honey, and butter in heavy medium saucepan. Stir over medium heat until butter melts and mixture is blended. Increase heat to medium-high and bring to boil. Whisk until mixture darkens slightly and candy thermometer registers 300°F, about 5 minutes. Remove from heat; add 1/3 cup water (mixture will bubble vigorously); whisk to blend. Divide topping among ramekins (about 2 tablespoonfuls for each). Divide ramekins between 2 roasting pans and chill while preparing filling.", "Using on/off turns, blend cream cheese and brown sugar in processor, scraping bowl occasionally. Add sour cream, lemon juice, and vanilla; process until smooth. Add eggs 1 at a time, processing just to blend between additions. Divide filling among ramekins. Add enough hot water to pans to come halfway up sides of ramekins.", "Bake cheesecakes until set, about 35 minutes. Remove from roasting pans and chill until firm, about 1 hour. DO AHEAD: Can be made 2 days ahead. Cover and keep chilled.", "Run thin knife around sides of ramekins. Invert onto plates, scooping any remaining topping from ramekins over cheesecakes. Garnish with berries."]}, "Upside-Down Butterscotch Apple Sour Cream Cake": {"ingredients": ["1 1/2 cups all purpose flour", "1 1/2 teaspoons baking powder", "3/4 teaspoon salt", "1/2 cup (1 stick) unsalted butter, room temperature", "2/3 cup baker's sugar (superfine sugar) or regular sugar", "2 large eggs", "1 1/2 teaspoons vanilla extract", "1/2 cup sour cream", "1/2 Golden Delicious apple, peeled, cored, finely chopped (about 3/4 cup)", "6 tablespoons (3/4 stick) unsalted butter", "1/3 cup (packed) dark brown sugar", "1/3 cup butterscotch morsels", "2 8-ounce Golden Delicious apples, peeled, halved, cored, cut into 1/4-inch-thick slices"], "instructions": ["Preheat oven to 375°F. Mix flour, baking powder, and salt in medium bowl. Using electric mixer, beat butter in large bowl until smooth. Gradually add sugar and beat until well blended. Add eggs and vanilla; beat until blended. Beat in flour mixture, then sour cream. Stir in chopped apple. Set aside while preparing butterscotch-caramel apples.", "Melt butter in 10-inch-diameter nonstick ovenproof skillet over medium heat. Add brown sugar and butterscotch morsels; stir until melted and smooth and mixture is bubbling, about 2 minutes. Add apple slices to skillet and cook until golden brown, using tongs to turn slices, about 3 minutes per side (there will be a lot of liquid in skillet). Remove skillet from heat and let cool 3 minutes. Using tongs, arrange apple slices in skillet in concentric circles or other pattern.", "Carefully spoon cake batter in small dollops atop apples in skillet. Using offset spatula, gently spread batter evenly to edges of skillet (batter will seem to float on top of apples and pan juices). Bake until cake is golden brown and tester inserted into center comes out clean, about 30 minutes. Cool in skillet 10 minutes. Run knife around edges of cake to loosen. Place large platter atop skillet. Using oven mitts or pot holders, hold platter and skillet firmly together and invert, allowing cake to settle onto platter. Serve cake warm."]}, "Upside-Down Caramelized Apricot Tart": {"ingredients": ["1/2 to 3/4 cup sugar", "2 tablespoons water", "3 tablespoons unsalted butter", "2 tablespoons whipping cream", "9 fresh apricots, halved, pitted, or 18 canned apricot halves in extra light syrup (from three 15-ounce cans), well drained", "1 sheet frozen puff pastry (half of 17.3-ounce package), thawed"], "instructions": ["Position rack in center of oven and preheat to 425°F. Combine 1/2 cup sugar if using canned apricots (or 3/4 cup sugar if using fresh apricots) and 2 tablespoons water in heavy small saucepan. Stir over medium-low heat until sugar dissolves. Increase heat and boil without stirring until syrup is deep amber, occasionally brushing down sides of pan with pastry brush dipped into water and swirling pan, about 8 minutes. Add butter and cream (mixture will bubble vigorously). Stir over low heat until any caramel bits are dissolved. Immediately pour caramel into nonstick 10-inch-diameter ovenproof skillet; swirl to cover bottom of skillet. Carefully place apricot halves, rounded side down, tightly together atop caramel.", "Roll out puff pastry sheet on lightly floured surface to 12 1/2-inch square. Using 12-inch tart pan bottom or platter as guide, cut pastry into 12-inch round. Place puff pastry round atop apricots in skillet. Gently press down pastry around apricots at edge of skillet.", "Bake tart until pastry is puffed and deep golden, about 25 minutes. Remove from oven; cool 1 minute. Cut around edge of pastry to loosen. Place large rimmed platter atop skillet. Using oven mitts as aid, hold skillet and platter tightly together and invert, allowing tart and syrup to fall onto platter. Carefully lift off skillet. Rearrange any apricots that may have become dislodged. Serve warm."]}}