{"Yorkshire puddings with black pudding and beer and onion gravy": {"ingredients": ["1kg/2lb 3oz beef bones (such as rib, short rib, knuckle or thigh bones)", "1-2 tbsp sea salt flakes", "2 large onions, peeled, cut into quarters", "2 carrots, peeled, chopped", "2 celery stalks, trimmed, cut in half", "350ml/13fl oz light beer, preferably from North Yorkshire", "1 bouquet garni (1 sprig each of parsley, bay leaves and thyme, tied together with cooking string)", "10 black peppercorns", "4 whole garlic cloves, unpeeled", "1 tsp tomato purée", "2 bay leaves", "1.5 litres/2 pints 12¾fl oz water", "4 heaped tbsp plain flour", "½ tsp salt", "2 free-range eggs, beaten", "275ml/10fl oz full-fat milk", "2 tbsp vegetable oil or sunflower oil, plus extra for greasing", "50g/2oz beef fat, sliced into thin strips (ask your butcher for this)", "1-2 tbsp sea salt flakes", "2 onions, peeled, finely chopped", "1.5 litres/2 pints 12¾fl oz beef stock (see above)", "1 tbsp redcurrant jelly", "175ml/6fl oz beer (ale), preferably from Yorkshire", "2 tsp plain flour", "2 tsp water", null, "12 individual black pudding sausages (or 12 slices from a large black pudding), fried until crisp"], "instructions": ["For the beef stock, preheat the oven to 230C/450F/Gas 8.", "Place the beef bones into a roasting tray and sprinkle over the salt flakes. Roast in the oven for 25-30 minutes, or until well browned.", "Add the onions, carrots and celery to the roasting tray and return to the oven for a further 12-15 minutes, or until the vegetables have browned.", "Transfer the bones and vegetables to a large stock pot.", "Add the light beer to the roasting tray and bring to a simmer, scraping up any browned bits up from the bottom of the tray using a wooden spoon to deglaze. Add the mixture to the pan.", "Add the bouquet garni, peppercorns, garlic cloves, tomato purée and bay leaves to the pan and stir well. Add the water and bring the mixture slowly to the boil. Reduce the heat until the mixture is simmering, then continue to simmer gently for two hours, skimming off any fat that rises to the surface of the liquid at regular intervals.", "Strain the stock into a clean pan and set aside to cool (skim off any remaining fat before using).", "For the Yorkshire pudding, decrease the oven temperature to 220C/425F/Gas 7.", "Sift the flour with the salt into a bowl and make a well in the centre.", "Gradually add the beaten eggs to the well and work it into the centre of the flour mixture a little at a time. Gradually whisk in the milk a little at a time until the batter has the consistency of single cream. Set aside for at least an hour to rest.", "When the batter has rested for one hour, drizzle a little oil into each of the wells of a 12-hole Yorkshire pudding tray.", "Heat the oil in the oven until smoking hot, then quickly three-quarters fill each well with some of the Yorkshire pudding batter using a ladle and return to the oven. Bake for 25-30 minutes, or until the Yorkshire puddings have risen and are golden-brown.", "Meanwhile, for the gravy, place the sliced beef fat into a large frying pan over a medium to high heat and sprinkle over the salt. Fry for 2-3 minutes, or until the fat begins to melt. (Remove any strips of fat that haven't melted from the pan and discard).", "Add the onions to the hot fat and fry for 4-5 minutes, or until softened. Add the beef stock and beer and bring the mixture to the boil. Reduce the heat until the mixture is simmering, then continue to simmer for 15 minutes, or for longer if you prefer thicker gravy.", "Add the redcurrant jelly and stir well until dissolved. Continue to simmer for a further 4-5 minutes. Season, to taste, with salt and freshly ground black pepper. (NB: The leftover beef stock can be set aside to cool, then frozen in ice cube trays and kept for up to six months.)", "To serve, place two Yorkshire puddings onto the centre of each of four serving plates. Arrange three of the black pudding sausages between the Yorkshire puddings. Drizzle over the gravy."]}, "Yorkshire curd tart": {"ingredients": ["250g/9oz plain flour, plus extra for dusting", "100g/3½oz caster sugar", "100g/3½oz chilled butter, diced", "2 free-range egg yolks, beaten", "170g/6oz curd cheese (available from some large supermarkets)", "100g/3½oz caster sugar", "100g/3½oz butter, softened", "10g/¼oz plain flour", "50g/1¾oz raisins", "1 free-range egg, beaten", "1 lemon, zest only", "pinch nutmeg", "50g/1¾oz lemon curd "], "instructions": ["For the sweet shortcrust pastry, grease and flour a 30cm/12in tart tin.", "Place the flour, caster sugar and chopped cold butter into a bowl or food processor. Gently rub the ingredients together with your fingertips or blend until the mixture resembles breadcrumbs.  ", "Add the beaten eggs and combine to form a light dough (add 2-3 tablespoons of water if needed).  ", "Form the dough into a ball and transfer to the fridge to chill for 30 minutes. ", "Preheat the oven to 180C/350F/Gas 4.", "On a lightly floured work surface, roll out the dough to 5mm/¼in thick. ", "Line the prepared tart tin with the pastry and trim any excess from the edges. Any unused pastry can be frozen for later use.", "Lay a piece of greaseproof paper over the pastry and fill with baking beans or dry pulses. Bake blind for 15-20 minutes at until dry and firm to touch.  ", "Remove the pastry case from the oven. Remove the baking beans and greaseproof paper. Set aside.", "For the filling, drain the liquid from the curd cheese by placing it in a sieve. Use the back of a spoon to squeeze out any excess moisture. Discard the liquid.", "In a bowl, beat the sugar and butter until smooth and pale.", "Add the flour, raisins, egg, curd cheese, lemon zest and nutmeg. Mix well.", "Spread the lemon curd over the pastry base, then fill with the curd cheese mix. Smooth the surface with a pallet knife or the back of a spoon.", "Bake for 35-40 minutes, or until the pastry is golden-brown and the filling set. ", "Allow the tart to cool in the tin for 20-25 minutes. ", "Remove from the tin and serve in slices."]}, "Yunnanese seared beef with mint, fermented chilli bean, lime and lemongrass dressing": {"ingredients": ["300g/10½oz well-marbled, dry-aged rib-eye beef", "1 tbsp vegetable oil", "100g/3½oz butter", "5cm/2in piece cucumber, peeled and chopped into bite-sized pieces", "12 mint leaves, deep-fried, plus 8 fresh mint leaves to garnish", "salt and white pepper", "2 tbsp white rice vinegar", "2 tbsp clear honey", "1 tsp chopped lemongrass", "pinch salt", "pinch white pepper", "1 tbsp lime juice", "1 tsp fermented chilli bean paste"], "instructions": ["Heat a dry, heavy-based frying pan until extremely hot. Rub the beef with the oil, season with salt and pepper and sear on both sides until you have a brown crust. Add the butter to the pan and baste the beef with the melted butter for 1-5 minutes, depending on how well-done you like your beef. Remove the beef from the pan and leave to rest for 10 minutes.", "For the dressing, combine all the ingredients in a saucepan and warm gently.", "Slice the beef into thin slices and pour over the dressing, then scatter over the cucumber pieces and the deep fried mint leaves. To finish, scrunch up the fresh mint leaves in your hand to release the aroma and scatter them over the beef."]}, "Yorkshire puddings with onion gravy": {"ingredients": ["225g/8oz plain flour", "8 free-range eggs", "500ml/18fl oz whole milk", "salt and freshly ground black pepper", "75g/2¾oz beef dripping", "250ml/9fl oz red wine", "1 litre/1¾ pints fresh beef or veal stock", "50g/1¾oz butter", "3 onions, thinly sliced", "3 sprigs thyme, leaves picked", "50ml/1¾fl oz brandy"], "instructions": ["For the Yorkshire puddings, place the flour into a bowl, whisk in the eggs and milk until as smooth as possible then season with salt and black pepper.", "Pour into a jug and place in the fridge to rest, preferably overnight.", "Heat the oven to 220C/425F/Gas 7.", "Place a 12 hole deep muffin tin into the oven and leave for five minutes, then add a little beef dripping into each of the holes and leave to heat for 5-10 minutes, or until smoking hot.", "Take the batter from the fridge and whisk one more time. Carefully pour the batter into the tins and bake for 10-15 minutes until golden-brown and risen around the edges.", "For the onion gravy, place the red wine into a wide sauté pan and heat until reduced by half. Add the stock and cook over a very low heat until reduced by half again.", "Meanwhile, heat a large pan until hot then add the butter, sliced onions and thyme leaves and cook for 12-15 minutes, or until soft and lightly golden-brown.", "Add the brandy and flambé to burn off the alcohol (CAUTION: Keep your face and hair away from the flames. Do not leave unattended.). Add the reduced stock and bring to the boil.", "Reduce the heat to a simmer and cook for another five minutes then season with salt and freshly ground black pepper.", "To serve, pour the onion gravy over the warm Yorkshire puddings."]}, "Yorkshire puddings with rib of beef and seasonal cabbage": {"ingredients": ["225g/8oz plain flour", "salt and freshly ground black pepper", "8 free-range eggs", "600ml/20fl oz whole milk", "50g/1¾oz beef dripping or lard", "4kg 28-day-old forerib of beef, on the bone", "50ml/2fl oz olive oil", "50g/1¾oz unsalted butter", "1 savoy cabbage, core removed, finely sliced", "2 tbsp caraway seeds", "beef jus or gravy, to serve"], "instructions": ["For the Yorkshire puddings, place the flour into a bowl and season with salt and freshly ground black pepper.", "Add the eggs and milk to the bowl and whisk to make a smooth batter.", "Cover and place in the fridge to chill for at least one hour, but preferably overnight.", "For the beef, preheat the oven to 200C/400F/Gas 6.", "Heat a frying pan until very hot. Season the beef with salt and freshly ground black pepper and brush with a little olive oil. Add the beef to the hot pan. Fry on all sides in the hot pan until nicely browned.", "Transfer the beef to a roasting dish and place in the oven to cook for 1 hour 10 minutes for rare, or longer to suit your taste.", "Remove the beef from the oven, cover with foil and rest in a warm place for 15-30 minutes.", "For the Yorkshire puddings, preheat the oven to 220C/450F/Gas 7. Divide the dripping or lard between two 12-hole muffin tins or Yorkshire tins and place the tins in the oven for ten minutes until smoking hot.", "Carefully pour the batter into the tins, filling the tins two-thirds full.", "Place the tins into the oven and cook the Yorkshire puddings for 20 minutes - do not open the oven door during this time.", "After 20 minutes, open the door to allow any steam to escape and turn the temperature down to 190C/375F/Gas 5. Continue to cook until the Yorkshire puddings are golden-brown and crisp.", "For the seasonal cabbage, heat a large frying pan and add the butter. Once hot add the cabbage and a little water. Add the caraway seeds and cook for 2-3 minutes until the cabbage has wilted.", "To serve, carve the beef and place on plates along with the Yorkshire puddings and cabbage. Pour the beef jus or gravy over the beef and puddings."]}, "Yorkshire fillet steak with fries and béarnaise sauce": {"ingredients": ["oil, for deep frying", "3 tbsp tarragon vinegar", "3 tbsp white wine", "¼ tsp white peppercorns", "½ small banana shallot, finely chopped", "125g/4½oz butter", "2 free-range egg yolks", "sea salt and freshly ground black pepper", "½ lemon, juice only", "1 tbsp chopped tarragon leaves ", "1 tbsp olive oil", "1 x 200g/7oz good-quality fillet steak", "100g/3½oz frozen chips"], "instructions": ["Preheat the oven to 200C/400F/Gas 6.", "Preheat a deep-fat fryer to 180C/350F. Alternatively fill a large heavy-based pan with oil and heat, using a cooking thermometer to check the temperature. (CAUTION: hot oil can be dangerous. Do not leave unattended.)", "Put the vinegar, white wine, peppercorns and shallot into a small saucepan and bring to the boil. Simmer until the volume of liquid has reduced to about one tablespoon. Strain the liquid into a bowl and then set aside to cool. ", "Meanwhile, melt 100g/3½oz of the butter in a small saucepan set over a medium heat. ", "Put the egg yolks in a bowl set over a pan of simmering water and whisk until thickened and light in colour. Gradually add the melted butter, whisking constantly.", "Season with salt and black pepper, add the cooled shallot reduction and the chopped tarragon leaves and mix well.", "Turn off the heat and leave the bowl over the pan until ready to use.", "Heat a frying pan until searing hot. Add the olive oil and steak and cook on one side for 2-3 minutes, before turning over and placing in the oven for 2-3 minutes.", "While the steaks are in the oven, carefully lower the chips into the deep-fat fryer and cook for 3-4 minutes, or until golden-brown and cooked through.", "Remove the steak from the oven and add the remaining butter to the pan. Spoon the melted butter over the steak repeatedly for at least 2-3 minutes while the steak rests – this will give a lovely shine and add to the flavour. ", "To serve, place the steak on a plate, pile the chips alongside and then finish with a dollop of béarnaise sauce."]}, "Yorkshire curd pie": {"ingredients": ["2 litres/3 pints whole milk", "1 lemon, juice only", "400g/14oz plain flour, plus extra for dusting", "pinch salt", "110g/4oz butter, cut into pieces", "110g/4oz lard, cut into pieces", "3-4 tbsp cold water", "110g/4oz butter, softened", "1 tbsp rosewater", "2 free-range eggs, beaten", "110g/4oz currants"], "instructions": ["Begin the day before you want to make the pie. For the curds, bring the milk to the boil in a pan. Add the lemon juice and stir well - the mixture will curdle quite quickly. Remove from the heat and allow to cool, then pour into a muslin-lined sieve placed over a bowl and leave overnight to strain until solid. Refrigerate the solid curds once separated - discard any liquid.", "The next day, for the pastry, sift the flour and salt into a mixing bowl. Add the butter and lard and rub together until the mixture resembles fine breadcrumbs. Add the water and stir until the mixture comes together, then turn out onto a lightly floured work surface and knead briefly until smooth. Wrap the dough in cling film and place in the fridge for 30 minutes to rest.", "Remove the dough from the fridge and roll out to 0.5cm/¼in thick. Line a deep 20cm/8in loose-bottomed tart tin with the pastry, prick the base all over with a fork and place into the fridge to rest for ten minutes.", "Preheat the oven to 200C/400F/Gas 6.", "Line the pastry case with baking paper and fill with rice or baking beans. Transfer to the oven and bake for 15 minutes. Remove the baking paper and rice or beans and return to the oven for five minutes, or until lightly golden.", "To make the pie, place the softened butter into a bowl, add the rosewater and mix well. Add the solid curds and the beaten eggs to the bowl and stir well. Add the currants and mix thoroughly.", "Pour the mixture into the pastry case and bake for 20-30 minutes, or until the filling is set and lightly golden. Remove from the oven and leave to cool.", "To serve, remove the pie from the tin, cut into wedges and place onto serving plates."]}, "Yorkshire pudding wraps": {"ingredients": ["150g/5½oz plain flour", "pinch salt", "4 free-range eggs, beaten", "250ml/9fl oz milk", "1½ tbsp beef dripping or lard", "25g/1oz butter", "2 large onions, thinly sliced", "2 bay leaves", "dollop yeast extract, such as Marmite", "25g/1oz plain flour", "600ml/20fl oz beef stock", "few thyme sprigs", "dash Worcestershire sauce ", "salt and freshly ground black pepper", "1 tsp mustard powder", "1 tsp crushed black peppercorns", "1 tsp salt", "500g/1lb 2oz sirloin steak, at room temperature", "sauerkraut and pickles, to serve"], "instructions": ["To make the batter, put the flour and salt in a large bowl and beat in the eggs until you have a thick paste. Gradually whisk in the milk until you have a lump-free batter. Cover and leave to stand for 30 minutes. ", "Preheat the oven to 220C/200C Fan/Gas 7 and preheat a 23cm/9in ovenproof frying pan.", "To make the gravy, heat the butter in a large saucepan and add the onions. Add 2 tablespoons of water, then partially cover and cook for a few minutes until the onions have softened. Turn up the heat, remove the lid and continue to cook, stirring regularly, until the onions have started to caramelise and are a rich brown colour. Add the bay leaves, yeast extract, sprinkle in the flour and stir. Add the stock gradually, around 100ml/3½fl oz at a time, stirring well between each addition, until it is all incorporated. Add the thyme, season with salt and pepper and add the Worcestershire sauce. Bring to the boil, then turn down the heat and simmer for around 10 minutes until slightly reduced. Keep warm until ready to use.", "Meanwhile, transfer the batter to a jug. Carefully remove the frying pan from the oven, add 1 teaspoon of beef dripping and allow to melt. Set the pan over a high heat and add a fifth of the batter, swirling it round so it coats the base of the pan. Immediately return to the oven and cook for 5 minutes. Remove, flip over and cook for 3 minutes more. Remove from the oven and leave to cool and soften slightly. Repeat four times with remaining batter to create five wraps, keeping the cooked wraps warm in a very low oven. ", "To cook the steak, mix the mustard powder, peppercorns and salt in a small bowl and rub all over the steak. Heat a griddle pan over a very high heat until hot and griddle the steak for 1–2 minutes on each side, or to your preference. Remove from the griddle and leave to rest for 5–10 minutes before slicing thinly. Add any resting juices to the gravy.", "To make the wraps, crisp up the Yorkshire puddings by placing them in a hot griddle pan for 1 minute on each side. Top each wrap with a fifth of the meat, pour over some gravy and fold it over. Repeat with the remaining four wraps and serve with the sauerkraut and pickles. "]}, "Yorkshire pudding ": {"ingredients": ["100g/3½oz plain flour", "¼ tsp salt", "3 large free-range eggs ", "225ml/8fl oz milk", "4 tbsp sunflower oil"], "instructions": ["Preheat the oven to 220C/200C Fan/Gas 7.", "Mix the flour and salt together in a bowl and make a well in the centre. Add the eggs and a little of the milk. Whisk until smooth, then gradually add the remaining milk. This can be done with a wooden spoon, but is easier with an electric hand-held whisk. Pour the mixture into a jug.", "Measure a teaspoon of oil into each hole of a 12-bun tray, or a tablespoonful into each hole of a 4-hole tin, or 3 tablespoons into a roasting tin. Transfer to the oven for 5 minutes, or until the oil is piping hot.", "Carefully remove from the oven and pour the batter equally between the holes or the tin. Return the batter quickly to the oven and cook for 20–25 minutes (35 if making the Yorkshire pudding in the roasting tin), or until golden-brown and well-risen. Serve immediately."]}, "Yorkshire pudding with red onion gravy": {"ingredients": ["250g/10oz plain flour", "8 medium free-range eggs", "salt and freshly ground black pepper", "500ml/1 pint full fat milk", "100g/4oz beef dripping", "30g/1¼oz butter", "2 red onions, thinly sliced", "2 cloves garlic, grated", "200ml/7fl oz red wine", "1 litre/2 pints fresh beef stock", "2 sprigs thyme", "2 tbsp balsamic vinegar"], "instructions": ["Preheat oven to 220C/430F/Gas 8. ", "Place the flour, eggs and seasoning into a food processor.", "Turn on and blend to a paste before adding the milk. Continue to process until a smooth batter is formed.", "Pour into a jug and place in the fridge to rest. This works best if you are able to leave it overnight.", "Place the Yorkshire tins on a baking tray, then put the beef dripping into the tins and place in the oven. Heat for 5-10 minutes until smoking hot.", "Pour the batter into the tins and bake for 10-15 minutes until golden brown and risen around the edges.", "Meanwhile, heat a sauté pan until hot then add the butter, sliced onions and garlic and cook for 8-10 minutes until tender but not coloured.", "Add the red wine and reduce by half.", "Add the beef stock and bring to the boil.", "Reduce the heat to a simmer, add the balsamic vinegar and thyme and cook for 10-15 minutes.", "Season with salt and black pepper.", "Serve poured over the Yorkshire Pudding."]}, "Yorkshire oatmeal parkin ": {"ingredients": ["250g/9oz butter or margarine", "250g/9oz golden syrup ", "125g/4½oz black treacle ", "500g/1lb 2oz muscavado sugar", "375g/13oz plain flour ", "1½ tsp ground ginger ", "½ tsp baking powder", "500g/1lb 2oz oatmeal", "½ pint milk "], "instructions": ["Preheat the oven to 180C/350F/Gas 4. Line a 15x20cm/6x8in baking tin with greaseproof paper.", "In a pan, gently melt the butter (or margarine), golden syrup, black treacle and sugar until combined.  ", "Mix the remaining dry ingredients together in a large bowl.", "Add the hot syrup mixture and stir to combine.  Add the milk to help loosen the mixture.", "Pour into the prepared tin and bake for 35-45 minutes, or until springy to the touch."]}, "Yorkshire tea cake": {"ingredients": ["2 good-quality strong, black tea bags", "4 tbsp brandy ", "1 tsp rosewater ", "1 tbsp clear honey ", "115g/4oz sultanas", "75g/2½oz raisins", "50g/1¾oz currants", "180g/6½oz strong bread flour ", "1½ tsp baking powder", "½ tsp ground cinnamon ", "½ tsp ground nutmeg", "2 tbsp medium-cut orange marmalade ", "120g/4oz soft brown sugar", "1 large free-range egg, at room temperature, lightly beaten", "30g/1oz unsalted butter, melted and cooled until tepid", "2 tbsp marmalade", "marzipan fruits (optional) ", "gold leaf (optional)"], "instructions": ["Place the tea bags in a bowl and add 200ml/7fl oz hot water, the brandy, rosewater, honey and dried fruit. Cover and soak overnight, or until the fruit is plump. (If you are short of time, you can cheat a little by warming the ingredients gently to speed up the process).  ", "Preheat the oven to 180C/350F/Gas 4 and line a 450g/1lb loaf tin with baking paper.", "When the fruit is plump, strain it and discard the liquid and tea bags. ", "Sift the flour, baking powder, cinnamon and nutmeg into a large bowl. Add the marmalade and brown sugar. Stir in the egg and melted butter and combine to form a soft dough.  Add the fruit and thoroughly mix together.", "Transfer the mixture to the prepared loaf tin and bake for 50-60 minutes, or until a wooden skewer comes out clean.", "Remove from the oven and leave in the tin for 10 minutes. Turn out and cool on wire rack.", "To decorate the cake, brush the cake with marmalade. Cut the marzipan fruits in half and place on top of the cake. Use the gold leaf to gilt the marzipan fruits."]}, "Yorkshire parkin": {"ingredients": ["225g/8oz self raising flour ", "110g/4oz caster sugar ", "1 tsp ground ginger ", "1 tsp bicarbonate of soda ", "1 egg ", "200ml/7fl oz milk ", "55g/2oz butter ", "110g/4oz golden syrup"], "instructions": ["Preheat the oven to 150C/300F/Gas 2. Line a 22cm/8in tin. ", "Sieve the flour, sugar, ginger and bicarbonate of soda into a large bowl. ", "In a small pan gently heat the butter and syrup until melted. ", "Beat the egg into the milk. ", "Gradually pour the butter and syrup into the flour and stir. The mixture will be thick. ", "Pour in the egg and milk and stir until smooth and pour into the lined tin. ", "Bake for about an hour or until a skewer inserted into the centre of the cake comes out clean"]}, "Yoghurt cake": {"ingredients": ["3 free-range eggs", "125g/4½oz full-fat Greek yoghurt ", "120ml/4fl oz sunflower or other neutral-tasting oil, plus extra for greasing", "180g/6oz caster sugar , plus extra to glaze ", "180g/6oz plain flour ", "2 tsp baking powder", "pinch fine salt", "½ tsp rosewater (optional)", "1 lime, finely grated zest and juice, plus extra zest for decoration ", "fresh berries, to serve"], "instructions": ["Preheat the oven to 190C/170C Fan/Gas 5. Grease the sides of a 23cm/9in round cake tin and line the base with baking paper. ", "Mix together the eggs, yoghurt and sunflower oil in a large bowl. Add the rest of the ingredients (apart from the lime juice) and beat together until well combined. Tip the mixture into the prepared tin and bake for about 30 minutes, or until a skewer inserted into the centre comes out clean. ", "Whilst the cake is cooking, mix together the lime juice with an equal volume of caster sugar (for example 2 tablespoons of juice with 2 tablespoons of sugar) and set aside to dissolve. Sprinkle in the extra zest to add a bit of colour to the top of the cake. ", "Leave the cake to cool in the tin for 10 minutes, then turn out onto a wire rack. Brush the lime glaze over the top and leave to cool. Serve the cake in slices with the fresh berries alongside ."]}, "Yaki udon": {"ingredients": ["1 onion, sliced", "1 carrot, cut in half lengthways, then into 5mm/¼in-thick diagonal slices", "1 tbsp sunflower oil", "75g/2¾oz shiitake mushrooms, quartered", "¼ sweetheart cabbage, cut into 1cm/½in wide strips", "85–100g/3–3½oz broccoli, cut into small florets", "3 spring onions, sliced, green and white kept separate", "2 garlic cloves, crushed", "2 tsp grated fresh ginger", "300g/10½oz cooked udon noodles ", "2 tbsp mirin ", "2 tbsp soy sauce", "1 tsp rice vinegar", "2 tsp sesame oil", "1 tsp black sesame seeds (optional)", "1 tbsp pickled ginger (optional), to serve"], "instructions": ["Put the onion, carrot and sunflower oil into a wok and cook over a medium heat for about 6–7 minutes, stirring frequently, until the onion is just starting to turn golden.", "Add the mushrooms, cabbage and broccoli to the wok along with the white parts of the spring onions, the garlic and grated ginger. Stir-fry over a medium heat for about 2 minutes, until the vegetables are tender.", "Add the noodles, mirin, soy sauce and rice vinegar and stir-fry until the noodles are hot through.", "Drizzle with sesame oil and scatter with the green parts of the spring onions and the sesame seeds, if using, and top with a little pickled ginger, if liked."]}, "Yorkshire ‘tapas’ puddings": {"ingredients": ["12 tsp sunflower oil ", "125g/4½oz plain white flour", "pinch salt", "1 tsp mustard powder ", "pinch black pepper", "75g/2½oz full-fat milk", "2 free-range medium eggs, beaten", "½ chicken stock cube ", "pinch saffron strands", "2 tbsp extra virgin olive oil", "1 small onion, thinly sliced", "2 large chicken breasts, cut into bite-sized pieces", "1 red chillies, thinly sliced", "large pinch ground cinnamon ", "2 tbsp cider vinegar ", "6 cherry tomatoes, cut into quarters", "1 tbsp honey", "1 tbsp sultanas", "50g/1¾oz flaked almonds, toasted ", "small handful fresh coriander "], "instructions": ["Preheat the oven to 250C/230C Fan/Gas 9.", "For the Yorkshire puddings, add 1 teaspoon of oil to each hole of a muffin tin. Place the tray on the top shelf of the oven to preheat the oil.", "In a large mixing bowl, sift in the flour, salt, mustard powder and pepper. In a jug, combine the milk and 75g/2½oz cold water. Make a well in the flour mixture and crack in the eggs. Whisk to combine (the consistency should be a very thick batter). Slowly add the milk mixture and whisk until the consistency of single cream. Decant into a pouring jug and leave to rest at room temperature for 30 minutes.", "Remove the preheated tins from the oven and quickly pour in about 5mm depth of batter into each hole, taking care to protect yourself from any splashes of hot oil. The oil should sizzle when the batter is poured in. ", "Quickly return to the top shelf of the oven and bake for 15 minutes until browned and well risen. Don’t open the oven door until they are cooked or the puddings will collapse. Remove each pudding from the tin and place on a wire rack to cool. ", "For the filling, put the stock cube in a measuring jug and add 200ml/7fl oz boiling water. Mix until dissolved then add the saffron. Set aside.", "Heat the oil in a large frying pan set over a medium heat. Add the onion and cook for 5 minutes until soft and golden-brown. Add the chicken and cook for 3 minutes, or until the chicken is starting to brown. Add the chilli and cinnamon and cook for a few minutes. Add the saffron stock, cider vinegar, tomatoes, honey and sultanas to the pan and bring to the boil. Turn down the heat and simmer for 10 minutes to reduce the sauce.", "Pick 12 coriander leaves and set aside to use as a garnish. Finely chop the remainder and stir into the sauce.", "To serve, use a paring knife to cut a well in the centre of each pudding. Fill each Yorkshire with the filling. Scatter the toasted almonds on top and garnish with a coriander leaf."]}, "Yusheng smoked salmon ‘prosperity’ salad": {"ingredients": ["1 stick cinnamon ", "1 star anise", "2 ripe plums, stones removed, quartered", "2 tbsp demerara sugar ", "2 limes, juice only", "50g/1¾oz mung bean or rice vermicelli noodles ", "1 tsp toasted sesame oil ", "4 pickled beetroots, grated ", "1 medium carrot, spiralized into noodles", "1 cucumber, spiralized into noodles ", "1 daikon or white turnip, spiralized into noodles", "1 pomelo (or 1 pink grapefruit), peeled and separated into segments", "2 spring onions, sliced into long strips, dipped in ice water for spring onion curls (optional) ", "4 slices smoked salmon", "1 handful peanuts, toasted ", "5 wonton wrappers, deep-fried, seasoned with salt and ground white pepper"], "instructions": ["In a small pan, add all the ingredients for the plum sauce with 200ml/7fl oz water. Cook until the liquid has turned syrupy and pink. Sieve the liquid and set aside to cool. Stir in the lime juice and store in the fridge until ready to serve.", "For the salad, cook the mung bean noodles according to the packet instructions. Drain, dress with the toasted sesame oil and keep chilled in the fridge. ", "Prepare all the other salad ingredients and keep them chilled in the fridge until ready to serve. ", "To assemble the dish, divide the salad ingredients between serving plates, separated out, not mixed. Layer the smoked salmon slices to resemble a rose decoration in the centre. ", "Before serving, drizzle the plum sauce over the top and sprinkle with peanuts. Let everyone toss the ingredients as high as possible with chopsticks, without it falling off the plate, saying aloud auspicious phrases for prosperity! Break over the wonton wrappers and serve immediately."]}, "Yoghurt and muesli": {"ingredients": ["150g/5½oz porridge oats", "50g/1¾oz barley or rye flakes", "25g/1oz sultanas", "50g/1¾oz ready-to-eat dried apricots", "150g/5½oz fat-free Greek-style yoghurt per portion, to serve"], "instructions": ["Mix all the ingredients, apart from the yoghurt, together in a bowl. ", "Serve one-eighth of the muesli with the yoghurt on top. Store the rest of the muesli in an airtight container to up to two weeks."]}, "Yorkshire puddings and French onion soup": {"ingredients": ["225g/8oz plain flour", "salt and freshly ground black pepper", "8 medium free-range eggs", "600ml/20fl oz whole milk", "55g/2oz dripping", "25g/1oz unsalted butter", "2 tbsp olive oil", "1kg/2lb 4oz white onions, finely sliced", "2 sprigs fresh thyme, leaves picked", "3 garlic cloves, finely chopped", "50ml/2fl oz dry sherry", "250ml/9fl oz white wine", "2 tbsp plain flour", "1.2 litres/2 pints fresh veal or beef stock", "1 tsp soft brown sugar", "salt and freshly ground black pepper", "4 slices of baguette", "110g/4oz emmental cheese, grated"], "instructions": ["For the Yorkshire puddings, to make the batter, place the flour in a large bowl and season with salt and pepper. Add the eggs and whisk. Gradually add the milk, whisking all the time.", "Let the batter rest for 24 hours in the fridge.", "To cook the Yorkshire puddings preheat the oven to 220C/450F/Gas 7.", "In a Yorkshire pudding tray with 8-12 holes place a little of the dripping in each hole and place in the hot oven until the fat is hot.", "Remove from the oven and pour in the batter. Place in the oven for 20-25 minutes. Turn down the heat to 190C/375F/Gas 5 and cook for a further 10 minutes.", "For the French onion soup, heat a large saucepan and add the butter and oil. Once hot, add the onions and thyme and fry for 20-25 minutes over a low heat, or until soft and golden-brown.", "Add the garlic and cook for another couple of minutes then add the sherry and white wine. Cook until the liquid has reduced in volume by half.", "Stir in the flour and cook for a further couple of minutes, then pour in the stock. ", "Bring to a simmer and cook gently for 10-15 minutes and season with the sugar, salt and pepper.", "To make baguette croutons, preheat the grill to high. ", "Place the bread on a baking sheet and lightly toast under the grill, then add the grated cheese and return to the grill until golden-brown.", "To serve, ladle some of the soup into warm bowls and top with the cheesy croutons.", "Place the Yorkshire puddings a plate and serve the rest of the soup with them."]}, "Yorkshire pot with Christmas trimmings": {"ingredients": ["butter, for greasing", "1 Yorkshire pot - 1 partridge, 1 pheasant, 1 chicken, 1 duck stuffed one inside each other (available ready-made from large supermarkets and some butchers)", "50g/2oz butter", "1 leek, cut in half lengthways, cleaned", "10 floury potatoes (such as King Edward or Maris Piper), peeled, halved", "50g/2oz lard or beef dripping", "salt", "1 onion, studded with 3 cloves", "500ml/18fl oz milk", "85-110g/3-4oz fresh white breadcrumbs", "50g/2oz butter", "50ml/2fl oz double cream", "freshly grated nutmeg", "pinch white pepper", "pinch cayenne pepper", "900g/2lb cranberries", "900g/2lb Bramley apples, peeled, chopped", "700ml/1 pint 5fl oz water", "½ tsp ground cloves", "½ tsp ground cinnamon", "450g/1lb caster sugar", "4 tbsp malt vinegar", "salt", "450g/1lb Brussels sprouts, trimmed", "1 tsp olive oil", "225g/8oz pancetta, cut into cubes"], "instructions": ["Preheat the oven to 160C/320F/Gas 3.", "For the Yorkshire pot, butter a large piece of kitchen foil. Wrap the Yorkshire pot in the buttered foil to cover completely.", "Place the leek halves into a roasting tin and place the foil-wrapped Yorkshire pot onto the leeks. Transfer to the oven and roast for 2½ hours.", "Remove the Yorkshire pot from the oven and remove the foil.", "Increase the oven temperature to 200C/400F/Gas 6.", "Return the Yorkshire pot to the oven and cook for a further 10-15 minutes, or until golden-brown all over and completely cooked through. Check that the birds are cooked by placing a knife into the centre - the juices should run clear. If they are at all bloody, return to the oven and cook until the juices run clear. Remove from the oven and rest for 15 minutes before serving.", "For the roast potatoes, keep the oven temperature at 200C/400F/Gas 6.", "Place the potatoes into a saucepan and cover with water, and add a pinch of salt. Bring to the boil and cook for 3-4 minutes, then drain into a colander.", "Place a deep roasting tray onto the hob and add the lard or dripping. When the lard or dripping has melted, add the potatoes and fry in the roasting tray until the potatoes start to brown. Turn occasionally to ensure the potatoes brown on all sides.", "Sprinkle the potatoes with salt and place into the oven to roast for one hour, turning occasionally to ensure they cook evenly.", "For the bread sauce, place the clove-studded onion and milk into a heatproof bowl set over a pan of simmering water. Heat the milk until just below boiling point (the longer the milk takes to come to boiling point, the better the flavour of the sauce will be, so don't rush this process).", "Remove the onion and cloves from the milk, but keep the milk over the simmering water.", "Gradually add the breadcrumbs to the milk, whisking constantly, until the sauce becomes thick. ", "Season the sauce, to taste, with freshly grated nutmeg, salt, white pepper and cayenne pepper.", "Add the butter and cream and stir well until the butter has melted. Pour the sauce into a serving bowl and keep warm.", "For the cranberry and apple jelly, place the cranberries and apples into a saucepan with the water.", "Add the cloves and cinnamon and bring to the boil. Reduce the heat and simmer for 10-15 minutes, until the cranberries have split and the apple has become tender.", "Using a ladle, gradually strain the cranberry and apple mixture through a muslin-lined sieve into a large clean bowl. Don't press or force the berries as this will make the jelly cloudy.", "Add the sugar and vinegar to the liquid and mix well.", "Transfer the liquid to a clean pan and heat to just above boiling point - 104C on a sugar thermometer. Remove from the heat and leave the mixture to cool, then transfer to a sterilised jar.", "For the sprouts and pancetta, bring a saucepan of salted water to the boil and add the sprouts. Cook for 8-10 minutes, until tender, then drain into a colander.", "Heat a frying pan over a high heat until hot. Add the olive oil and pancetta cubes and fry for 5-7 minutes, until the pancetta is crisp and golden-brown. ", "Add the drained sprouts and stir together to warm through.", "To serve, carve the Yorkshire pot carefully to ensure that each slice contains a portion of each bird. Place a couple of slices onto each plate. Spoon the roast potatoes alongside, then add a spoonful of the sprouts and pancetta. Serve the white sauce and cranberry and apple jelly alongside."]}, "Yoghurt-spiced chicken skewers": {"ingredients": ["2 chicken breasts ", "280ml/10fl oz natural yoghurt", "1 tsp ground cumin", "1 tsp ground coriander", "½ tsp salt", "½ tsp turmeric", "1 tsp fenugreek seeds", "1 tsp ground ginger", "1 tsp onion powder", "½ tsp ground cloves", "¼ tsp chilli powder", "4 punnets cherry tomatoes, cut in half", "220ml/8fl oz white wine vinegar", "4 tbsp caster sugar", "½ tsp dried chilli flakes"], "instructions": ["For the marinade, mix all the ingredients together.", "Slice each chicken breast into five strips, and add them to the marinade. Stir to combine, and leave to marinate for at least an hour (longer if possible).", "Remove from the fridge and thread the chicken strips onto wooden skewers.", "Heat a large griddle pan until hot, then add the chicken skewers.", "Cook for three minutes on each side until browned and cooked through.", "For the jam, place all the ingredients into a saucepan and bring to the boil.", "Reduce the heat and simmer for up to an hour until jam-like. Cool and serve with the chicken skewers."]}, "Yorkshire pudding (via Punjab!)": {"ingredients": ["100g/3½oz flour", "½ tsp salt", "¼ tsp ground coriander seeds", "1 egg (beaten)", "300ml/10fl oz milk", "cold water", "2 tbsp dripping", "You will need Yorkshire pudding tins for this recipe."], "instructions": ["Sieve the flour, salt and coriander powder into a bowl.", "Add the beaten eggs and half the milk. Beat well for 5 minutes or until the batter is smooth.", "Beat in remaining milk and enough cold water to give thick creamy consistency.", "Leave the batter to stand for 30 minutes.", "Heat dripping in Yorkshire pudding tins until very hot. The fat should be so hot that when the batter is poured in it sizzles.", "Sprinkle a few drops of cold water into the batter and pour into the hot fat (this creates steam helping the batter to rise). ", "Cook for 15-20 minutes in a preheated oven 220C/425F/Gas 7, until puffed and golden with a soft centre. ", "Remove from oven and serve immediately."]}, "Yellow Curry Pasta": {"ingredients": ["Boiled pasta 1 packet", "Rice flour 2 tbsp", "Turmeric 1 tsp", "Red chili 1 tsp", "Salt 1 tsp", "Garlic paste 2 tbsp", "Curry leaves 6", "Sour yogurt 250 grams", "Almond ,pistachios 2 tbsp", "Coconut powder 1 tbsp", "Boneless chicken Â½ kg", "Green chili 6", "Lemon as required", "Green coriander Â½ bunches", "Chaat masala as required", "Onion 1", "Oil Â½ cup"], "instructions": ["<strongMethod:</strong<br /Heat oil and sauté onion", "then add boneless chicken and garlic add and roast well .now in blender add sour yogurt ,4 green chilies ,salt ,red chilies ,turmeric ,almond ,pistachios, coconut and rice flour blend .after this in a pan heat oil and add blended mixture ,then chicken and curry leaves add then cook for half an hour and then stove off and dish out .then pasta mix and then add green coriander ,green chilies and lemon .finally add chat masala and serve ."]}, "Yogurt Salad": {"ingredients": ["Cream cheese Â½ cup", "Yogurt 1 cup", "Mustard paste Â½ tsp", "Black pepper Â½ tsp", "Salt Â½ tsp", "Crushed red pepper Â½ tsp", "Boiled potatoes 2", "Cucumber 2", "Cabbage 1 cup", "Tomatoes 2", "Corn seeds 1 cup", "Sugar 1tsp", "Coriander Â½ bunch"], "instructions": ["<strongMethod</strong :<br /Beat cream cheese, yogurt, mustard paste, black pepper, salt, sugar and crushed red pepper together, now add and mix veggies in this mixture &amp; serve."]}, "Yakhni Pulao": {"ingredients": ["ChickenÂ Â  Â Â Â  Â Â Â  Â Â Â  Â 1 Kg", "Onions (finely chopped)Â Â  Â Â Â  Â 3", "Green ChiliesÂ Â  Â Â Â  Â Â Â  Â 3", "Green CardamomsÂ Â  Â Â Â  Â 5-6", "OilÂ Â  Â Â Â  Â Â Â  Â Â Â  Â 1 cup", "YogurtÂ Â  Â Â Â  Â Â Â  Â Â Â  Â Â½ cup", "RiceÂ Â  Â Â Â  Â Â Â  Â Â Â  Â 2 Â½ cup", "Carawy SeedsÂ Â  Â Â Â  Â Â Â  Â 1 tsp", "Ginger Garlic PasteÂ Â  Â Â Â  Â 1 tbsp", "SaltÂ Â  Â Â Â  Â Â Â  Â Â Â  Â to taste", "For Stock:", "OnionsÂ Â  Â Â Â  Â Â Â  Â Â Â  Â 2", "GarlicÂ Â  Â Â Â  Â Â Â  Â Â Â  Â 1 clove", "GingerÂ Â  Â Â Â  Â Â Â  Â Â Â  Â 1 piece", "All Spice (whole)Â Â  Â Â Â  Â a pinch", "Cumin SeedsÂ Â  Â Â Â  Â Â Â  Â 1 tsp", "Fennel SeedsÂ Â  Â Â Â  Â Â Â  Â 1 tbsp", "Coriander Â Â  Â Â Â  Â Â Â  Â 2 tbsp", "SaltÂ Â  Â Â Â  Â Â Â  Â Â Â  Â to taste"], "instructions": ["Add 1 kg chicken, 3 glass water, salt, 2 onions, 1 clove and 1 piece ginger in a wok."]}, "Yogurt-Marinated Chicken With Borani": {"ingredients": ["1 3½–4-lb. whole chicken, backbone removed", "Kosher salt", "½ cup vegetable oil or extra-virgin olive oil", "1 Tbsp. paprika", "1 Tbsp. coriander seeds, crushed", "2 tsp. cumin seeds, crushed", "½ cup plain whole-milk Greek yogurt", "4 garlic cloves, finely grated", "1 1\" piece ginger, peeled, finely grated", "1 tsp. crushed red pepper flakes", "1 medium Persian cucumber, scrubbed, finely grated", "1 cup plain whole-milk Greek yogurt", "1 Tbsp. chopped raisins", "1 Tbsp. fresh lemon juice", "Kosher salt", "Lemon wedges (for serving)"], "instructions": ["Place chicken, breast side up, on a work surface and spread open as much as possible; pat dry with paper towels. Using your palms, press firmly on breastbone to flatten. (You may hear a crack and this means you’re doing it right.) Season chicken all over with salt and set aside.", "Pour oil into a small skillet; stir in paprika, coriander, and cumin. Set over medium heat and cook, stirring occasionally, until tiny bubbles form and oil around spices starts to sizzle and is very fragrant, about 2 minutes. (This step extracts oils from the spices, bringing out their flavors.) Immediately pour half of spiced oil into a large bowl; set remaining spiced oil aside for borani. Let oil in bowl cool 5 minutes, then add yogurt, garlic, ginger, and red pepper flakes and whisk until smooth.", "Place chicken in bowl and work yogurt mixture all over, getting into every nook and cranny. Cover and chill up to 24 hours, or if you’re pressed for time, proceed directly to the next step.", "If chilling chicken, let sit out on the counter at room temperature 1 hour before roasting.", "Preheat oven to 425°. Place chicken, breast side up, on a foil-lined rimmed baking sheet and roast, rotating baking sheet halfway through, until chicken is cooked through and deeply golden brown, 40–50 minutes. Let rest 15 minutes before carving.", "While the chicken is resting, toss cucumber, yogurt, raisins, and lemon juice in a medium bowl to combine; season with salt. Pour reserved spiced oil over borani.", "Serve chicken with borani and lemon wedges for squeezing over."]}, "Yum Phonlamai": {"ingredients": ["1 Tbsp. small dried shrimp (optional)", "¼ cup unsweetened shredded coconut", "4 garlic cloves", "2 red Thai chiles, coarsely chopped", "4 Tbsp. fresh lime juice", "4 tsp. granulated sugar", "4 tsp. fish sauce", "2 apples, preferably Pink Lady, cored, cut into 1\" pieces", "2 Asian pears, cored, cut into 2\" pieces", "1 small shallot, thinly sliced into rings", "1 cup red grapes, halved crosswise", "¼ cup coarsely chopped cilantro", "¼ cup mint leaves, torn if large"], "instructions": ["If using, toast dried shrimp in a dry small skillet, tossing occasionally, over medium heat until slightly lighter in appearance and a little crispy, about 4 minutes. Transfer to a cutting board; reserve skillet. Coarsely chop and lightly smash to tenderize; set aside.", "Add coconut to reserved skillet and toast over medium heat until light golden and fragrant, about 2 minutes. Transfer to a small bowl; set aside.", "Smash garlic to a coarse paste with a mortar and pestle. Add chiles and lightly smash (the finer you pound the chiles, the spicier the dressing will be). Mix in lime juice, sugar, fish sauce, and 2 Tbsp. water. (Or, finely chop garlic and salt, then chiles, on a cutting board and smash with the side of a chef’s knife. Mix in a bowl with remaining ingredients.)", "Toss apples, pears, shallot, grapes, cilantro, mint, and reserved dried shrimp (if using) in a large bowl to combine. Add dressing and toss to coat. Top with reserved toasted coconut."]}, "Yum Nua (Thai Beef Salad)": {"ingredients": ["½ cup sweet white rice or regular short-grain or other white rice", "¼ cup fresh lime juice", "2 Tbsp. fish sauce", "1 tsp. crushed red pepper flakes", "½ tsp. sugar", "Kosher salt, freshly ground pepper", "1 lb. top sirloin steak, New York strip steak, or other nicely marbled cut of beef, sliced ¼\" thick", "1 Tbsp. fish sauce", "2 tsp. sugar", "2 Tbsp. vegetable oil, plus more for grate or skillet", "Kosher salt, freshly ground pepper", "1 lb. small and medium tomatoes, halved", "1 large shallot, thinly sliced", "2 scallions, thinly sliced", "2 lemongrass stalks, tops trimmed, tough outer layers removed, very thinly sliced", "2 long hot chiles, thinly sliced", "2 garlic cloves, thinly sliced", "2 cups cilantro leaves with tender stems", "2 cups mint leaves", "1 lb. cucumbers, thinly sliced, plus more for serving", "Lime wedges (for serving)", "A spice mill or mortar and pestle"], "instructions": ["Place rice in a medium skillet and set over medium heat. Cook, tossing often, until golden brown and deeply nutty–smelling, 12–15 minutes. Let cool, then finely grind in a spice mill or mortar and pestle; set aside.", "Meanwhile, stir lime juice, fish sauce, red pepper flakes, and sugar in a small bowl until sugar dissolves. Season with salt and black pepper.", "Do ahead: You can toast and grind the rice a few days in advance (as Suntaranon does).  If the smokiness and aroma have faded at all, just toss it in briefly hot skillet to refresh.", "Place beef in a large bowl and add fish sauce, sugar, and 2 Tbsp. oil. Let sit at room temperature 1 hour, or cover and chill up to 1 day ahead.", "Prepare a grill for medium-high heat or heat a large skillet over medium-high. Oil grate or lightly coat skillet with oil. Season beef with salt and black pepper and grill until browned underneath, about 2 minutes. Turn over and grill on other side just until lightly browned (meat should still be slightly pink in the center), about 45 seconds.", "Toss tomatoes, shallot, scallions, lemongrass, chiles, garlic, cilantro, mint, 1 lb. cucumbers, and 1 tsp. rice powder in a medium bowl to combine. Drizzle half of dressing over and toss to coat. Taste and season with salt and black pepper.", "Add beef to salad. Drizzle with more dressing as desired and top with more cucumber slices and 1 tsp. rice powder (save remaining rice powder in an airtight container at room temperature for another use). Serve with lime wedges for squeezing over."]}, "Yemenite Green Hot Sauce (Zhug)": {"ingredients": ["2 cardamom pods", "1 teaspoon black peppercorns", "1 teaspoon coriander seeds", "½ teaspoon cumin seeds", "4 serrano chiles, finely chopped", "2 garlic cloves, chopped", "Kosher salt", "1 cup very finely chopped parsley", "¾ cup very finely chopped cilantro", "⅔ cup extra-virgin olive oil", "4 teaspoons fresh lemon juice", "A spice mill or mortar and pestle"], "instructions": ["Remove cardamom seeds from pods; discard pods. Toast cardamom seeds, peppercorns, coriander seeds, and cumin seeds in a dry small skillet over medium-high heat, swirling often, until fragrant, about 2 minutes. Transfer to a spice mill or mortar and pestle and let cool; finely grind.", "Place chiles and garlic on a cutting board and sprinkle with a large pinch of salt and smash into a paste with the side of a chef’s knife. (Or use that mortar and pestle here too.)", "Transfer chile paste to a small bowl and work in spice mixture, parsley, cilantro, and oil; season with salt. Let sit 10 minutes for flavors to marry. Stir in lemon juice.", "Do Ahead: Sauce (without lemon juice) can be made 1 day ahead. Cover and chill. Let come to room temperature before stirring in lemon juice."]}, "Yogurt Granita with Melon and Raspberries": {"ingredients": ["1 quart plain whole-milk Greek yogurt", "2 cups whole milk", "½ cup honey", "Pinch of kosher salt", "4 very small cantaloupes (about 1½ pounds each)", "2 cups raspberries (about 1 pint)"], "instructions": ["Whisk yogurt, milk, honey, and salt in a large bowl to combine. Pour into a baking pan (metal works best). Freeze mixture until edges begin to set, about 30 minutes. Using a fork, scrape to break up frozen portions. Continue to freeze, scraping and breaking up frozen parts every 20–30 minutes, until mixture resembles fluffy shaved ice, 2–4 hours.", "Cut cantaloupes in half crosswise and scrape out seeds; discard. Scoop some granita into each cantaloupe half; top with raspberries.", "Do Ahead: Granita can be made 1 week ahead. Cover and keep frozen. Scrape to fluff just before serving."]}, "Yogurt with Raisins, Cucumber, and Walnuts": {"ingredients": ["½ cup walnuts", "1 Persian cucumber, finely chopped", "3 cups plain whole-milk Greek yogurt", "3 tablespoons chopped golden raisins", "1 tablespoon finely grated green garlic, or 1 garlic clove, finely grated", "1 teaspoon finely grated lemon zest", "1 teaspoon fresh lemon juice", "1 tablespoon crushed dried mint leaves, plus more for serving", "1 tablespoon olive oil, plus more for drizzling", "2 teaspoons crushed dried rose petals; plus more for serving (optional)", "Kosher salt, freshly ground pepper", "2–3 tablespoons whole milk (optional)", "Aleppo-style pepper (for serving)"], "instructions": ["Preheat oven to 350°. Toast walnuts on a rimmed baking sheet, tossing occasionally, until golden brown, 8–10 minutes. Let cool, then finely chop.", "Mix walnuts, cucumber, yogurt, raisins, green garlic, lemon zest, lemon juice, 1 Tbsp. mint, 1 Tbsp. oil, and 2 tsp. rose petals, if using, in a medium bowl to combine; season with salt and pepper. If yogurt looks thick, stir in milk as needed.", "Serve topped with Aleppo-style pepper and more dried mint and rose petals and drizzled with more oil.", "Do Ahead: Yogurt can be made 1 day ahead. Keep chilled."]}, "Yuzu Guacamole with Seaweed \"Doritos\"": {"ingredients": ["Vegetable oil (for frying; about 3 cups)", "⅓ cup cornstarch", "4 toasted nori sheets", "Kosher salt", "3 ripe avocados", "1 small green chile, such as serrano, half grated, half thinly sliced", "1 small shallot, finely chopped", "1 scallion, finely chopped", "1 garlic clove, finely grated", "2 tablespoons yuzu juice or 4 teaspoons fresh lemon juice and 2 teaspoons fresh orange juice", "2 tablespoons finely chopped cilantro, plus torn leaves for serving", "1 stalk canned hearts of palm, thinly sliced", "Shichimi togarashi or crushed red pepper flakes (for serving)", "A deep-fry thermometer", "Shichimi togarashi, a Japanese red-pepper seasoning mix, can be found at Japanese markets and in the Asian foods section of some supermarkets."], "instructions": ["Pour oil into a medium saucepan fitted with thermometer to come 2\" up sides of pan. Heat over medium-high until thermometer registers 375°.", "While oil is heating, whisk cornstarch and ½ cup water in a small bowl to make a slurry.", "Using a pair of kitchen shears, cut nori sheets into 4 squares, then cut each square diagonally to make 2 triangles. Lay a nori triangle on a flat surface. Brush slurry on both sides of seaweed and place another seaweed triangle on top; press down to seal. Brush top of seaweed with slurry. Repeat with remaining nori triangles and slurry.", "Working in batches, fry nori until crisp and bubbling around chips subsides, about 2 minutes. Transfer to paper towels and let drain; season with salt.", "Mash avocado in a medium bowl. Mix in grated chile, shallot, scallion, garlic, yuzu juice, and chopped cilantro; season with salt. Top with hearts of palm, sliced green chile, torn cilantro leaves, and shichimi togarashi. Insert a few nori chips into guacamole and serve with remaining chips on the side."]}, "Yellowtail with Glass Noodles and Pear": {"ingredients": ["4 ounces thin bean thread noodles", "¼ cup dried arame (seaweed)", "3 tablespoons unseasoned rice vinegar", "3 tablespoons white soy sauce", "2 tablespoons mirin", "2 teaspoons fresh lemon juice", "1½ teaspoons finely grated green chile (such as serrano)", "1 teaspoon toasted sesame oil", "1 firm green pear, cut into matchsticks", "½ small sweet onion, cut lengthwise into quarters, thinly sliced crosswise", "12 ounces yellowtail, cut into ½-inch pieces", "½ cup torn mint leaves", "2 tablespoons finely chopped chives", "2 teaspoons toasted white and/or black sesame seeds, plus more for serving", "Kosher salt", "Gochugaru (coarse Korean hot pepper powder) or crushed red pepper flakes (for serving)"], "instructions": ["Place noodles in a large bowl and pour boiling water over to cover. Let noodles soak until tender but not mushy, 10–15 minutes; drain. Rinse under cold water; snip into 2\" lengths with kitchen shears and return to bowl.", "Meanwhile, soak arame in ½ cup cold water in a small bowl until softened, 8–10 minutes. Drain; set aside.", "Whisk vinegar, soy sauce, mirin, lemon juice, chile, and oil in a large bowl. Transfer ⅓ cup lemon-chile shoyu to bowl with noodles and toss to coat. Add pear, sweet onion, yellowtail, mint, chives, reserved arame, and 2 tsp. sesame seeds to remaining shoyu in large bowl and gently toss; season with salt.", "Divide noodles among bowls and top with yellowtail mixture; sprinkle with gochugaru and more sesame seeds.", "Do Ahead: Shoyu can be made 1 day ahead. Cover and chill."]}, "Yellow Split Pea Soup": {"ingredients": ["2 tablespoons coconut, olive, or vegetable oil", "1 medium red onion, chopped", "4 large carrots, scrubbed, chopped", "Kosher salt", "1 teaspoon fennel seeds", "2 teaspoons Madras curry powder", "1 teaspoon mustard seeds", "12 ounces yellow split peas", "6 cups chicken stock, low-sodium chicken broth, or water", "½ teaspoon coriander seeds", "½ teaspoon fennel seeds", "½ teaspoon mustard seeds", "2 teaspoons coconut, olive, or vegetable oil", "¼ cup unsweetened coconut flakes", "Kosher salt", "Cilantro leaves (for serving)"], "instructions": ["Heat a large heavy pot over medium and pour in oil. Add onion and carrots, season with a five-finger pinch of salt, and cook, stirring often, until vegetables are very tender and just taking on a hint of color at the edges, about 5 minutes. Lightly crush fennel seeds with a mortar and pestle, or roughly chop them. Add fennel seeds, curry, and mustard seeds to pot and cook, stirring, until fragrant (the mustard seeds may begin to pop), less than a minute. Add split peas, stir to coat, then add stock and 4 cups water. Increase heat and bring to a boil, then simmer, stirring occasionally and adding more water if soup looks too thick, until split peas are very tender and some are starting to disintegrate, 50–55 minutes.", "Mash soup with a potato masher until split peas are in small pieces and soup is textured but creamy (if you prefer a smoother soup, use an immersion blender directly in the pot). Taste and adjust seasoning with more salt.", "While the soup is simmering, lightly crush coriander, fennel, and mustard seeds.", "Heat oil in a small skillet over medium and cook coconut flakes and spices, stirring constantly, until spices are sizzling and coconut is golden brown, about 1 minute. Transfer to a plate, season with salt, and let cool (coconut will crisp as it cools).", "Serve soup topped with spiced coconut and cilantro."]}, "Yeasted Apple Coffee Cake": {"ingredients": ["6 tablespoons unsalted butter, melted, slightly cooled, plus more", "1 ¼-ounce envelope active dry yeast (about 2¼ teaspoons)", "⅔ cup (packed) light brown sugar, divided", "1 large egg, room temperature", "3 cups all-purpose flour, divided", "½ cup sour cream, room temperature", "2 teaspoons finely grated orange zest", "⅓ cup fresh orange juice", "2 teaspoons baking powder", "1 teaspoon kosher salt", "½ cup all-purpose flour", "½ cup old-fashioned oats", "⅓ cup (packed) light brown sugar", "2 tablespoons granulated sugar", "1 teaspoon ground cinnamon", "Kosher salt", "6 tablespoons unsalted butter, melted, slightly cooled", "2 pounds firm baking apples (about 4 large), halved, cored, very thinly sliced", "1½ cups powdered sugar", "2 tablespoons (or more) fresh orange juice"], "instructions": ["Butter a 13x9\" shallow baking dish. Mix yeast, 2 Tbsp. brown sugar, and ¼ cup warm water in the bowl of a stand mixer; let sit until it foams, about 5 minutes. Whisk in egg and remaining brown sugar, then stir in 1 cup flour and mix with a wooden spoon to incorporate. Sprinkle remaining 2 cups flour over top but do not mix in. Cover with plastic wrap and let sit in a warm, draft-free spot until mixture is visibly puffed and flour has cracks in places, 60–90 minutes.", "Add sour cream, orange zest, orange juice, baking powder, and salt to mixture and mix on medium speed with dough hook until smooth, elastic, and just sticking to the sides of bowl, about 4 minutes. Add 6 Tbsp. butter in 2 additions, beating well between additions; beat until a soft, slightly glossy, sticky dough-batter hybrid forms, about 4 minutes.", "Using buttered fingers, pat dough into prepared pan in an even layer, spreading to edges. Cover and let sit in a warm, draft-free spot until puffed and nearly doubled in size, 60–70 minutes.", "Just before dough is finished rising, preheat oven to 350°. Pulse flour, oats, brown sugar, granulated sugar, cinnamon, and a pinch of salt in a food processor a few times to combine. Add butter and process in long pulses until streusel is the consistency of moist crumbs.", "Working with several slices at a time, fan out apples slightly and arrange over dough, shingling rows in different directions; sprinkle streusel over top. Bake until apples are tender and a tester inserted into the center comes out clean, 35–45 minutes. Transfer to a wire rack and let cool.", "Whisk powdered sugar, orange juice, and a pinch of salt in a medium bowl, adding more orange juice by the teaspoonful as needed, until icing is very thick and smooth and falls back onto itself in a slowly dissolving ribbon. Drizzle over coffee cake."]}, "Yellow Pepper and Corn Salad with Turmeric Dressing": {"ingredients": ["1 jalapeño, seeds removed, chopped", "1 4-inch piece turmeric, peeled, chopped, or ¾ teaspoon ground turmeric", "1 1-inch piece ginger, peeled, chopped", "1 garlic clove, crushed", "1 cup coarsely chopped cilantro", "¼ cup olive oil", "½ teaspoon finely grated lime zest", "3 tablespoons fresh lime juice", "Kosher salt", "3 ears of corn, husked", "2 yellow bell peppers", "4 ounces Sun Gold or cherry tomatoes", "2 endive, leaves separated, halved if large, or 1 large head of frisée, torn into bite-size pieces", "2 cups dandelion greens or arugula", "Kosher salt"], "instructions": ["Pulse jalapeño, turmeric, ginger, garlic, cilantro, oil, lime zest, and lime juice in a food processor until smooth with a few flecks of cilantro. Transfer to a small bowl; season with salt.", "Prepare a grill for high heat. Grill corn, turning occasionally, until charred and cooked through, 6–8 minutes. Let cool; cut kernels off cobs and place in a large bowl. (Or, cut kernels from cobs and char in a dry cast-iron skillet over medium-high, 8–10 minutes.)", "Heat broiler. Broil peppers on a rimmed baking sheet, turning occasionally, until blackened in spots and nearly cooked through, 12–18 minutes. Let cool; cut into 1\" strips, retaining as much charred skin as possible; add to corn.", "Broil tomatoes on same baking sheet, tossing once, until blackened in spots and starting to burst, about 5 minutes. Let cool. Add tomatoes, endive, and greens to corn; toss to combine. Drizzle dressing over and toss to coat; season with salt."]}, "Yellow Cupcakes": {"ingredients": ["3⅓ cups cake flour", "2 cups sugar", "1 tablespoon baking powder", "1 teaspoon kosher salt", "½ teaspoon baking soda", "1 cup (2 sticks) unsalted butter, room temperature", "1 cup buttermilk, room temperature", "2 tablespoons vegetable oil", "7 large egg yolks", "1 large egg", "1 tablespoon vanilla extract"], "instructions": ["Arrange racks in lower and upper thirds of oven; preheat to 400°. Line two standard 12-cup muffin tins with cupcake liners.", "Whisk flour, sugar, baking powder, salt, and baking soda in the bowl of a stand mixer fitted with the whisk attachment. Add butter, buttermilk, and oil and beat on medium speed, scraping down sides of bowl, until smooth.", "Whisk egg yolks, egg, and vanilla in a medium bowl until smooth. Add egg mixture to flour mixture in 2 additions, beating well between additions. Continue to beat on medium speed until mixture is homogenous and very thick, about 2 minutes.", "Divide batter evenly among muffin cups, filling two-thirds full (a level ⅓ cup batter per cupcake). Bake 5 minutes, then reduce oven temperature to 350°. Continue baking, rotating pans halfway through, until cupcakes have domed and spring back when touched in the center, 20–25 minutes. Transfer to a wire rack and let cool.", "Do Ahead: Cupcakes can be made 1 day ahead. Store airtight at room temperature."]}, "Yellowtail Crudo with Citrus and Avocado": {"ingredients": ["1 avocado", "1 garlic clove, chopped", "1 tablespoon crème fraîche or sour cream", "2 serrano chiles, seeded, finely chopped, divided", "2 tablespoons fresh lime juice, divided", "Kosher salt", "4 ounces sashimi-grade skinless, boneless yellowtail fillet", "2 teaspoons olive oil", "1 teaspoon fish sauce", "1 teaspoon finely chopped shallot", "½ teaspoon finely grated peeled ginger", "½ teaspoon yuzu kosho", "1 radish, trimmed, thinly sliced", "Cilantro leaves with tender stems and thin fancy crackers or crispbread (for serving)", "Yuzu kosho can be found at Japanese markets and some specialty foods stores."], "instructions": ["Mash avocado with garlic, crème fraîche, half of serranos, and 1 Tbsp. lime juice in a small bowl until mixture is mostly smooth; season with salt.", "Hold your knife at a 45° angle and slice fish with the grain into ½\" slices (use a sharp blade and aim for one long, clean stroke). Cut each slice crosswise into ½\" pieces.", "Combine oil, fish sauce, shallot, ginger, yuzu kosho, remaining serrano, and remaining 1 Tbsp. lime juice in a medium bowl. Add yellowtail, season with salt, and gently toss crudo to combine.", "Spread avocado mixture on plates. Top with yellowtail, radish, and cilantro. Serve with crackers."]}, "Yogurt-Marinated Grilled Chicken": {"ingredients": ["8 skinless, boneless chicken breasts (about 3 pounds)", "2 cups plain whole-milk yogurt", "1 cup coarsely chopped fresh cilantro leaves and stems", "1/2 large onion, coarsely chopped", "1/3 cup olive oil plus more for brushing", "6 garlic cloves, coarsely chopped", "1 tablespoon fresh lime juice", "1 tablespoon garam masala", "2 teaspoons kosher salt plus more for seasoning", "1 teaspoon freshly ground black pepper", "1 2'piece fresh ginger, peeled and chopped"], "instructions": ["Working with one chicken breast at a time, put chicken between 2 sheets of waxed paper and pound to 1/2\" thickness. Transfer chicken breasts to a resealable plastic bag.", "Combine the remaining ingredients in a food processor and blend until smooth. Pour yogurt mixture over chicken, seal bag, and turn to coat. Marinate chicken in the refrigerator for at least 3 hours or overnight.", "Build a medium fire in a charcoal grill, or heat a gas grill to medium-high. Brush grill grates with oil. Scrape excess marinade off chicken; season with salt. Grill chicken, turning once, until browned and cooked through, 3-4 minutes per side."]}, "Young Lettuces with Herbed Avocado": {"ingredients": ["1 small shallot, finely chopped", "1 tablespoon Champagne vinegar or white wine vinegar", "1 tablespoon (or more) fresh lemon juice", "Kosher salt", "2 large avocados, pitted", "½ preserved lemon, seeds removed, finely chopped", "¾ cup plain whole-milk Greek yogurt", "2 tablespoons olive oil", "¼ cup finely chopped tender herbs (such as cilantro, parsley, tarragon and/or mint)", "2 tablespoons fresh lemon juice", "2 teaspoons light agave syrup (nectar)", "Kosher salt", "2 tablespoons grapeseed or vegetable oil", "1 tablespoon olive oil", "3 heads of baby romaine, red leaf, or Little Gem lettuces, leaves separated", "2 cups spicy greens (such as mizuna, watercress, buckwheat sprouts, or purslane)", "1 cup tender herbs (such as mint leaves, cilantro leaves, and/or fennel fronds)", "½ cup edible flowers (such as nasturtiums, bachelor’s buttons, and/or pansies)", "Flaky sea salt", "½ cup finely chopped unsalted, roasted pistachios"], "instructions": ["Combine shallot, vinegar, and lemon juice in a small bowl. Season with salt and let sit 20 minutes to lightly pickle.", "Using a spoon, scoop avocado flesh into a food processor; discard skins. Purée until smooth. Add preserved lemon, yogurt, oil, and shallot along with pickling liquid; season with salt and pulse to combine.", "Transfer avocado mixture to a medium bowl and stir in herbs. Taste and adjust seasoning with salt and/or more lemon juice, if needed.", "Do Ahead: Herbed avocado can be made 1 day ahead. Cover, pressing plastic wrap directly onto surface, and chill.", "Whisk lemon juice and agave in a medium bowl; season with salt. Whisk in grapeseed oil, then olive oil. Taste vinaigrette and adjust seasoning with more salt if needed.", "Do Ahead: Vinaigrette can be made 5 days ahead. Cover and chill.", "Toss lettuces, spicy greens, herbs, and edible flowers in a large bowl to combine. Drizzle about half of lemon vinaigrette over and toss to coat. Season salad with salt.", "Spoon 2 dollops of herbed avocado onto each plate and loosely mound salad over top. Scatter pistachios over and around salad and drizzle with remaining lemon vinaigrette."]}, "Yellow Salad with Citrus-Date Vinaigrette": {"ingredients": ["2 Medjool dates, pitted", "¼ cup olive oil", "2 tablespoons fresh lemon juice", "2 tablespoons fresh orange juice", "1 tablespoon whole grain Dijon mustard", "½ teaspoon ground cumin", "Kosher salt and freshly ground black pepper", "Mixed yellow and orange raw fruits and vegetables (such as corn, Sun Gold tomatoes, golden beets, apricots, clementines, and pineapple), halved, sliced, and/or cut into wedges"], "instructions": ["Process dates, oil, lemon juice, orange juice, mustard, and cumin in a food processor until smooth. Thin vinaigrette with water to a pourable consistency; season with salt and pepper.", "To serve, spoon some vinaigrette into a shallow bowl and arrange fruits and vegetables of choice on top. Season with salt and pepper.", "Do Ahead: Vinaigrette can be made 2 days ahead. Cover and chill."]}, "Yellow Sheet Cake with Chocolate Sour Cream Frosting": {"ingredients": ["Nonstick vegetable oil spray", "3 cups all-purpose flour", "1½ teaspoons baking powder", "1 teaspoon baking soda", "1 teaspoon kosher salt", "1 cup buttermilk", "⅓ cup vegetable oil", "1 teaspoon vanilla extract", "1½ cups granulated sugar", "⅓ cup (packed) light brown sugar", "¾ cup (1½ sticks) unsalted butter, room temperature", "½ vanilla bean, split lengthwise", "4 large egg yolks", "2 large eggs", "14 ounces semisweet chocolate, chopped", "¼ cup light corn syrup", "2 cups sour cream", "1½ teaspoons kosher salt", "1½ teaspoons vanilla extract", "2¾ cups powdered sugar", "¾ cup (1½ sticks) unsalted butter, room temperature"], "instructions": ["Preheat oven to 350°. Lightly coat a 18x13\" rimmed baking sheet with nonstick spray. Line with parchment paper; coat parchment with nonstick spray. Whisk flour, baking powder, baking soda, and salt in a large bowl until no lumps remain. Combine buttermilk, oil, and vanilla in a medium bowl.", "Combine granulated sugar, brown sugar, and butter in another large bowl. Scrape in seeds from vanilla bean; save pod for another use. Using an electric mixer on medium speed, beat until light and fluffy, about 4 minutes. Add egg yolks and eggs one at a time, beating to blend after each addition. Continue to beat mixture, occasionally scraping down sides and bottom of bowl, until almost doubled in volume and very light, airy, and pale yellow, about 5 minutes. It’s very important that there are no lumps at this stage. The occasional scraping of the bowl, especially the bottom, will help prevent lumps.", "Reduce speed to low, add dry ingredients in 3 additions, alternating with buttermilk mixture in 2 additions, beginning and ending with dry ingredients. Scrape batter into prepared baking sheet and smooth top.", "Bake cake, rotating sheet halfway through, until light golden brown, the center springs back when gently pressed, and a tester inserted into the center comes out with a few moist crumbs attached, 20–25 minutes. Transfer baking sheet to a wire rack and let cake cool.", "Using a long serrated knife, remove any uneven edges or bumps from cake to create a flat surface.", "Do Ahead: Cake can be baked 1 day ahead. Store tightly wrapped at room temperature, or freeze up to 1 month.", "Heat chocolate and corn syrup in a heatproof bowl set over a saucepan of simmering water (water should not touch bottom of bowl), stirring constantly, until chocolate is melted and mixture is smooth; remove from heat.", "Place sour cream, salt, and vanilla in another heatproof bowl and set over same saucepan of simmering water. Stir until mixture is warm but not hot, about 2 minutes. Add sour cream mixture to chocolate mixture and stir until smooth and glossy.", "Using an electric mixer on medium speed, beat powdered sugar and butter in a large bowl until light and fluffy, about 3 minutes. Scrape down sides of bowl, then slowly beat in chocolate mixture. Continue beating until no lumps remain, about 2 minutes. Frosting should be smooth and shiny. Cover and chill until slightly firmed up, about 30 minutes. Spread frosting over top of cake.", "Do Ahead: Cake can be assembled 1 day ahead; chill. Bring to room temperature before serving."]}, "Your New Avocado Toast": {"ingredients": ["Cucumber", "Fresh lime juice", "Crushed red pepper flakes", "Salt and pepper", "Sourdough bread", "Tahini", "Avocado", "Olive oil"], "instructions": ["Season thinly sliced cucumber with fresh lime juice, crushed red pepper flakes, salt, and pepper. Spread toasted sourdough bread with tahini and top with smashed avocado; season with salt and pepper. Top with cucumber and a drizzle of olive oil."]}, "Yeasted Blinis": {"ingredients": ["1 ¼-oz. envelope active dry yeast", "½ cup plus 2⅓ cups all-purpose flour", "2 teaspoons plus 3 Tbsp. sugar", "2 large eggs, separated", "2½ cups half-and-half, room temperature", "¼ cup (½ stick) unsalted butter, melted, plus more, chilled, for skillet", "2 teaspoons kosher salt"], "instructions": ["Mix yeast, ½ cup flour, 2 tsp. sugar, and 1 cup water in a large bowl. Cover and let sit in a warm place until entire surface is foamy and puffed in places, about 30 minutes. If this doesn’t happen, your yeast is past its prime; start again with a fresh package.", "Add egg yolks, half-and-half, melted butter, salt, remaining 2⅓ cups flour, and remaining 3 Tbsp. sugar to mixture and whisk until smooth. Cover batter and let sit in a warm place until almost tripled in volume, 3–4 hours. (Or, to make ahead, cover and chill 8–12 hours. Bring to room temperature before proceeding.)", "Whisk egg whites in a medium bowl to soft peaks; fold into batter. Melt about ½ Tbsp. butter in a large nonstick skillet over medium heat. Scoop in heaping tablespoonfuls of batter to make 2” blinis. Cook until bubbles form on top and bottoms are golden brown, about 3 minutes. Flip and cook until other sides are golden brown, about 3 minutes. Transfer blinis to wire racks. Repeat with remaining batter, wiping out skillet and adding more butter as needed."]}, "Yogurt-Lime Sorbet": {"ingredients": ["2 cups plain whole-milk yogurt", "1½ cups simple syrup (click for recipe)", "1 teaspoon finely grated lime zest", "3 tablespoons fresh lime juice", "½ vanilla bean"], "instructions": ["Whisk yogurt, simple syrup, lime zest, lime juice, and ½ cup water in a medium bowl; scrape in seeds from vanilla bean. Process in an ice cream maker according to manufacturer’s instructions. Transfer to an airtight container; cover and freeze until firm, at least 2 hours.", "DO AHEAD: Sorbet can be made 2 weeks ahead. Keep frozen."]}, "Yogurt-Chia Pudding": {"ingredients": ["2 cups plain whole-milk yogurt", "1½ tablespoon chia seeds", "1 tablespoon agave syrup, plus more", "Cocoa nibs, sunflower seeds, and/or toasted coconut (for serving)"], "instructions": ["Mix yogurt, chia seeds, and agave syrup in a large bowl; cover and chill at least 12 hours. Serve, drizzled with more agave, if desired, and topped with cocoa nibs, sunflower seeds, and/or toasted coconut.", "DO AHEAD: Pudding can be made 2 days ahead. Keep chilled."]}, "Yogurt with Fresh Figs, Honey, and Pine Nuts": {"ingredients": ["3 tablespoons pine nuts", "¼ cup honey", "½ teaspoon rose water or orange-flower water", "3 cups plain Greek yogurt", "16 fresh figs, halved"], "instructions": ["Toast pine nuts in a dry small skillet over medium-low heat, tossing often, until golden brown, about 4 minutes. Immediately transfer to a plate.", "Heat honey and rose water in a small saucepan over medium heat, stirring occasionally, until very runny, about 1 minute (do not let boil); let cool.", "Serve yogurt and figs drizzled with warm honey mixture and topped with pine nuts."]}, "Yeasted Brown-Butter Waffles": {"ingredients": ["¾ cup (1½ sticks) unsalted butter plus more for serving", "2 cups warm whole milk", "½ cup buttermilk", "2 tablespoons sugar", "1 ¼-oz. envelope active dry yeast (about 2¼ tsp.)", "1¼ teaspoons kosher salt", "2 cups all-purpose flour", "2 large eggs", "¼ teaspoon baking soda", "Nonstick vegetable oil spray", "Pure maple syrup (for serving)"], "instructions": ["Melt ¾ cup butter in a medium saucepan over medium heat and cook, stirring often, until butter foams, then browns (do not burn), 5–8 minutes. Pour into a medium bowl; let cool.", "Whisk milk, buttermilk, sugar, yeast, and salt in a large bowl. Whisk in flour and brown butter; cover with plastic wrap and let batter sit at room temperature at least 8 hours and up to 12 hours.", "Heat waffle iron until very hot. Whisk eggs and baking soda into batter. Coat waffle iron with nonstick spray and pour batter onto waffle iron, spreading it to cover surface (amount of batter needed will vary according to machine). Cook waffles until golden brown and cooked through.", "Serve immediately with maple syrup and more butter."]}, "Yogurt Pie with Grape and Black-Pepper Compote": {"ingredients": ["10 oz. gingersnaps, preferably thin", "2 tablespoons all-purpose flour", "2 tablespoons raw sugar or granulated sugar", "½ teaspoon kosher salt", "6 tablespoons (¾ stick) unsalted butter, melted, slightly cooled", "2 teaspoons unflavored powdered gelatin", "2 tablespoons plus ½ cup whole milk", "2¾ cups plain whole-milk Greek yogurt", "½ cup (packed) light brown sugar", "1 teaspoon finely grated lemon zest", "3 cups seedless black grapes", "⅓ cup granulated sugar", "¼ cup fresh lemon juice", "1 teaspoon freshly ground black pepper", "Pinch of kosher salt"], "instructions": ["Place a rack in middle of oven and preheat to 325°. Pulse gingersnaps in a food processor until very fine crumbs form (you should have about 2 cups). Add flour, raw sugar, and salt and pulse to combine. Add butter and pulse until mixture is the consistency of wet sand.", "Transfer mixture to a 9” pie dish. Using a measuring cup, press firmly onto bottom and up sides of pie dish. Place pie dish on a rimmed baking sheet and bake crust, rotating halfway through, until dry and set, 20–25 minutes. Transfer pie dish to a wire rack and let crust cool.", "DO AHEAD: Crust can be baked 1 day ahead. Store wrapped tightly at room temperature.", "Place gelatin and 2 Tbsp. milk in a small bowl and let stand until gelatin is softened, 5–10 minutes.", "Warm remaining ½ cup milk in a small saucepan over medium heat until steaming, about 3 minutes. Remove from heat, add gelatin mixture, and whisk until smooth. Whisk in yogurt, brown sugar, and lemon zest and pour into pie crust, smoothing top if needed; chill until set, at least 2 hours.", "Meanwhile, bring grapes, granulated sugar, lemon juice, pepper, and salt to a boil in a large skillet over medium-high heat, stirring to dissolve sugar. Reduce heat and simmer, stirring occasionally, until grapes burst and mixture is syrupy, 8–10 minutes. Let cool.", "Using a slotted spoon, spoon compote over pie slices just before serving.", "DO AHEAD: Pie and compote can be made 2 days ahead; cover separately and chill."]}, "Yellow Layer Cake with Chocolate–Sour Cream Frosting": {"ingredients": ["Nonstick vegetable oil spray", "4 cups cake flour", "2 teaspoon baking powder", "1½ teaspoon baking soda", "1½ teaspoon kosher salt", "1½ cups buttermilk", "½ cup vegetable oil", "2 teaspoon vanilla extract", "2 cups sugar", "1 cup (2 sticks) unsalted butter, room temperature", "½ cup (packed) light brown sugar", "1 vanilla bean, split lengthwise", "6 large egg yolks", "3 large eggs", "14 oz. semisweet or bittersweet chocolate, chopped", "¼ cup light corn syrup", "2 cups sour cream", "1½ teaspoon kosher salt", "1½ teaspoon vanilla extract", "2¾ cups powdered sugar", "¾ cup (1½ sticks) unsalted butter, room temperature"], "instructions": ["Three 9”-diameter cake pans with 2” sides", "Arrange racks in upper and lower thirds of oven; preheat to 350°. Coat cake pans with nonstick spray. Line bottom of pans with parchment-paper rounds; coat paper. Whisk flour, baking powder, baking soda, and salt in a large bowl until no lumps remain. Combine buttermilk, oil, and vanilla in a medium bowl.", "Combine sugar, butter, and brown sugar in another large bowl. Scrape in seeds from vanilla bean. Using an electric mixer, beat butter mixture until light and fluffy, 3–4 minutes. Add yolks and eggs one at a time, beating to blend between additions and occasionally scraping down sides and bottom of bowl.", "Continue to beat mixture, occasionally scraping down sides and bottom of bowl, until almost doubled in volume and very light, airy, and pale yellow, 5–6 minutes. It’s very important that no lumps remain at this stage. (Occasional scraping of the bowl, especially the bottom, helps prevent lumps.)", "With mixer on low, add dry ingredients in 3 additions, alternating with buttermilk mixture in 2 additions, beginning and ending with dry ingredients.", "Divide batter evenly among prepared pans, about 3½ cups per pan. Smooth tops.", "Bake, rotating cakes from left to right and top to bottom halfway through, until cakes are light golden brown, the centers spring back when gently pressed, and a tester inserted into the centers comes out with a few moist crumbs attached, 35–40 minutes.", "Transfer cakes to wire racks; let cool in pans for at least 30 minutes. Invert cakes onto racks, peel off parchment, and let cool completely.", "Using a long serrated knife, remove top dome and any bumps from each cake to create a flat surface. Slice each cake in half horizontally to make 6 layers total. Cakes can be baked 1 day ahead. Wrap tightly in plastic wrap and store at room temperature.", "Stir chocolate and corn syrup in a large metal bowl set over a large saucepan of simmering water until melted and smooth; remove from heat. Stir sour cream, salt, and vanilla in a medium metal bowl; set over same saucepan of simmering water. Stir until mixture is warm but not hot, about 2 minutes. Add sour cream mixture to chocolate mixture; stir until smooth and glossy. Set aside.", "Using an electric mixer, beat powdered sugar and butter in a medium bowl until light and fluffy, 2–3 minutes. Scrape down sides of bowl. Slowly beat in chocolate mixture. Continue beating until no lumps remain, about 2 minutes. Frosting should be smooth and shiny. Cover and chill until slightly firmed up, about 30 minutes.", "Place 1 cake layer on a cake stand or large plate. Spoon ⅔ cup frosting over; using an offset spatula or the back of a spoon, smooth frosting to edge of cake, creating an even layer. Place another cake layer on top. Repeat with frosting and remaining cake layers. Spread remaining frosting over top and sides of cake. DO AHEAD: Cake can be made 1 day ahead. Cover with a cake dome and store at room temperature."]}, "Yogurt and Sumac Sauce": {"ingredients": ["1 small garlic clove, finely chopped", "1 cup plain Greek yogurt", "2 tablespoons extra-virgin olive oil plus more for serving", "1/2 teaspoon sumac plus more for serving", "Kosher salt", "Coal-Roasted Eggplants (click for recipe)"], "instructions": ["Whisk garlic, yogurt, 2 tablespoons oil, and 1/2 teaspoons sumac in a medium bowl; season with salt.", "Spoon sauce onto a platter. Place eggplants on top. Season with salt, drizzle with oil, and sprinkle with sumac.", "DO AHEAD: Yogurt and Sumac Sauce can be made 1 day ahead. Cover and chill."]}, "Your Very Own Vinegar": {"ingredients": ["Piece of mother (wine- and beer-making supply stores sell them)", "1 750 ml bottle red wine, plus more"], "instructions": ["Put piece of mother in a widemouthed 1-gallon crock or glass container. Add 1 bottle red wine and 2 cups water. Secure a double-layered piece of cheesecloth over top and stash in a quiet, cool, dark place.", "Feed it every week or so with leftover red or white wine. Gently push mother aside as you add wine. After about 3 months of feeding, when it tastes like vinegar, strain it into clean bottles and let it age. To keep liquid clear and to prevent a new mother from forming, pasteurize it first: Pour it into a pot, dilute it by 25 percent (or to your taste) with water, and heat until an instant-read thermometer registers 155°; maintain this temperature for 30 minutes."]}, "Yogurt Chicken with Ginger-Coriander Chutney": {"ingredients": ["1 garlic clove, grated", "1 cup plain nonfat Greek yogurt", "2 tablespoons olive oil plus more for brushing", "1/4 teaspoon Hungarian hot paprika or cayenne pepper", "1 teaspoon kosher salt", "1 1/2 pounds skinless, boneless chicken thighs, trimmed of fat and gristle, each cut into 2-3 pieces", "1 bunch cilantro, chopped", "1 serrano chile, seeded, minced", "1/4 cup unsweetened flaked organic coconut", "1 1/2 tablespoons fresh lemon juice", "1 tablespoon chopped peeled ginger", "3/4 teaspoon kosher salt", "Olive oil (for brushing)"], "instructions": ["Whisk together garlic, yogurt, 2 Tbsp. oil, paprika, and salt in a large bowl. Add chicken; toss to coat with marinade. Cover and chill for at least 20 minutes and up to 1 day.", "Purée cilantro, chile, coconut, lemon juice, ginger, salt, and 1/4 cup water in a blender or food processor until smooth. Set aside.", "Place a rack in middle of oven and another rack in top third of oven; preheat to 425°. Lightly brush a rimmed baking sheet with oil. Remove chicken from marinade, shaking off excess. Place in a single layer on prepared sheet.", "Bake chicken on middle rack until cooked through, 10-15 minutes. Turn on broiler and move chicken to upper rack. Broil until tops of chicken pieces are browned in spots, about 3 minutes.", "Serve chicken with chutney."]}, "Yarnall Family's Fyrstekake": {"ingredients": ["1 1/4 cups all-purpose flour", "1 teaspoon baking powder", "1/2 teaspoon ground cardamom, preferably freshly ground", "1/4 teaspoon kosher salt", "1/2 cup (1 stick) unsalted butter, room temperature", "1/2 cup sugar", "1 large egg yolk", "2 teaspoons whole milk or heavy cream", "Unsalted butter (for pan)", "2 cups slivered almonds", "1 cup powdered sugar", "3/4 teaspoons ground cardamom, preferably freshly ground", "1/4 teaspoon freshly grated nutmeg", "3 large egg whites", "1/2 teaspoon vanilla extract", "1 large egg yolk", "A 9-inch-diameter fluted tart pan with removable bottom; decorative cookie cutters"], "instructions": ["Whisk flour, baking powder, cardamom, and salt in a medium bowl; set aside. Using an electric mixer, beat 1/2 cup butter and sugar in a medium bowl until pale and fluffy, about 3 minutes. Beat in egg yolk and milk. With mixer running on low speed, gradually add dry ingredients and beat just until thoroughly combined.", "Pat dough into a ball; break off one-quarter of dough. Form each piece into a ball. Flatten balls into disks. Cover separately and chill dough disks for at least 2 hours or overnight.", "Butter tart pan. Break larger dough disk into small pieces and scatter over bottom of tart pan. Using your fingertips, press dough onto bottom and up sides of pan. Use the flat bottom of a measuring cup to smooth the surface and trim the edges. Roll out smaller dough disk to about 1/8 inches thick. Using decorative cookie cutters, cut out shapes and place on a parchment paper-lined baking sheet. Cover and chill crust and cutouts for 1 hour.", "Preheat oven to 350°. Pulse almonds, powdered sugar, cardamom, and nutmeg in a food processor until nuts are finely ground. Transfer dry ingredients to a large bowl. Using an electric mixer, beat egg whites and vanilla in a medium bowl until medium peaks form. Gently fold egg whites into dry ingredients.", "Whisk egg yolk and 2 teaspoons water in a small bowl to blend. Fill chilled crust with almond mixture; smooth top. Arrange cutouts on top and brush cutouts with egg wash.", "Bake tart until crust and cutouts are golden brown and filling is set, 30-35 minutes. Transfer to a wire rack; let cool. DO AHEAD: Tart can be made 2 days ahead. Store airtight at room temperature."]}, "Yucatán-Style Habanero Salsa": {"ingredients": ["25 fresh habanero chiles t", "2 heads of garlic, cloves separated, unpeeled", "1 1/4 cups fresh lime juice", "2 teaspoons kosher salt plus more"], "instructions": ["Char chiles in broiler or over a gas flame until blackened all over. Place in a medium bowl; cover with plastic. Let steam for 15 minutes.", "Meanwhile, heat a large dry cast-iron skillet over medium-high heat. Toast garlic until tender and skins are charred, about 8 minutes. Let cool.", "Wearing gloves, peel chiles; discard stems. Peel garlic cloves.", "Pulse chiles, garlic, lime juice, and 2 tsp. salt in a blender until a coarse purée forms. Season with salt."]}, "Yellow Natural Food Dye": {"ingredients": ["3 tablespoons distilled white vinegar", "2 teaspoons turmeric or 2 pinches saffron threads"], "instructions": ["Bring 3 cups water to a boil; add vinegar and turmeric or saffron. Let steep for 10 minutes. Add eggs and let steep in solution for at least 30 minutes and up to 3 hours."]}, "Yukon Gold Potatoes and Fuji Apple Gratins": {"ingredients": ["1 tablespoon unsalted butter plus more for dishes, room temperature", "2 large shallots, minced", "2 1/3 cups heavy cream", "2 large sprigs thyme", "1 bay leaf", "1 1/2 cups coarsely grated peeled Yukon Gold potatoes (about 9 1/2 ounces)", "Kosher salt and freshly ground black pepper", "1 medium Fuji apple, peeled, cored, finely diced (about 1 1/4 cups)", "Chopped fresh chives"], "instructions": ["Preheat oven to 375°. Lightly butter soufflé dishes; place on a rimmed baking sheet. Melt remaining 1 Tbsp. butter in a medium heavy saucepan over medium-low heat. Add shallots and sauté until beginning to soften, about 3 minutes. Add cream, thyme, and bay leaf; increase heat to medium and simmer for 3 minutes. Stir in potatoes and simmer until partially cooked and mixture is thick and creamy, about 4 minutes. Discard thyme sprigs and bay leaf and season with salt and pepper.", "Sprinkle apples over the bottoms of prepared dishes, dividing equally. Spoon potato mixture over. Cover dishes tightly with foil and bake until potato mixture and apples are tender (tops will not be brown), about 30 minutes. Let stand for 10 minutes. Uncover, sprinkle with chives and serve."]}, "Yuzu Kosho": {"ingredients": ["1 cup finely grated lime zest (from about 16 limes)", "2 tablespoons finely grated lemon zest", "2 tablespoons finely grated grapefruit zest (preferably white)", "1 teaspoon kosher salt", "2 tablespoons fresh grapefruit juice (preferably white)", "2 tablespoons bottled yuzu juice", "1 green Thai chile, seeded, minced", "2 teaspoons fresh lime juice", "Pinch of sugar"], "instructions": ["Combine zests and salt on a cutting board. Chop, dragging the knife blade at an angle across mixture, until a coarse paste forms. Transfer to a small bowl. Mix in remaining ingredients. Transfer to a small jar, cover, and chill for 2 days. DO AHEAD: Can be made 2 weeks ahead. Keep chilled."]}, "Yukon Gold Potato and Wild Mushroom Gratin": {"ingredients": ["6 tablespoons (3/4 stick) butter", "12 ounces assorted fresh wild mushrooms, sliced", "3 pounds Yukon Gold potatoes", "1 1/2 teaspoons salt", "3/4 teaspoon ground black pepper", "2 cups heavy whipping cream"], "instructions": ["Preheat oven to 375°. Melt butter in heavy large skillet over medium-high heat. Add mushrooms and sauté until brown and soft, about 6 minutes. Generously butter 11x7x2-inch baking dish. Peel and cut potatoes into 1/8-inch-thick slices. Arrange 2 layers of potatoes in prepared dish. Spoon 1/3 of mushrooms over potatoes. Sprinkle with 1/2 teaspoon salt and 1/4 teaspoon pepper.", "Repeat 2 more times with potatoes, mushrooms, salt, and pepper. Pour cream over potatoes. Cover with foil and bake 45 minutes. DO AHEAD: Can be made 2 hours ahead. Let stand at room temperature. Uncover and continue baking until golden brown and set, about 20 minutes longer (30 minutes if room temperature). Let stand 10 minutes before serving."]}, "Yogurt & Matcha Swirl with Mango": {"ingredients": ["1 ripe mango, peeled, pitted, cut Into small cubes", "4 teaspoons sugar, divided", "3 1/2 ounces high-quality white chocolate (such as Lindt or Perugina), chopped", "1 1/2 cups low-fat Greek-style yogurt", "1 teaspoon matcha powder"], "instructions": ["Mix mango with 2 tsp. sugar. Let macerate for 30 minutes. Place white chocolate in a metal bowl set over a saucepan of simmering water and stir until melted. Remove from heat and whisk until smooth. Let cool slightly. Gradually whisk in yogurt. Divide mixture between 2 small bowls.", "Whisk remaining 2 tsp. sugar and matcha powder in another small bowl. Add 1 Tbsp. hot water; whisk to form a thick paste. Add paste to 1 bowl with white chocolate-yogurt mixture; whisk to blend well.", "Divide mango among 4 Old Fashioned glasses. Make a well in green yogurt mixture and pour white yogurt mixture into center. Fold once or twice, just enough to create swirls. Spoon over mango, dividing equally."]}, "Yogurt Panna Cotta with Fresh Plums": {"ingredients": ["Canola oil", "2 tablespoons water", "2 tablespoons fresh lemon juice", "2 1/2 teaspoons unflavored gelatin", "2 1/4 cups plain whole-milk yogurt (preferably organic)", "1 3/4 cups heavy whipping cream, divided", "3/4 cup sugar", "6 small ripe plums, thinly sliced", "1/4 cup sugar", "1 tablespoon fresh lemon juice", "1 teaspoon finely grated lemon peel"], "instructions": ["Lightly coat inside of 9-inch cake pan with 1 1/2-inch-high sides with canola oil. Combine 2 tablespoons water and lemon juice in small bowl. Sprinkle gelatin over; stir to blend. Let stand until gelatin softens, about 15 minutes. Whisk yogurt and 3/4 cup cream in large bowl. Combine 1 cup cream and sugar in small saucepan; bring to simmer over medium heat, stirring until sugar dissolves. Remove from heat. Add gelatin mixture to hot cream mixture; whisk until gelatin dissolves. Add cream-gelatin mixture to yogurt mixture; whisk to blend. Pour mixture into cake pan. Chill uncovered until cold, then cover and keep refrigerated until panna cotta is set, at least 8 hours or overnight. DO AHEAD Can be made 2 days ahead. Keep refrigerated.", "Combine plums, sugar, lemon juice, and lemon peel in medium bowl; toss to coat. Let stand at room temperature until juices form, tossing occasionally, about 30 to 45 minutes. DO AHEAD Can be made 8 hours ahead. Cover and refrigerate. Using small knife, cut around panna cotta to loosen edges. Fill large bowl with 1 inch of hot water. Dip bottom of pan into hot water to help loosen. Place dessert platter upside-down atop pan; invert panna cotta onto platter. Carefully lift off pan and allow panna cotta to settle onto platter.", "Cut panna cotta into wedges. Divide among plates. Serve with plum mixture."]}, "Yudofu ": {"ingredients": ["2 4x3-inch pieces dashi-kombu (about 1/5 ounce)", "4 cups water", "1 cup dashi", "3 tablespoons dark soy sauce", "1 1/2 teaspoons mirin", "1 teaspoon bonito flakes", "1 green onion, thinly sliced", "1 cup 1/2-inch cubes mushrooms (such as king oyster or stemmed shiitakes)", "1 12-ounce package tofu, cut into 1 1/4- to 1 1/2-inch cubes", "1/2 cup coarsely chopped mizuna", "1 teaspoon finely grated peeled fresh ginger"], "instructions": ["Place dashi-kombu in medium saucepan. Add 4 cups water and let soak 2 hours. Remove dashi-kombu; reserve dashi-kombu broth.", "Mix dashi, soy sauce, and mirin in small saucepan. Bring to simmer. Add 1 teaspoon bonito flakes. Strain sauce into medium microwave-safe bowl. DO AHEAD Dashi-kombu broth and dashi dipping sauce can be made 1 day ahead. Cover separately and chill.", "Place green onion in small bowl. Add enough water to cover. Let stand 5 minutes, then drain well. Bring dashi-kombu broth to simmer in medium saucepan over medium heat. Add mushrooms and simmer until almost tender, about 3 minutes. Add tofu and simmer until heated through, about 2 minutes. Add mizuna and simmer until just wilted, about 1 minute. Rewarm dashi dipping sauce in microwave. Divide between 2 shallow soup bowls. Using slotted spoon, divide tofu, mushrooms, and mizuna between bowls. Sprinkle green onion and ginger over and serve."]}, "Yams with Crispy Skins and Brown-Butter Vinaigrette": {"ingredients": ["8 slender medium garnet yams or other yams (red-skinned sweet potatoes; about 5 pounds total), rinsed, dried", "1 cup (2 sticks) unsalted butter", "1 small shallot, peeled", "1 garlic clove, peeled", "1 teaspoon coarse kosher salt plus additional for seasoning", "1 tablespoon Dijon mustard", "1 1/2 tablespoons red wine vinegar", "Vegetable oil (for frying)"], "instructions": ["Preheat oven to 400°F. Pierce each yam in several places with fork. Place directly on oven rack and roast until just tender, 40 to 50 minutes, depending on size of yams.", "Transfer roasted yams to work surface. Using scissors, cut off ends of each yam, then cut skin on 1 long side and peel off in 1 piece, being careful not to break warm yams. Let yams cool to room temperature. Tear or cut skins into long ribbons, about 1 inch wide.", "Cut yams crosswise into 1/2-inch-thick rounds. Arrange rounds, slightly overlapping, in 13x9x2-inch glass baking dish or other ovenproof dish. Cover yams with aluminum foil to keep moist. DO AHEAD Yams can be made up to 3 hours ahead. Let stand at room temperature. Rewarm yams in 350°F oven 15 to 20 minutes before serving.", "Melt butter in large skillet over medium heat. Cook until butter browns (milk solids will turn deep golden brown), stirring occasionally, 8 to 10 minutes. Carefully pour butter, including all brown milk solids, into small bowl.", "Blend shallot, garlic, and 1 teaspoon coarse salt in processor until smooth, occasionally scraping down sides of bowl. Add Dijon mustard, then red wine vinegar. With motor running, gradually drizzle in butter (including browned milk solids). Season vinaigrette to taste with pepper and additional salt, if desired. DO AHEAD Vinaigrette can be made 1 hour ahead. Let stand at room temperature. Blend again 5 seconds before using.", "Pour enough vegetable oil into large deep skillet to reach depth of 1 inch. Attach deep-fry thermometer to side of skillet and heat oil to 350°F. Add yam skins in batches (oil will bubble up) and fry until skins are crisp and brown, stirring occasionally, about 3 minutes. Using slotted spoon, carefully transfer yam skins to paper towels to drain. Sprinkle skins with coarse salt and pepper.", "Spoon vinaigrette over potatoes. Scatter crisp skins over and serve."]}, "Yellow Tomato Gazpacho with Cilantro Oil and Avocado": {"ingredients": ["1 3/4 pounds yellow tomatoes, halved", "1 cup chopped seeded peeled cucumber", "1 cup chopped yellow bell pepper", "1/2 cup finely chopped onion", "1/2 cup orange juice", "3 tablespoons extra-virgin olive oil", "2 tablespoons Champagne vinegar or white wine vinegar", "2 garlic cloves, chopped", "1 medium jalapeño chili with seeds, chopped (about 1 tablespoon)", "Cilantro Oil", "1 avocado, peeled, pitted, chopped"], "instructions": ["Squeeze tomato juices and seeds into strainer set over bowl. Press on seeds to extract all juice. Chop tomatoes. Set aside 1/2 cup chopped tomatoes, 1/4 cup cucumber, and 1/4 cup bell pepper.", "Combine remaining tomatoes, cucumber, and bell pepper in processor. Add tomato juices, onion, orange juice, oil, vinegar, garlic, and jalapeño; process until smooth. Season with salt and pepper. Transfer soup to bowl; add reserved vegetables. Cover and chill overnight.", "Divide soup among 6 bowls. Drizzle with cilantro oil. Sprinkle with avocado."]}, "Yogurt Mousse with Fresh Figs, Honey, and Cinnamon Streusel": {"ingredients": ["2 tablespoons plus 1/2 cup water", "1 teaspoon unflavored gelatin", "1 cup labneh (thick Middle Eastern yogurt cheese)*", "7 tablespoons powdered sugar", "1/2 cup chilled heavy whipping cream", "4 1/2 tablespoons golden brown sugar", "3 1/2 tablespoons all purpose flour", "3 tablespoons almond flour or almond meal**", "1/4 teaspoon ground cinnamon plus additional for garnish", "2 tablespoons (1/4 stick) chilled unsalted butter, cut into 1/2-inch cubes", "", "12 fresh figs, quartered", "1 12-ounce container fresh strawberries, hulled, quartered", "Honey", "Grated orange peel"], "instructions": ["Pour 2 tablespoons water into small bowl. Sprinkle gelatin over; let stand 10 minutes. Bring remaining 1/2 cup water to simmer in small saucepan. Pour hot water over gelatin; stir to dissolve. Cool slightly.", "Place labneh in medium mixing bowl; sift powdered sugar over. Whisk to blend.", "Once gelatin has cooled to tepid, pour into yogurt mixture; whisk until blended. Continue to whisk another 2 minutes.", "Beat cream to peaks in separate bowl. Add to yogurt mixture in 2 additions. Divide among 6 custard cups. Cover and chill until set, 6 hours or overnight.", "Preheat oven to 350°F. Whisk brown sugar, flour, almond meal, and 1/4 teaspoon cinnamon in small bowl. Add butter and rub in with fingertips until mixture resembles coarse meal.", "Spread streusel onto baking sheet and bake until golden, 8 to 9 minutes. Cool.", "Run sharp knife around edge of custard cups to loosen mousse. Invert each, shaking. Sprinkle streusel over mousse; surround with fruits. Drizzle with honey and dust with cinnamon and orange peel."]}, "Yogurt-Marinated Chicken Kebabs with Aleppo Pepper": {"ingredients": ["1 1/2 tablespoons Aleppo pepper* or 2 teaspoons dried crushed red pepper plus 2 teaspoons Hungarian sweet paprika, plus additional Aleppo pepper or paprika for sprinkling", "1 cup plain whole-milk Greek-style yogurt** (8 ounces)", "3 tablespoons extra-virgin olive oil", "2 tablespoons red wine vinegar", "2 tablespoons tomato paste", "2 teaspoons coarse kosher salt", "1 teaspoon freshly ground black pepper", "6 garlic cloves, peeled, flattened", "2 unpeeled lemons; 1 thinly sliced into rounds, 1 cut into wedges for serving", "2 1/4 pounds skinless boneless chicken (thighs and/or breast halves), cut into 1 1/4-inch cubes"], "instructions": ["If using Aleppo pepper, place in large bowl and mix in 1 tablespoon warm water. Let stand until thick paste forms, about 5 minutes. If using dried crushed red pepper and paprika combination, place in large bowl and stir in 2 tablespoons warm water and let stand until paste forms, about 5 minutes. Add yogurt, olive oil, red wine vinegar, tomato paste, 2 teaspoons coarse salt, and 1 teaspoon black pepper to spice mixture in bowl; whisk to blend. Stir in garlic and lemon slices, then chicken. Cover and chill at least 1 hour. DO AHEAD Can be made 1 day ahead. Keep chilled.", "Prepare barbecue (medium-high heat). Thread chicken pieces on metal skewers, dividing equally. Discard marinade in bowl. Sprinkle each skewer with salt, pepper, and additional Aleppo pepper or paprika. Brush grill rack with oil. Grill chicken until golden brown and cooked through, turning skewers occasionally, 10 to 12 minutes total. Transfer skewers to platter. Surround with lemon wedges and serve."]}, "Yukon Gold Cinnamon Rolls": {"ingredients": ["1 pound Yukon Gold potatoes, peeled, cut into 2-inch pieces", "1 tablespoon coarse kosher salt", "1/2 cup (1 stick) unsalted butter", "3 large eggs", "4 1/2 cups (or more) unbleached all purpose flour", "1/2 cup warm water (105°F to 115°F)", "3 1/4-ounce envelopes active dry yeast (scant 2 tablespoons)", "2 tablespoons sugar", "1 1/3 cups (packed) golden brown sugar", "2 1/2 tablespoons ground cinnamon", "3 tablespoons unbleached all purpose flour", "9 tablespoons (1 stick plus 1 tablespoon) unsalted butter, room temperature", "2 cups powdered sugar", "1/4 cup (1/2 stick) unsalted butter, melted", "2 tablespoons (or more) whole milk", "1 teaspoon vanilla extract", "1/8 teaspoon coarse kosher salt"], "instructions": ["Combine potatoes, 2 cups water, and 1 tablespoon coarse salt in large saucepan. Boil until potatoes are very tender, 15 to 18 minutes. Mash potatoes with water in pan (do not drain water). Add butter and mash until butter is melted. Whisk in eggs, then 1 cup flour; mash until very smooth. Let potatoes stand until barely lukewarm, about 10 minutes.", "Meanwhile, pour 1/2 cup warm water into large bowl of stand mixer fitted with paddle attachment; stir in yeast and sugar. Let stand until foamy, about 10 minutes. Add potato mixture to yeast mixture; mix on low speed until well blended, 2 minutes. Mix in 3 cups flour, 1 cup at a time, beating well. Beat until sticky dough forms.", "Spread 1/2 cup flour on work surface. Scrape dough out onto floured work surface. Knead until dough is smooth and elastic, adding more flour by tablespoonfuls if dough is very sticky, about 8 minutes.", "Coat large bowl with butter. Transfer dough to bowl and turn to coat. Cover bowl with plastic wrap, then kitchen towel. Let dough rise in warm draft-free area until doubled in volume, about 1 hour.", "Mix brown sugar, cinnamon, and flour in medium bowl. Using fork, mix in butter.", "Position rack in center of oven and preheat to 425°F. Line large rimmed baking sheet with parchment. Turn dough out onto well-floured work surface. Roll out dough to 24x16-inch rectangle. Sprinkle filling evenly over dough. Starting at 1 long side, roll up dough jelly-roll style, enclosing filling. Using large knife dipped in flour, cut roll crosswise into 12 pieces. Transfer rolls to baking sheet, spacing rolls about 3/4 inch apart. Cover baking sheet loosely with plastic wrap. Let rise in warm draft-free area until almost doubled in volume, about 20 minutes (rolls will be very puffy).", "Bake cinnamon rolls until golden, about 20 minutes. Cool rolls 10 minutes on baking sheet.", "Whisk powdered sugar, melted butter, 2 tablespoons milk, vanilla, and coarse salt in small bowl. If glaze is too thick to spread, add more milk by 1/2 teaspoonfuls as needed. Spread glaze over warm rolls."]}, "Yukon Gold and Fennel Purée with Rosemary Butter": {"ingredients": ["3 large fresh fennel bulbs (about 2 1/4 pounds total), trimmed, quartered through core, center core trimmed and discarded, cut into 3/4-inch pieces", "1 medium onion, cut into 3/4-inch pieces (about 1 3/4 cups)", "3 tablespoons extra-virgin olive oil", "2 teaspoons fine sea salt, divided", "3 pounds Yukon Gold potatoes, peeled, cut into 1 1/2-inch pieces", "1/2 cup (1 stick) butter", "1 1/2 tablespoons chopped fresh rosemary", "1/2 cup crème fraîche"], "instructions": ["Preheat oven to 375°F. Line large rimmed baking sheet with parchment paper. Combine fennel, onion, oil, and 1 teaspoon sea salt in large bowl; toss. Spread in single layer on prepared baking sheet; sprinkle with pepper. Roast until fennel and onion are very tender, about 1 hour 15 minutes. Cool slightly. Transfer fennel mixture to processor and puree until almost smooth.", "Cook potatoes in large pot of boiling salted water until very tender, about 25 minutes. Drain well. Cool slightly. Place in large bowl and mash with potato masher until smooth. Mix in fennel purée.", "Melt butter with rosemary and 1 teaspoon sea salt in small saucepan over medium heat. Stir butter mixture into fennel-potato puree. Mix in crème fraîche. Season to taste with more pepper and salt, if desired. DO AHEAD Can be made 6 hours ahead. Transfer puree to large microwave-safe bowl. Cover with plastic wrap. Chill. Before serving, microwave on high until heated through, about 4 minutes."]}, "Yukon Gold Potato Salad with Chiles, Cilantro, and Toasted Cumin ": {"ingredients": ["1/4 cup red wine vinegar", "1 garlic clove, minced", "3/4 cup extra-virgin olive oil", "4 ears of corn, husked", "3 large fresh poblano chiles or Anaheim chiles*", "2 large red bell peppers", "2 teaspoons cumin seeds", "3 pounds unpeeled baby Yukon Gold potatoes or baby Dutch yellow potatoes", "6 green onions, chopped", "1/3 cup chopped fresh cilantro"], "instructions": ["Whisk vinegar and garlic in small bowl. Gradually whisk in olive oil. Season vinaigrette to taste with salt and pepper.", "Place corn, chiles, and bell peppers on grill. Cover and grill until corn kernels are tender and chiles and bell peppers are blackened on all sides, turning frequently, about 5 minutes for corn and 12 minutes for chiles and bell peppers. Transfer vegetables to 2 baking pans. Cover chiles and bell peppers; let stand until cool. Cut corn kernels off cobs; transfer to medium bowl. Peel, seed, and coarsely chop chiles and bell peppers; add to bowl with corn. DO AHEAD: Vinaigrette and vegetables can be made 1 day ahead. Cover separately; chill. Bring vinaigrette to room temperature and rewhisk before using.", "Stir cumin seeds in small dry skillet over medium heat until fragrant, about 2 minutes. Transfer to small bowl; set aside. Cook potatoes in large pot of boiling salted water just until tender when pierced with knife, about 20 minutes. Drain. Rinse under cold water. Drain and cool slightly. Cut potatoes into 1/3- to 1/2-inch-thick slices. Transfer to large bowl. Add grilled vegetables and vinaigrette; toss to coat. Add cumin seeds, green onions, and cilantro and toss. Season generously with salt and pepper. Cover; chill at least 2 hours. do ahead Can be made 8 hours ahead. Keep refrigerated. Serve chilled or at room temperature.", "*Sold at some supermarkets and at specialty foods stores and Latin markets."]}, "Yogurt with Granola, Tropical Fruit, and Crystallized Ginger": {"ingredients": ["3 cups diced peeled tropical fruit (such as pineapple, mango, and kiwi)", "1/3 cup honey", "1/3 cup finely chopped crystallized ginger plus additional for garnish", "2 1/2 cups plain nonfat or reduced-fat (2%) Greek-style yogurt, divided", "2 cups purchased granola (with nuts and dried fruits, if desired)"], "instructions": ["Mix fruit, honey, and 1/3 cup crystallized ginger in medium bowl. Spoon 1/2 cup yogurt into each bowl. Top each with 1/2 cup granola, then 3/4 cup fruit mixture. Spoon remaining 1/2 cup yogurt in dollops over fruit. Garnish with more chopped crystallized ginger and serve."]}, "Yucatecan Pickled Onions": {"ingredients": ["6 cups water", "1 large red onion, cut crosswise into 1/8-inch-thick slices, rings separated", "2 garlic cloves, quartered", "1 tablespoon coarse kosher salt", "1/2 cup distilled white vinegar", "3 whole allspice", "1 bay leaf", "1/2 teaspoon ground black pepper", "1/2 teaspoon dried oregano (preferably Mexican)", "1/4 teaspoon ground cumin"], "instructions": ["Combine 6 cups water, onion, garlic, and 1 tablespoon coarse salt in heavy medium saucepan. Bring to boil, then boil 1 minute. Drain. Return onions and garlic to same saucepan. Add vinegar and all remaining ingredients. Add enough water to saucepan just to cover onions. Bring to boil over medium heat. Remove from heat, cover, and cool. Transfer onion mixture to bowl, cover, and chill overnight. DO AHEAD: Can be made 1 week ahead. Keep chilled.", "Drain onions and serve."]}, "Yucatecan-Style Grilled Mahi-Mahi": {"ingredients": ["4 6-to 8-ounce mahi-mahi fillets", "1/4 cup achiote paste", "2 tablespoons fresh orange juice", "2 tablespoons fresh lime juice", "2 tablespoons distilled white vinegar", "2 garlic cloves, minced", "1 teaspoon dried oregano (preferably Mexican)", "1/2 teaspoon coarse kosher salt or sea salt", "1/2 teaspoon ground black pepper", "2 3-foot-long pieces of banana leaves", "2 tablespoons extra-virgin olive oil", "1/4 cup dry white wine", "4 bay leaves", "4 fresh epazote or Italian parsley sprigs or 4 pinches of dried epazote", "2 plum tomatoes, thinly sliced", "2 limes, thinly sliced"], "instructions": ["Place fish in 13x9x2-inch glass baking dish. Whisk achiote paste and next 7 ingredients in medium bowl. Pour achiote mixture over fish; turn to coat. Cover and chill 1 hour.", "Prepare barbecue (high heat). Brush shiny side of banana leaves with 2 tablespoons oil; place each on baking sheet, oiled side down (some of leaf will hang over edge of sheet). Arrange 2 fillets with marinade still clinging crosswise in center of each banana leaf, spacing 2 inches apart. Drizzle wine around fish in leaves. Top each fillet with 1 bay leaf and 1 sprig of fresh epazote or parsley or 1 pinch of dried epazote. Fold overhanging edges of banana leaf over fish to enclose loosely. Transfer fish from baking sheet to grill, folded edges up. Cover and grill until fillets are just opaque in center, about 10 minutes.", "Open banana leaves. Transfer fish to plates. Garnish with tomato and lime slices. Serve with Yucatecan Pickled Onions and Habanero-Tomato Salsa."]}, "Yucatan-Style Chicken, Lime, and Orzo Soup": {"ingredients": ["3/4 cup orzo (rice-shaped pasta)", "1 1/2 tablespoons olive oil", "1 medium white onion, thinly sliced", "6 garlic cloves, thinly sliced", "2 jalapeño chiles, thinly sliced", "3/4 pound skinless boneless chicken breasts, cut into matchstick-size strips", "5 cups low-salt chicken broth", "1/4 cup fresh lime juice", "1 large tomato, seeded, chopped", "1/4 cup chopped fresh cilantro", "Fresh cilantro sprigs"], "instructions": ["Cook orzo in pot of boiling salted water until just tender. Drain well.", "Heat oil in large saucepan over medium heat. Add onion, garlic, and chiles. Sauté until onion begins to brown, about 4 minutes. Add chicken; sauté 1 minute. Add broth, lime juice, and tomato. Simmer until chicken is cooked through, about 3 minutes. Mix in orzo, then chopped cilantro. Season soup with salt and pepper. Ladle soup into 4 bowls. Garnish with cilantro sprigs."]}, "Yemeni Spice Rub": {"ingredients": ["1/3 cup caraway seeds (generous 1 ounce)", "1/3 cup cumin seeds (about 1 ounce)", "3 tablespoons cardamom seeds (about 1/2 ounce)", "1 tablespoon whole black peppercorns", "4 whole cloves", "3 tablespoons coarse kosher salt", "3 tablespoons ground turmeric"], "instructions": ["Heat heavy large skillet over medium-high heat. Add first 5 ingredients; toast until aromatic and cumin seeds are slightly darker, stirring often, about 2 minutes. Cool slightly. Working in batches, finely grind spice mixture and salt in spice mill. Transfer to medium bowl. Whisk in turmeric. Transfer to airtight container. DO AHEAD Can be made 1 month ahead. Store at room temperature."]}, "Yogurt-Braised Chicken with Cashews and Raisins": {"ingredients": ["1 3-pound best-of-fryer chicken (8 pieces)", "1 1/2 tablespoons plus 2 teaspoons coarse kosher salt", "4 teaspoons ground cumin, divided", "1 1/2 teaspoons ground cardamom, divided", "1 teaspoon cayenne pepper", "2 1/2 cups raisins (about 12 ounces), divided", "1 1/2 cups hot water", "", "4 cups plain yogurt", "2 teaspoons freshly ground black pepper", "2 teaspoons ground cinnamon", "", "5 tablespoons Clarified Butter (see recipe)", "1 cup raw cashews (about 5 ounces)", "10 whole cloves", "", "1/3 to 1/2 cup fresh lemon juice"], "instructions": ["Place chicken, skin side up, on rimmed baking sheet. Mix 1 1/2 tablespoons salt, 3 teaspoons cumin, 1 teaspoon cardamom, and cayenne in small bowl. Sprinkle chicken generously on all sides with spice mix. Let stand 2 hours.", "Combine 1 cup raisins and 1 1/2 cups hot water in medium bowl. Cover; soak until raisins are soft, at least 30 minutes and up to 1 hour. Drain, reserving soaking liquid. Blend raisins and 3 tablespoons reserved soaking liquid in mini processor, adding more soaking liquid, if needed, to make smooth paste.", "Place yogurt in medium bowl; whisk 1 minute to lighten. Add black pepper, cinnamon, remaining 2 teaspoons salt, 1 teaspoon cumin, and 1/2 teaspoon cardamom and whisk to blend.", "Heat butter in large nonstick skillet over high heat. Add chicken, skin side down, and sauté until brown, about 6 minutes per side. Add remaining 1 1/2 cups raisins, cashews, and cloves. Slowly stir in yogurt mixture. Reduce heat, cover, and simmer until chicken is cooked through, about 12 minutes.", "Transfer chicken to platter. Whisk raisin paste and 1/3 cup lemon juice into sauce. Simmer to blend, whisking constantly, about 4 minutes. Season with salt, pepper, and more lemon juice, if desired. Spoon over chicken."]}, "Yorkshire Pudding with Bacon and Sage": {"ingredients": ["6 ounces bacon slices (about 7 slices), cut into 1-inch pieces", "2 tablespoons (about) butter, melted", "", "1 1/2 cups all purpose flour", "3 tablespoons chopped fresh sage, divided", "1 teaspoon coarse kosher salt", "1 1/2 cups whole milk", "3 large eggs"], "instructions": ["Place rack in center of oven and preheat to 450°F. Sauté bacon in large skillet over medium heat until crisp. Transfer to paper towels to drain. Transfer drippings to glass measuring cup. If needed, add enough melted butter to measure 1/4 cup total. Pour drippings into 13x9x2-inch glass baking dish. Place dish in hot oven to heat drippings 10 minutes.", "Whisk flour, 2 tablespoons sage, and salt in medium bowl to blend. Whisk milk and eggs to blend in large bowl; add flour mixture and whisk until batter is smooth. Whisk in 2/3 of bacon. Remove hot baking dish from oven. Using oven mitts or pot holders to protect hands, tilt dish to distribute drippings evenly. Pour batter into pan. Bake 15 minutes; reduce oven temperature to 350°F and continue to bake until golden brown and puffed, about 12 minutes longer (do not open oven door while baking).", "Remove pudding from oven. Crumble remaining bacon over pudding, sprinkle with remaining 1 tablespoon sage, and serve."]}, "Yukon Gold and Sweet Potato Gratin": {"ingredients": ["6 tablespoons (3/4 stick) butter, room temperature, divided", "2 1/4 pounds Yukon Gold potatoes, rinsed", "1 1/2 pounds red-skinned sweet potatoes (yams), peeled", "2 cups whole milk", "1 garlic clove, pressed", "1 tablespoon kosher salt", "2 teaspoons fresh thyme leaves", "1 teaspoon ground black pepper", "1/8 teaspoon ground nutmeg", "1 cup whipping cream"], "instructions": ["Preheat oven to 400°F. Coat 13x9x2-inch glass baking dish with 2 tablespoons butter. Thinly slice all potatoes; place in prepared dish. Bring milk and next 5 ingredients to boil in medium saucepan; pour over potatoes. Dot with 2 tablespoons butter. Cover with foil. Bake until potatoes are tender and milk is almost absorbed, about 50 minutes.", "Bring cream to boil in saucepan. Uncover potatoes, pour cream over, and dot with 2 tablespoons butter. Bake uncovered until top is golden brown in spots, about 25 minutes. Cool slightly."]}, "Yellow Rice": {"ingredients": ["2 teaspoons vegetable oil", "2 tablespoons chopped shallot", "1 garlic clove, chopped", "1 1/2 cups jasmine rice or basmati rice, well rinsed", "2 1/4 cups low-salt chicken broth", "1 teaspoon (scant) salt", "1/2 teaspoon (scant) turmeric"], "instructions": ["Heat oil in heavy medium saucepan over medium-high heat. Add shallot and garlic; sauté until just beginning to brown, about 2 minutes. Add rice, broth, salt, and turmeric. Bring rice to boil. Reduce heat to medium-low, cover, and simmer until rice is tender and liquid is absorbed, about 18 minutes."]}, "Yukon Gold Potato Salad with Crispy Prosciutto and Truffle Oil": {"ingredients": ["2 pounds Yukon Gold potatoes, peeled, cut into 1/4-inch-thick slices", "2 1/2 cups low-salt chicken broth", "2 tablespoons (1/4 stick) butter", "3 ounces chopped sliced prosciutto", "1 cup chopped celery", "1/2 cup chopped sweet onion (such as Vidalia or Maui)", "1/2 cup chopped fresh chives", "1 tablespoon (or more) truffle oil", "1 tablespoon fresh lemon juice"], "instructions": ["Place potatoes in large saucepan. Add chicken broth. Bring to boil. Reduce heat to medium and simmer, partially covered, until potatoes are just tender, about 6 minutes. Drain potatoes, reserving broth. Place potatoes in large bowl. Return broth to same saucepan and boil until reduced to 1/3 cup, about 13 minutes. Pour over potatoes and toss gently until broth is absorbed.", "Melt butter in medium nonstick skillet over medium heat. Add prosciutto and sauté until crisp, about 6 minutes. Transfer prosciutto and butter from skillet to bowl with potatoes. Add celery, onion, and chives to potatoes. Whisk 1 tablespoon truffle oil and lemon juice in small bowl to blend. Drizzle over potato mixture; toss to coat. Season salad to taste with salt, pepper, and additional truffle oil, if desired. Serve warm or at room temperature. DO AHEAD Can be made 2 hours ahead. Let stand at room temperature."]}, "Yogurt Cake with Marmalade Glaze": {"ingredients": ["1 1/2 cups all purpose flour", "2 teaspoons baking powder", "1/4 teaspoon salt", "1 cup plain whole-milk yogurt", "1 cup sugar", "3 large eggs", "1 teaspoon (packed) finely grated lemon peel", "1/4 teaspoon vanilla extract", "1/2 cup vegetable oil", "1/4 cup lemon, orange, or grapefruit marmalade (for glaze)", "1 teaspoon water"], "instructions": ["Position rack in center of oven and preheat to 350°F. Generously butter 8 1/2x4 1/2x2 1/2-inch metal loaf pan. Sift flour, baking powder, and salt into medium bowl. Combine yogurt, sugar, eggs, lemon peel, and vanilla in large bowl; whisk until well blended. Gradually whisk in dry ingredients. Using rubber spatula, fold in oil. Transfer batter to prepared pan. Place pan on baking sheet.", "Place cake on baking sheet in oven and bake until cake begins to pull away from sides of pan and tester inserted into center comes out clean, about 50 minutes. Cool cake in pan on rack 5 minutes. Cut around pan sides to loosen cake. Turn cake out onto rack. Turn cake upright on rack and cool completely. DO AHEAD Can be made 1 day ahead. Wrap and store at room temperature.", "Stir marmalade and 1 teaspoon water in small saucepan over medium heat until marmalade melts. Brush hot mixture over top of cake. Let glaze cool and set. Cut cake crosswise into slices."]}, "Yellow Squash and Mozzarella Quiche with Fresh Thyme": {"ingredients": ["1 1/4 cups unbleached all purpose flour", "1/2 teaspoon salt", "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes", "4 tablespoons (or more) ice water", "1 tablespoon butter", "12 ounces yellow crookneck squash, cut into 1/4-inch thick rounds", "2 teaspoons chopped fresh thyme", "", "6 large eggs", "1 cup whipping cream", "3/4 teaspoon salt", "1/4 teaspoon ground black pepper", "1/4 teaspoon hot pepper sauce", "3/4 cup (packed) coarsely grated mozzarella cheese (about 3 ounces)"], "instructions": ["Blend flour and salt in processor. Add butter. Using on/off turns, blend until coarse meal forms. Add 4 tablespoons ice water. Using on/off turns, blend until dough comes together in moist clumps, adding more ice water by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap and chill at least 1 hour and up to 1 day.", "Preheat oven to 375°F. Roll out dough on floured surface to 14 1/2-inch round. Transfer to 10-inch-diameter tart pan with removable bottom. Fold overhang in; press to form double-thick sides. Push sides up until 1/4 inch higher than top edge of pan. Pierce crust all over with fork. Freeze 10 minutes.", "Line dough with foil and dried beans or pie weights. Bake until sides are set, about 25 minutes. Remove foil and beans. Bake until crust is golden, piercing with fork if crust bubbles, about 15 minutes. Transfer crust to rack; cool completely. Reduce oven temperature to 350°F.", "Melt butter in heavy medium skillet over medium heat. Add squash and thyme. Sauté until squash is just tender and translucent, about 5 minutes. Cool to room temperature.", "Whisk eggs, cream, salt, pepper, and hot sauce in bowl. Arrange squash over bottom of crust. Sprinkle with mozzarella. Place tart pan on oven rack. Pour egg mixture into crust, filling completely (some egg mixture may be left over).", "Bake quiche until filling is golden and set in center, about 35 minutes. Transfer quiche to rack; cool 15 minutes."]}, "Yogurt Panna Cotta with Cherry and Peach Compote": {"ingredients": ["1/4 cup water", "2 1/2 teaspoons unflavored gelatin", "1 1/4 cups whipping cream", "1/2 cup sugar", "2 cups plain low-fat yogurt", "1 teaspoon vanilla extract", "", "Cherry and Peach Compote (click for recipe)"], "instructions": ["Pour 1/4 cup water into small bowl; sprinkle gelatin over. Let stand 10 minutes. Bring cream and sugar to simmer in heavy medium saucepan over medium-high heat, stirring until sugar dissolves. Remove from heat. Add gelatin mixture and whisk until dissolved. Whisk in yogurt and vanilla. Divide mixture among eight 3/4-cup custard cups. Cover and chill overnight. DO AEHAD Can be made 2 days ahead. Keep refrigerated.", "Cut around edges of each panna cotta to loosen. Set each cup in shallow bowl of hot water for 10 seconds. Immediately invert onto plate. Top with compote."]}, "Yellow Rice Salad with Roasted Peppers and Spicy Black Beans": {"ingredients": ["4 teaspoons ground cumin", "1/4 cup fresh lime juice", "2 1/2 tablespoons vegetable oil", "", "1/2 teaspoon turmeric", "2 cups water", "1 cup basmati rice", "1 teaspoon salt", "1/2 cup thinly sliced green onions", "", "1 15- to 16-ounce can black beans, rinsed, drained", "1/2 cup chopped roasted red peppers from jar", "1/2 cup chopped green bell pepper", "1/3 cup chopped fresh cilantro", "1 1/2 teaspoons minced chipotle chiles*"], "instructions": ["Stir 3 teaspoons cumin in small dry skillet over medium heat just until fragrant, about 1 minute. Remove from heat. Whisk lime juice and oil into skillet.", "Stir turmeric and remaining cumin in heavy medium saucepan over medium heat until fragrant, about 1 minute. Add 2 cups water, rice and salt; bring to boil. Reduce heat to low and cover; simmer until water is absorbed, about 15 minutes. Cool rice. Mix onions and half of dressing into rice. Season with salt and pepper.", "Combine black beans, all peppers, cilantro, chipotle chilies, and remaining dressing in medium bowl. Toss to coat. Season with salt and pepper.", "Mound bean mixture in center of platter. Surround with rice salad."]}}