{"Za’atar chicken with chickpeas and garlic yoghurt": {"ingredients": ["3 tbsp za’atar", "6 tbsp olive oil", "4 chicken thighs ", "2 tbsp sesame seeds", "2 x 400g tins chickpeas, drained and rinsed", "6 garlic cloves, peeled", "250ml/9fl oz thick plain yoghurt ", "20 small mint leaves"], "instructions": ["Preheat the oven to 220C/200C Fan/Gas 7.", "Mix the za’atar with the oil in a small bowl.", "Put the chicken in a deep roasting tray, brush with the za’atar glaze and scatter over the sesame seeds. Add the chickpeas and garlic and bake for 30–40 minutes.", "Remove the tray from the oven, take the garlic out and set aside. Brush the chicken with the za’atar oil that has gathered at the bottom of the tray.", "Return the chicken to the oven for a further 15–20 minutes.", "Pound the roasted garlic into a paste using a mortar and pestle. Scrape the garlic paste into a bowl, then mix in the yoghurt.", "Serve the chicken on bed of chickpeas, with the garlic yoghurt drizzled over and the mint leaves scattered on top."]}, "Zoe’s jollof ": {"ingredients": ["8 bone-in chicken thighs or drumsticks", "1 large onion, roughly chopped", "1 Scotch bonnet chilli, de-seeded, finely chopped", "1 tbsp fresh or dried thyme leaves", "2 tbsp crayfish powder (available from online specialists)", "6 Guinea peppers (also known as grains of paradise), crushed", "6 large tomatoes, roughly chopped", "200g/7oz tomato purée", "1 tsp salt", "4 tbsp peanut oil or sunflower oil ", "1 large onion, finely chopped", "2 garlic cloves, crushed", "1 tsp ground hot chilli powder", "300g/10½oz long-grain white rice, washed and drained", "handful chopped fresh parsley and coriander, to garnish "], "instructions": ["Preheat the oven to 180C/160C fan/Gas 4.", "For the broth, heat a deep-sided, heavy-based casserole or saucepan over a low heat. Add all of the broth ingredients, then pour in just enough water to cover them and bring to the boil. Reduce the heat until the mixture is simmering, then simmer for 18-20 minutes, or until the chicken is tender and cooked through. (The chicken is cooked through if the juices run clear when a skewer is inserted into the thickest part and no traces of pink remain.)", "Remove the cooked chicken from the casserole and transfer to a baking tray. Cover with aluminium foil and keep warm.", "Strain the broth, collecting the strained liquid in a large jug. Set aside and keep warm.", "For the tomato sauce, blend the chopped tomatoes, tomato purée and salt to a smooth purée in a food processor. Set aside.", "For the jollof sauce, heat the oil in a lidded saucepan over a medium heat. Add the onion and fry for 4-5 minutes, or until softened. ", "Add the garlic and chilli powder and continue to fry for a further 4-5 minutes, stirring well. Stir in the tomato sauce and the reserved broth until well combined.", "Add the rice and stir to coat it in the sauce. Reduce the heat until the mixture is just simmering, cover the pan with a sheet of aluminium foil, then place the lid on top. Simmer for 30 minutes, or until the rice is tender and has absorbed all the liquid. ", "Halfway through cooking the jollof rice, finish the chicken. Remove the foil from the chicken and roast in the oven for 15 minutes, or until browned and sticky. ", "Serve the jollof rice with the chicken, garnished with a sprinkling of chopped parsley and coriander."]}, "Zanzibar chicken": {"ingredients": ["2 tbsp groundnut oil", "1 large chicken, jointed into 8 pieces, skin on", "2 onions, finely chopped", "3 garlic cloves, crushed ", "2 green chillies, chopped", "3 green or red tomatoes, finely chopped", "½ tsp ground turmeric", "½ tsp cumin seeds", "½ tsp coriander seeds", "4 green cardamom pods", "2 limes, juice only", "275ml/½ pint chicken stock", "2 x 400ml/14fl oz cans coconut milk", "1 bunch basil", "cooked basmati rice, to serve"], "instructions": ["Heat a deep-sided frying pan until hot and add the oil and then the chicken.", "Fry on each side for about one minute, until the meat is browned all over. Remove the meat from the pan and set aside on a plate.", "Add the onions, garlic, one of the chillies and the green (or red) tomatoes and cook for about five minutes.", "Meanwhile, place the turmeric, cumin seeds, coriander seeds and cardamom pods into a pestle and mortar and grind until fine.", "Add the ground spices to the onion and tomato mixture. Add the lime juice.", "Add the chicken stock and coconut milk to the pan and bring to the boil.", "Return the chicken to the pan and simmer for 20 minutes, until the chicken is cooked through.", "Place the remaining chilli and the basil into the pestle and mortar and grind to a paste.", "Add the chilli and basil paste to the chicken at the last minute and season to taste. ", "Serve hot with basmati rice."]}, "Za’atar cod with relish ": {"ingredients": ["2 heaped tbsp Za’atar ", "4 tbsp olive oil, plus extra for frying", "400g/14oz prime cod fillet or loin (or a different firm white fish), cut in to 4 pieces", "sea salt", "24 Kalamata olives, stones removed", "6 preserved lemons, halved and roughly chopped", "8 pickled chillies, thinly sliced", "1 small bunch of coriander, roughly chopped", "olive oil "], "instructions": ["Mix the za’atar with the olive oil in a small bowl to create a paste. Smear this paste over the cod pieces, ensuring they are well coated. Season each piece of fish with a pinch of salt. Place in a non-reactive container and leave to marinade in the fridge for 30 minutes.", "For the relish, place all the ingredients in a bowl and mix well. Do not season the mixture with salt as it will already have a salty taste. ", "Heat a large frying pan over a medium heat, then drizzle in a generous amount of olive oil. ", "Fry the cod for about 8 minutes on one side and 3-4 minutes on the other side. The cod should be golden-brown with a nice spice crusting. ", "Serve the cod with a generous helping of the relish."]}, "Zesty chilli tiger prawns": {"ingredients": ["2 tbsp groundnut oil or vegetable oil", "5 garlic cloves, finely chopped", "1 red chilli, finely chopped", "200g/7oz raw tiger prawns, shelled and de-veined ", "1 tbsp Shaoxing rice wine or dry sherry", "1 lime, juice only", "75g/3oz French beans, topped and tailed, chopped into 1cm/½in pieces", "pinch sea salt", "1 tsp dried chilli flakes"], "instructions": ["Heat a wok until smoking and add the groundnut oil, then add the garlic and chilli and stir fry for a few seconds. Add the prawns, rice wine and lime juice and stir fry for 2-3 minutes, or until the prawns start to turn pink. ", "Add the French beans and stir fry for another 2-3 minutes, or until the prawns are cooked through. Season, to taste, with the salt and chilli flakes.", "Pile the chilli prawns onto a serving plate and serve immediately."]}, "Zombie punch": {"ingredients": ["10 tbsp dark brown sugar", "300ml/10½fl oz lemon juice", "300ml/10½fl oz white rum ", "300ml/10½fl oz gold rum ", "300ml/10½fl oz demerara rum (preferably 151 proof) ", "300ml/10½fl oz pineapple juice", "300ml/10½fl oz lime juice ", "300ml/10½fl oz passion fruit syrup ", "8-10 dashes bitters", "1 pineapple", "1 large pumpkin, top removed and flesh and seeds carved out and discarded, optional", "1 lemon, cut into eight pieces", "1 lime, cut into eight pieces"], "instructions": ["Place the brown sugar and the lemon juice into a jug and stir to dissolve. ", "Place the lemon mixture and all the other ingredients into a large bowl and stir well. ", "Either serve the punch in the bowl or pour into the hollowed-out pumpkin. Add the lemon and lime pieces and serve."]}, "Zingy citrus Madeira cake": {"ingredients": ["150g/5½oz caster sugar", "150g/5½oz unsalted butter, plus extra for greasing ", "3 free-range eggs", "200g/7oz self-raising flour, plus extra for dusting ", "pinch salt", "2 oranges, finely grated zest only", "1 large unwaxed lemon, finely grated zest only", "1 large orange, rind and juice only", "1 large unwaxed lemon, rind and juice only", "75g/2½oz caster sugar", "150g/5½oz icing sugar"], "instructions": ["Preheat the oven to 180C/165C Fan/Gas 4. Grease a 900g/2lb loaf tin with butter and line with baking parchment. ", "In a bowl, cream the sugar and butter until pale and fluffy.  Add eggs one at a time, beating between each addition. Fold in the flour, a pinch of salt and the citrus zests. ", "Pour the batter into the prepared tin, smooth the surface and bake for 1 hour. Check the cake after 40 minutes, if it is starting to brown too much cover with aluminium foil for the remaining cooking time. The cake is cooked when a skewer inserted into the centre comes out clean.", "Leave the cake to cool in the tin while you make the sugar syrup.", "To decorate, cut the lemon and orange rind into very thin strips. Add 100ml/3½fl oz water and the caster sugar to a saucepan over a low heat, stir gently until the sugar is dissolved. Bring to the boil then add the rind to the pan, reserve a few strips of rind for decoration. Cook for about 5 minutes until a syrup forms and the rind is translucent. ", "Brush the syrup over the still-warm cake and set aside to cool completely. When the cake is completely cold, remove it from the tin. ", "To make the icing, mix the citrus juices. Mix the icing sugar with enough juice to make a thin icing. Drizzle the icing over the cooled cake and finish with a few thin strips of citrus rind."]}, "Zabaglione al Prosecco": {"ingredients": ["8 free-range egg yolks", "100g/3½oz caster sugar", "175ml/6fl oz Prosecco"], "instructions": ["Place a heatproof bowl over a pan of barely simmering water and place the egg yolks and sugar into it. Make sure the base of the bowl does not touch the simmering water.", "Using an electric whisk, start whisking the egg yolks and sugar in the bowl over the simmering water. The mixture will become pale and thick like whipped double cream, and it should triple in volume and be very frothy. This could take up to 15 minutes but it's worth the wait.", "Continue whisking and slowly pour in the Prosecco.", "Pour the zabaglione into eight dessert glasses and serve immediately."]}, "Zesty mango salsa with Italian poached meringue": {"ingredients": ["1 large mango (firm but ripe), peeled, stone removed, flesh cut in half lengthways", "2 limes, juice and zest", "1 small bunch fresh mint leaves, finely chopped (reserve a few small whole leaves to garnish)", "1 vanilla pod, seeds only (see below)", "200g/7oz caster sugar", "200ml/7fl oz cold water", "2 tbsp liquid glucose", "5 free-range egg whites", "400ml/14fl oz milk", "1 vanilla pod, pod only (see above)", "jalebi sweets, to serve (available from Indian supermarkets, optional)"], "instructions": ["Roughly chop one half of the mango and blend to a purée with the lime juice in a food processor.", "Finely dice the remaining mango half and place into a mixing bowl. Add the chopped mint, lime zest and vanilla seeds and mix well. Pour over the mango purée and mix again.", "For the poached meringue, in a small pan, dissolve the sugar in the water and liquid glucose, then gradually bring to the boil. As soon as the mixture is boiling, reduce the heat to low.", "Pass a clean pastry brush around the insides of the pan to remove any sugar crystals that have formed.", "Heat the sugar mixture to 115C/239F using a sugar thermometer (this is called the softball stage and should take 10-15 minutes). (Caution: do not overheat the sugar mixture and do not leave it unattended.)", "Meanwhile, whisk the egg whites in a clean, grease-free bowl until soft peaks form when the whisk is removed.", "Increase the speed of the beaters and, with the motor constantly running, pour a thin stream of the hot sugar mixture into the whisked egg whites, whisking as you pour. Once all of the sugar mixture has been added to the egg whites, continue to whisk the meringue mixture for 10-15 minutes, until it is thick, glossy and cold.", "Bring the milk and the vanilla pod to the boil in a saucepan, then reduce the heat to a gentle simmer.", "Make a quenelle of meringue mixture by creating a ball of meringue using two dessert spoons to smooth it into shape.", "Lower the quenelle of meringue into the simmering milk and poach gently for 2-3 minutes. Turn over and poach the other side for a further 1-2 minutes, then remove the poached meringue from the milk using a slotted spoon and set aside. Keep warm. Repeat the process with the remaining meringue mixture, cooking the quenelles in batches.", "To serve, divide the mango salsa among four dessert dishes. Float the poached merigues on top. Garnish with a jalebi sweet, if using."]}, "Zafrani Murgh Curry": {"ingredients": ["Chicken 500 gm", "Yogurt 1/2 cup", "Cream 3 tbsp", "Lemon juice 2 tsp", "Saffron strands 1/4 tsp", "Red chili powder 1 tsp", "Cumin powder 1 tsp", "Coriander powder 1tsp", "Salt to taste", "All spice powder 1/4 tsp", "Coriander leaves (chopped) for garnish"], "instructions": ["<strongMethod:</strong<br /In a small bowl, to the saffron strands, add a teaspoon of water and let it sit for about 5 minutes to soak", "In a mixing bowl, whisk together lemon juice, cream and yogurt with a fork till combined", "Save a tablespoon of cream for garnishing finally", "Also add cumin powder, coriander powder, red chili powder, salt to the bowl", "Now add the chicken pieces to the yogurt and spices mixture, mix well with fingers such that all the chicken pieces are coated well", "Also add the soaked saffron with its water and give a mix", "Keep the chicken to marinate in the freezer for at least 1-2 hours", "Transfer the marinated chicken in a non stick pan along with yogurt and heat on medium flame with the lid closed", "Cook on low-medium heat till the chicken is done and cooked to tender", "Once the chicken is cooked completely, transfer to a serving bowl, add the reserved fresh cream and saffron strands", "Garnish with coriander, sprinkle the all spice powder and serve."]}, "Zafrani Kofta Pulao": {"ingredients": ["Chicken mince 400gm", "Chopped onion 1", "Ginger garlic paste 1tbsp", "White pepper powder 1tsp", "Chopped green chilli 4-5", "Salt as required", "Chickpea (ground) 1tbsp", "Green cardamom 3/4tsp", "Oil 1/2cup", "Bread slice 1", "Basmati rice 1/2kg", "Oil 1/2cup", "Ginger garlic paste 1tbsp", "White pepper 1 tbsp", "Salt as per taste", "Chopped onion 1", "Saffron 1/2tsp", "Milk 2tbsp", "Rose water 2tbsp", "Yogurt 1/2cup", "Fried onion for garnish", "Whole all spice 1tbsp"], "instructions": ["<strongMethod:</strong"]}, "Zafrani Gosht Pulao": {"ingredients": ["Mutton 750 gm", "Oil Â½ cup", "Brown onion 1 cup", "Tomato finely chopped 4", "Ginger garlic 1 tbsp heaped", "Chili powder 2 tsp", "Allspice 1 tsp", "Salt 1 Â½ tsp", "Honey 1 tbsp", "Oil Â¼ cup", "Cumin seeds Â½ tsp", "Green cardamom 2", "Cinnamon 2 inch stick", "Onion sliced Â½ cup", "Salt 2 tsp", "Rice soaked Â½ kg", "Saffron soaked in milk Â½ tsp", "Water 7-8 cups", "Eggs boiled 2", "Fried potato wedges as required", "Coriander leaves chopped 3tbsp", "Mint leaves chopped 2 tbsp", "Brown onion 2 tbsp"], "instructions": ["<strongTo serve:</strong<br /First put a layer of rice on serving platter, top this layer with the mutton gravy, garnish with fried onion, mint and coriander with boiled egg wedges and potato fried wedges."]}, "Zafrani Khoya Kheer": {"ingredients": ["Milk 1-1/2 liter", "Boiled rice 1 cup", "Sugar 1 cup", "Whole dried milk 1 cup", "Saffron 2 pinch", "Almonds, pistachios as required", "Sterling silver leaf as required"], "instructions": ["<strongMethod:</strong<br /Add boiled rice in milk and cook until they got mix well", "Now add sugar, saffron and whole dried milk and cook until it gets thick", "Then take out prepared kheer in sand pots and garnish with almonds, pistachios and sterling silver leaf."]}, "Zeeray Walay Chawal": {"ingredients": ["Rice (soaked) Â Â  Â Â Â  Â Â Â  Â  Â½ kg", "OnionÂ Â  Â Â Â  Â Â Â  Â Â Â  Â  1", "Button Red ChiliesÂ Â  Â Â Â  Â Â  10", "Ginger, Garlic Paste Â Â Â  Â Â Â  2 tsp", "SaltÂ Â  Â Â Â  Â Â Â  Â Â Â  Â Â Â  Â 1 tsp", "Turmeric PowderÂ Â  Â Â Â  Â Â Â  Â 1 tsp", "Curry LeavesÂ  Â Â Â  Â Â Â  Â Â Â  Â 6", "Cumin Seeds (roasted) Â  2 tbsp", "Oil Â Â  Â Â Â  Â Â Â  Â Â Â  Â 4 tbsp"], "instructions": ["Â In a pan, heat oil and fry the onion."]}, "Zafrani Chai": {"ingredients": ["Water 1cup", "Milk 1cup", "Evaporated milk Â½ cup", "Condensed milk Â½ cup", "Cardamom 4-5", "Saffron 2-3 strands", "Tea leaves 2tsp"], "instructions": ["<strongMethod:</strong<br /Boil water add all three milks and all ingredients except saffron strands cook till boil lastly add strands and pour in cups and serve ."]}, "Zafrani Kheer": {"ingredients": ["Milk 2 Â½ kg", "Rice Â½ cup heaved", "Sugar 1 Â½ cup", "Cardamom Powder 1 tsp", "Saffron Â½ tsp", "Almonds & Pistachio (blanched & grinded) Â½ cup"], "instructions": ["125 gm Rice soaked for 2 hours dry and coarsely ground."]}, "Zafrani Sawaiyan": {"ingredients": ["Vermicelli 1 packet", "Milk 3 cups", "Sugar Â½ cup", "Cardamom powder Â½ tsp", "Yellow food colour Â¼ tsp", "Saffron as required", "Clarified butter 1 cup", "Almond, pistachios and coconut as required", "Sterling Silver paper 1", "Whole dried milk 125 grams"], "instructions": ["<strongMethod:</strong<br /Roasted Vermicelli in clarified butter then add milk and sugar now yellow colour add and 2 to 3 time boil then covered it .after this cardamom and saffron when milk dried then silver paper apply finally add whole dried milk , Almond, pistachios and coconut mix and serve hot ."]}, "Zeera Aloo ka Salan": {"ingredients": ["Potato cubes 1 cup", "Oil Â¼ cup", "Garlic chopped 1 tbsp", "Whole red chili 5 -6", "Curry leaves 8 -10", "Tomato chopped 1", "Cumin 1 tbsp", "Salt as required", "Turmeric Â½ tsp", "Red chili crushed 1 tsp", "Green chili big julienne 3 -4", "Fresh coriander chopped for garnish"], "instructions": ["<strongMethod:</strong<br /Prawns wash well then add ginger garlic and green chilies grind .then add 2 tbsp mix in prawns and salt ,lemon juice ,red chili powder ,turmeric and tamarind paste add and marinate .now in a pan heat oil and fry garlic cloves ,chopped onion cook till than brown .after this add remaining mixture and marinated prawn add and cook 10 to 15 minutes .then add coriander powder and all spices add and cook for 2 minutes .finally garnish with green coriander and serve ."]}, "Zarda": {"ingredients": ["Rice 700 gm", "Sugar 2 cups", "Green cardamoms 10", "Cloves 6", "Milk 1/4 cup", "Coconut crushed 100 gm", "Coconut slices 50 gm", "Dry dates 100 gm", "Ashrafi (green & red) 100 gm", "Raisins 50 gm", "Yellow food color 1 tsp", "Clarified butter 1/4 cup", "Whole dried milk 100 gm", "Oil 3 tbsp"], "instructions": ["<strongMethod:</strong<br /Soak rice in water for one hour, in a pan add water, food color, 50g dry dates, 5 cardamoms and boil rice until 70% done", "In a pan heat clarified butter, add cloves, 5 green cardamoms and cook for a minute", "Then add half cooked rice, sprinkle one cup sugar and repeat the layer", "Steam for 5 minutes on low heat", "Mix well add ashrafi, grapes, raisins, whole dried milk, 50g dry dates, coconut slices, coconut crushed, drizzle milk and steam again for 5 minutes."]}, "Zaatar Manakish": {"ingredients": ["All purpose flour 2 cups", "Yeast 1 tbsp", "Sugar 1 tbsp", "Lukewarm water 1 cup", "Salt 1 tsp", "Olive oil 1/2 cup", "Sumac 1 tbsp", "Dried thyme leaves 1 tbsp", "Dried oregano 1 tbsp", "Sesame seeds 1 tbsp", "Salt to taste"], "instructions": ["Place the prepared manakish one at a time on a baking sheet and bake in pre heated over at 180 degrees C for about 8 to 10 minutes each, once you see the base turning slightly brown", "Serve Manakish/"]}, "Zeera Aalu": {"ingredients": ["Potatoes Â½ kg pealed cubed and boiled", "Zeera seeds 1 tbsp", "Oil Â¼ cup", "Crushed red pepper 2 tsp heaved", "Khatai powder 1 tsp heaved", "Green chilies 3 cut horizontally", "Salt 1 tsp heaved", "Coriander leaves 3 tbsp chopped", "Crushed coriander 1 tbsp"], "instructions": ["Heat oil in a pan add cumin seeds."]}, "Za’atar Fish and Chips": {"ingredients": ["1 small red onion, finely chopped", "4 Tbsp. apple cider vinegar, divided", "Kosher salt", "1½ lb. small Yukon Gold potatoes, halved or quartered lengthwise", "6 Tbsp. extra-virgin olive oil, divided", "1 1¼-lb. skinless, boneless cod fillet, preferably in 1 piece", "1 Tbsp. za’atar", "¾ cup pitted Castelvetrano olives", "½ cup coarsely chopped mint", "Za’atar, a blend of sumac, dried herbs, and sesame seeds, can be found at Middle Eastern markets, specialty foods stores, and online."], "instructions": ["Place racks in upper and lower thirds of oven; preheat oven to 425°. Mix onion, 2 Tbsp. vinegar, and a big pinch of salt in a small bowl to combine; let sit at least 10 minutes and up to 1 hour. Drain off vinegar and discard.", "Meanwhile, toss potatoes and 3 Tbsp. oil on a large rimmed baking sheet; season with salt, then toss again. Arrange in a single layer. Roast on top rack, undisturbed, until browned and crisp underneath, 20–25 minutes. Turn potatoes over and reduce oven temperature to 325°. Place cod on a small rimmed baking sheet and drizzle with 1 Tbsp. oil. Season with salt and sprinkle with za’atar. Slide onto bottom rack in oven and roast until fish flakes easily with a fork and potatoes are browned all over, about 10 minutes.", "Stir olives, mint, remaining 2 Tbsp. vinegar, and remaining 2 Tbsp. oil into pickled onion. Serve cod and potatoes topped with olive mixture."]}, "Zucchini-Lentil Fritters ": {"ingredients": ["¾ cup whole-milk yogurt", "2 Tbsp. fresh lemon juice", "½ tsp. sugar", "Kosher salt", "1 cup red lentils (masoor dal)", "1 medium zucchini (about 5 oz.)", "½ medium onion, thinly sliced", "1¾ tsp. kosher salt, divided, plus more", "½ tsp. Kashmiri chile powder or ¼ tsp. cayenne pepper", "¼ tsp. ground turmeric", "1 cup parsley leaves with tender stems", "1 Tbsp. finely grated lemon zest", "1 cup ghee or neutral vegetable oil"], "instructions": ["Whisk yogurt, lemon juice, and sugar in a small bowl to combine. Season with salt and whisk again to combine.", "Do Ahead: Yogurt can be made 1 day ahead. Cover and chill.", "Rinse lentils, then soak in 2 cups water at room temperature at least 1 hour and up to 12. Soaking the lentils for this long will make them super-plump and tender, which in turn makes them a lot easier to blend.", "Meanwhile, trim ends of zucchini and cut crosswise into 3 pieces about 2\" long. Cut each piece lengthwise into ¼\"-thick planks. Stack a few planks and slice lengthwise into ¼\"-thick matchsticks (about the size of a skinny french fry). Transfer zucchini to a colander set in a medium bowl. Add onion and 1 tsp. salt to colander and toss to combine. Let zucchini and onion sit until about 1 Tbsp. liquid has released and the vegetables look wilted and soft, 30 minutes–2 hours (to maximize your downtime, do this while the lentils are soaking). Gently pat dry with paper towels to remove any excess moisture. The less moisture in the veggies, the less soggy your fritters will be, so be sure not to skip this step.", "Drain lentils and transfer to a food processor. Add chile powder, turmeric, and ¾ tsp. salt. Pulse, scraping down sides, until a purée forms. Transfer to a medium bowl and add zucchini and onion mixture, parsley, and lemon zest. Toss well with a rubber spatula to combine (it will look like too much vegetables for the lentils, but that’s just what you want).", "Heat ghee in a 10\" cast-iron skillet over medium-high until a small amount of batter added to the fat excitedly sizzles and sputters. Carefully drop ¼ cup batter into ghee, then flatten to a pancake with the back of a large metal spoon dipped into the hot ghee to prevent sticking. Repeat 3 times for a total of 4 fritters. Fry until deep golden brown on one side (look for the color of a well-fried falafel), about 3 minutes. Turn with a slotted spatula or large spoon and continue to fry until deep golden brown on the second side, about 3 minutes more. Transfer fritters to a wire rack set in a paper towel-lined baking sheet to drain. Season immediately with salt. Repeat with remaining batter (you should have 8–10 fritters).", "Transfer fritters to a platter. Serve hot with lemony yogurt alongside."]}, "Za’atar Chicken with Garlicky Yogurt": {"ingredients": ["4 chicken legs (thigh and drumstick; about 2½ lb. total)", "2 medium red onions, cut into 1\"-thick wedges", "2 heads of garlic, halved crosswise, plus 2 cloves", "1 lemon, quartered, seeds removed", "Kosher salt", "⅓ cup extra-virgin olive oil", "1½ cups plain whole-milk Greek yogurt", "3 Tbsp. za’atar", "1 tsp. ground coriander", "1 tsp. finely grated lemon zest", "1 tsp. finely grated lime zest", "Za’atar, a blend of sumac, dried herbs, and sesame seeds, can be found at Middle Eastern markets, specialty foods stores, and online."], "instructions": ["Preheat oven to 325°. Pat chicken legs dry with paper towels. Arrange chicken, onions, halved garlic heads, and lemon in a 13x9\" baking dish; season liberally with salt (remember to season both sides of chicken). Pour in oil and toss everything to coat. Turn garlic cut side down and nestle it in so it is in contact with the baking dish. Roast, rotating pan halfway through, until meat is almost falling off the bone, 50–60 minutes.", "Meanwhile, finely grate 1 garlic clove into a small bowl. Add yogurt, a big pinch of salt, and 1 Tbsp. water and mix well. Set aside yogurt sauce.", "Remove baking dish from oven and transfer onions, garlic, and lemon to a plate. Increase oven temperature to 425° and continue to roast chicken until skin is golden brown, 10–15 minutes more. Transfer chicken to a cutting board and let rest 10 minutes. Set aside pan with juices.", "Finely grate remaining garlic clove into another small bowl. Add za’atar, coriander, lemon zest, and lime zest. Pour reserved juices in pan into za’atar mixture until you’ve reached an oily consistency (about ⅓ cup). Mix in a pinch of salt.", "Spread reserved yogurt sauce over a platter and arrange chicken legs on top. Scatter onions, garlic, and lemon around; drizzle with za’atar oil."]}, "Zebra-Striped Shortbread Cookies": {"ingredients": ["2⅓ cups all-purpose flour, divided", "1½ tsp. kosher salt, divided", "⅓ cup Dutch-process cocoa powder", "1¼ cups (2½ sticks) unsalted butter, room temperature", "⅔ cup granulated sugar", "¼ cup powdered sugar", "1 large egg yolk", "1 tsp. vanilla extract or paste", "1 large egg, beaten to blend", "¼ cup sanding sugar (any color)"], "instructions": ["Whisk 1⅓ cups flour and ¾ tsp. salt in a medium bowl. Whisk cocoa powder, remaining 1 cup flour, and remaining ¾ tsp. salt in another medium bowl. These are the bases for your chocolate and vanilla doughs.", "Beat butter, granulated sugar, and powdered sugar in the bowl of a stand mixer on medium-high speed until light and fluffy, about 4 minutes. Add egg yolk and vanilla and beat until smooth. Divide mixture between the 2 bowls of dry ingredients (about 1 cup in each). Scrape vanilla mixture back into stand mixer bowl (save the mixing bowl) and beat on low speed just until combined. Return to reserved bowl. Repeat process with chocolate mixture.", "Arrange 2 large sheets of parchment paper on a work surface. Dollop one-quarter of chocolate dough in the center of each sheet and pat into rough 6x2\" rectangles. Dollop one-quarter of vanilla dough on top of each chocolate slab and pat into rectangles the same size and shape so that you have 2 layers each. Repeat entire process so you have 4 alternating layers. Tightly press stacked dough into cylinders about 1½\" wide and 8\" long, using the parchment to help you. Wrap logs in plastic wrap and chill until very firm, at least 2 hours.", "Place racks in upper and lower thirds of oven; preheat to 350°. Working one at a time, unwrap dough and brush with egg. Carefully sprinkle surface with sanding sugar and roll logs in sugar to coat well (really press dough into sugar so it sticks). Slice into rounds a generous ¼\" thick, rotating after every few cuts to keep slices round. Arrange cookies on parchment-lined baking sheets, spacing 2\" apart. Bake, rotating baking sheets top to bottom and front to back halfway through, until edges are just set, 12–14 minutes. Let cool on baking sheets.", "Do Ahead: Dough can be made 3 days ahead; keep chilled. Cookies can be baked 5 days ahead; store airtight at room temperature."]}, "Zucchini, Potato, and Fontina Pizzettas": {"ingredients": ["1 ¼-ounce envelope active dry yeast (about 2¼ teaspoons)", "Pinch of sugar", "3½ cups all-purpose flour, divided, plus more for surface", "2 teaspoons kosher salt, plus more", "6 tablespoons olive oil, divided, plus more", "2 small red waxy potatoes (about ½ pounds), scrubbed, very thinly sliced", "1 red onion, very thinly sliced", "1 medium zucchini, very thinly sliced", "4 ounces Fontina cheese, grated (about 1½ cups)", "Flaky sea salt", "Coarsely ground black pepper"], "instructions": ["Whisk yeast, sugar, and 3 Tbsp. warm water in a large bowl. Let sit until surface is foamy, about 5 minutes. Add 1¼ cups room-temperature water, then add 1 cup flour, whisking until smooth (mixture should be the consistency of pancake batter). Add 2½ cups flour and 2 tsp. kosher salt and mix with a wooden spoon until a shaggy dough forms.", "Turn out dough onto a lightly floured surface and knead with your hands, adding more flour as needed to prevent it from sticking, until dough is smooth and supple, 5–10 minutes (it will be very soft). Transfer to a large oiled bowl and cover with plastic wrap. Let rise in a warm, draft-free spot until doubled in size, 1–1½ hours.", "Divide dough into 4 equal pieces and form into balls. Place on an oiled rimmed baking sheet and cover with plastic wrap; let rise in a warm, draft-free spot until balls of dough are nearly doubled in size, 40–50 minutes.", "Meanwhile, place potato slices in a colander and rinse with cold water. Drain, season with kosher salt, and let sit, tossing occasionally, until softened, 10–15 minutes. Transfer to a bowl and toss with onion, zucchini, and 2 Tbsp. oil; set aside.", "Preheat oven to 450°. Working with 1 ball of dough at a time and keeping remaining dough covered while you work, roll out dough on a lightly floured surface into 10\" rounds.", "Heat a dry large cast-iron skillet over medium. Pour 1 Tbsp. oil into skillet and cook a dough round until bottom is golden brown and top looks dry, about 1 minute. Flip and cook just until bottom is lightly golden, about 1 minute. Transfer to a rimmed baking sheet and repeat with remaining 3 Tbsp. oil and rounds of dough (you should be able to fit two pizzettas per baking sheet if you overlap them slightly).", "Top pizzettas with Fontina cheese and reserved potato mixture; season with kosher salt. Bake, rotating baking sheets once top to bottom and back to front, until crusts are golden brown and crisp and cheese is bubbling, 10–15 minutes. Remove pizzettas from oven, season with sea salt and pepper, and drizzle with oil."]}, "Zucchini and Rice Pancakes": {"ingredients": ["3 tablespoons olive oil, divided", "1 garlic clove, finely chopped", "1 15-ounce can crushed tomatoes", "½ teaspoon dried oregano", "Kosher salt, freshly ground pepper", "1 small zucchini, thinly sliced", "½ cup cooked leftover rice or any other grain", "2 large eggs, beaten to blend"], "instructions": ["Heat 1 Tbsp. oil in a medium saucepan over medium. Add garlic and cook, stirring often, until fragrant, about 1 minute. Add tomatoes and oregano and cook, stirring occasionally, until reduced and slightly thickened, about 10 minutes. Transfer to a medium bowl and season with salt and pepper.", "Heat 1 Tbsp. oil in a small nonstick skillet over medium-high. Add zucchini, season with salt and pepper, and cook, tossing occasionally, until golden and tender, about 4 minutes. Add rice and remaining 1 Tbsp. oil. Cook, stirring occasionally, until rice is crisp, about 3 minutes. Reduce heat to medium and add eggs, tilting skillet to evenly distribute. Cook, undisturbed, until eggs are mostly set, about 1 minute. Invert pancake onto a plate, then slide back into skillet. Cook until golden brown on the second side, about 1 minute more. Let cool slightly before cutting into wedges. Serve with reserved tomato sauce for dipping.", "Do Ahead: Tomato sauce can be made up to 3 days ahead. Cover and chill."]}, "Zucchini-Herb Fritters with Garlic Yogurt": {"ingredients": ["½ cup plain yogurt (not Greek)", "2 tablespoons finely chopped fresh mint", "2 tablespoons fresh lemon juice", "2 tablespoons olive oil", "1 teaspoon honey", "1 garlic clove, finely grated", "Kosher salt and freshly ground black pepper", "2 small zucchini, ends trimmed", "1 small russet potato, peeled", "½ medium onion", "2 teaspoons kosher salt, plus more", "2 large eggs, beaten to blend", "1 garlic clove, finely grated", "½ teaspoon ground cumin", "3 tablespoons finely chopped fresh parsley, plus more for serving", "2 tablespoons finely chopped fresh mint, plus more for serving", "Freshly ground black pepper", "⅓ cup all-purpose flour", "½ teaspoon baking powder", "½ cup vegetable oil", "Olive oil (for serving)"], "instructions": ["Mix yogurt, mint, lemon juice, oil, honey, and garlic in a small bowl; season with salt and pepper. Cover; chill.", "Grate zucchini, potato, and onion on the large holes of a box grater. Transfer to a mesh sieve set over a bowl and toss with 2 tsp. salt. Let vegetables sit until they release their liquid, 30−40 minutes.", "Mix eggs, garlic, cumin, 3 Tbsp. parsley, and 2 Tbsp. mint in a medium bowl; season with salt and pepper. Gather up half of zucchini mixture in a kitchen towel; squeeze out excess liquid. Add to bowl with egg mixture and repeat with remaining zucchini mixture. Sprinkle flour and baking powder over; mix gently.", "Heat vegetable oil in a large skillet over medium-high. Working in batches, spoon scoops of mixture into skillet, flattening gently with a spatula. Cook until golden brown and crisp, about 3 minutes per side. Transfer to a wire rack; season with salt. Drizzle yogurt sauce with olive oil and top with more herbs; serve alongside warm fritters."]}, "Zucchini Bread with Oats": {"ingredients": ["Non-stick vegetable oil spray", "1 cup walnuts (optional)", "3 large eggs", "1 cup vegetable oil", "1¼ cups granulated sugar", "½ cup (packed) light brown sugar", "1 tablespoon vanilla extract", "3 cups all-purpose flour", "1½ teaspoons kosher salt", "1 teaspoon ground cinnamon", "1 teaspoon baking soda", "½ teaspoon baking powder", "¼ teaspoon freshly grated nutmeg", "3½ cups coarsely grated zucchini (from about 1 lb. zucchini)", "1¼ cups old-fashioned rolled oats, divided", "3 tablespoons raw sugar"], "instructions": ["Preheat oven to 350°. Spray two 8 1/2x4 1/2\" loaf pans with nonstick spray and line with parchment paper, leaving a generous overhang on long sides. If using, spread walnuts on a rimmed baking sheet and toast until slightly darkened and fragrant, 8–10 minutes; let cool, then coarsely chop.", "Whisk eggs, oil, granulated sugar, brown sugar, and vanilla in a large bowl until smooth. Whisk flour, salt, cinnamon, baking soda, baking powder, and nutmeg in another large bowl just to combine. Make a well in the center of dry ingredients, add egg mixture, and slowly incorporate dry ingredients with a fork (batter will look dry). Fold in zucchini, walnuts, and 1 cup oats. Scrape batter into prepared pans.", "Toss raw sugar and remaining 1/4 cup oats in a small bowl. Sprinkle over batter and bake until a tester inserted into the center comes out clean, 70–80 minutes. Transfer pans to a wire rack and let bread cool in pans 30 minutes; turn out bread onto rack and let cool completely.", "DO AHEAD: Bread can be baked 4 days ahead. Store tightly wrapped at room temperature."]}, "Zucchini Patties": {"ingredients": ["3 medium zucchini, coarsely grated", "1 medium onion, coarsely grated", "1 tablespoon kosher salt, plus more", "1 leek, white and pale-green parts only, finely chopped", "1 large egg, beaten to blend", "1/3 cup panko (Japanese breadcrumbs)", "2 tablespoons finely chopped fresh cilantro", "1 tablespoon finely chopped fresh thyme", "Freshly ground black pepper", "Vegetable oil (for frying; about 1½ cups)", "Roasted Red Pepper Labneh (click here for recipe)"], "instructions": ["Mix zucchini, onion, and 1 tablespoons salt in a medium bowl. Let sit 10 minutes, then wring out as much liquid as possible from zucchini and onion in a kitchen towel. Mix with leek, egg, panko, cilantro, and thyme in a clean medium bowl; season with pepper.", "Pour oil into a large skillet, preferably cast iron, to a depth of 1/2\" and heat over medium heat until oil bubbles when a pinch of zucchini mixture is added.", "Working in batches, drop spoonfuls of zucchini mixture into skillet and gently flatten with a spatula into 2\" patties. Cook until golden brown, about 3 minutes per side. Drain on paper towels; season with salt. Serve with Roasted Red Pepper Labneh.", "DO AHEAD: Patties can be made 30 minutes ahead. Keep warm in a 300 ° oven until ready to serve."]}, "Za’atar Roast Chicken with Green Tahini Sauce": {"ingredients": ["2 cloves garlic, smashed", "1 cup (lightly packed) flat-leaf parsley leaves with tender stems", "½ cup tahini", "¼ cup fresh lemon juice", "Kosher salt", "1 3½–4-lb. chicken, cut into quarters, or 2 large skin-on, bone-in chicken breasts and 2 skin-on, bone-in chicken legs", "2 medium red onions, thinly sliced", "2 cloves garlic smashed", "1 lemon, thinly sliced, seeds removed", "1 tablespoon ground sumac", "1½ teaspoon ground allspice", "1 teaspoon ground cinnamon", "1 cup low-sodium chicken broth or water", "¼ cup olive oil, plus more for drizzling", "Kosher salt and freshly ground black pepper", "2 tablespoons za’atar", "2 tablespoons unsalted butter", "¼ cup pine nuts", "6 pieces lavash or other flatbread", "Za’atar and sumac are available at Middle Eastern markets and specialty foods stores, and online."], "instructions": ["Pulse garlic, parsley, tahini, lemon juice, and ½ cup water in a food processor, adding more water if needed, until smooth (sauce should be the consistency of a thin mayonnaise); season with salt.", "DO AHEAD: Sauce can be made 1 day ahead. Cover and chill.", "Preheat oven to 400°. Toss chicken, onions, garlic, lemon, sumac, allspice, cinnamon, broth, and ¼ cup oil in a large resealable plastic bag; season with salt and pepper. Chill at least 2 hours.", "Place chicken, onions, garlic, and lemon on a rimmed baking sheet, spooning any remaining marinade over and around chicken. Sprinkle with za’atar and roast until chicken is browned and cooked through, 45–55 minutes.", "Meanwhile, melt butter in a small skillet over medium-high heat. Add pine nuts and cook, stirring often, until butter foams, then browns, and nuts are golden brown (be careful not to burn), about 4 minutes; season with salt.", "Slice chicken breasts, if desired. Serve chicken with roasted onion and lemon, topped with pine nuts, with green tahini sauce and lavash.", "DO AHEAD: Chicken can be marinated 1 day ahead. Keep chilled."]}, "Za’atar Pita Crisps": {"ingredients": ["4 pitas", "¼ cup olive oil", "2 tablespoons za'atar", "1 tablespoon fresh thyme leaves", "Kosher salt and freshly ground black pepper"], "instructions": ["Preheat oven to 400°. Split pitas and place on a rimmed baking sheet. Brush with oil and sprinkle with za’atar and thyme; season with salt and pepper. Bake until golden brown and crisp, 10–12 minutes. Let cool, then break into bite-size pieces."]}, "Zucchini Fritters": {"ingredients": ["Canola oil (for deep-frying)", "", "1 3/4 cups all purpose flour", "1/4 cup cornstarch", "1 tablespoon baking powder", "1 teaspoon salt", "2 cups chilled stout or dark beer", "4 medium zucchini, cut diagonally into 1/4-inch-thick slices", "12 zucchini blossoms"], "instructions": ["Pour enough oil into heavy large saucepan to measure 3 inches in depth. Heat oil over medium heat until deep-fry thermometer registers 350°F.", "Mix flour, cornstarch, baking powder and salt in large bowl. Add stout. Whisk until smooth batter forms. Working in batches of 5 or 6 zucchini slices or blossoms and using tongs, dip zucchini slices and blossoms into batter and add to hot oil. Cook until golden brown, about 2 minutes per side. Using slotted spoon, transfer fritters to paper towels and drain. Sprinkle fritters with salt and serve."]}, "Zingy Red Sauce": {"ingredients": ["2 garlic cloves", "½ cup chopped roasted red peppers from a jar (about 2)", "½ cup unsalted, roasted almonds", "2 tablespoons red wine vinegar, plus more", "¼ cup olive oil", "Kosher salt; freshly ground pepper"], "instructions": ["Purée garlic, red peppers, almonds, and vinegar in a food processor until smooth. With motor running, add oil and process until smooth; season with salt, pepper, and more vinegar, if desired.", "Do Ahead: Sauce can be made 2 days ahead. Cover and chill."]}, "Zucchini with Potatoes and Thyme": {"ingredients": ["4 tablespoons extra-virgin olive oil, divided", "1 1/2 pounds waxy potatoes (such as Yukon Gold), peeled, cut into 3/4' cubes", "3 garlic cloves, quartered", "Sea salt and freshly ground black pepper", "2 tablespoons fresh thyme leaves", "1 1/2 pounds zucchini, cut into 1/2 ' cubes"], "instructions": ["Heat 3 Tbsp. oil in a large heavy skillet over medium-high heat. Combine potatoes and garlic in a large bowl; season with salt and pepper. Add potato mixture to hot skillet. Without stirring or moving pan, cook potatoes until light golden brown on one side (this will prevent sticking), 3–4 minutes. Using a spatula, toss potatoes and cook until light golden brown on all sides and cooked through, 8–10 minutes longer.", "Add thyme; toss to coat. Transfer potatoes to a large bowl; set aside.", "Heat remaining 1 Tbsp. oil in same skillet. Add zucchini and season with salt and pepper. Cook until light golden brown and tender but not mushy, 5–6 minutes. Add to bowl with potatoes and toss to combine. Season to taste with salt and pepper. Serve warm or at room temperature."]}, "Zucchini Dill Pickles ": {"ingredients": ["2 pounds small zucchini (preferably about 4 or 8 inches long), trimmed", "4 tablespoons coarse sea salt or pickling salt, divided", "12 fresh dill sprigs", "2 teaspoons yellow or brown mustard seeds", "1 teaspoon coriander seeds", "1 teaspoon dill seeds", "1/4 teaspoon saffron threads", "4 garlic cloves, halved", "4 red jalapeños or Fresno chiles, split lengthwise", "2 1/2 cups white wine vinegar", "1/4 cup sugar"], "instructions": ["If using 4 inch zucchini, halve lengthwise. If using 8 inch zucchini, halve crosswise, then quarter lengthwise. Place in a large bowl. Add 2 Tbsp. salt and 4 cups ice. Add cold water to cover. Top with a plate to keep submerged. Let sit for 2 hours. Drain; rinse.", "Divide dill sprigs and next 6 ingredients between 2 clean, hot 1-quart jars; set aside.", "Bring vinegar, sugar, remaining 2 tablespoons salt, and 1 1/4 cups water to a boil in a large saucepan. Working in batches, add zucchini and cook, stirring occasionally, until khaki in color and slightly pliable, about 2 minutes. Using tongs, transfer zucchini to jars.", "Divide hot syrup between jars to cover zucchini, leaving 1/2 inch space on top. Wipe rims, seal, and process in boiling water bath for 10 minutes. Allow at least a week to pickle before eating."]}, "Zucchini Cornbread": {"ingredients": ["1/2 cup (1 stick) unsalted butter plus more for pan", "2 large eggs, lightly beaten", "1/2 cup buttermilk", "1 large zucchini (about 10 ounces)", "1 cup all-purpose flour", "1/2 cup whole wheat flour", "1/2 cup sugar", "1 teaspoon baking powder", "3/4 teaspoon fine sea salt", "1/2 teaspoon baking soda", "3/4 cup medium-grind cornmeal"], "instructions": ["Position a rack in the middle of oven and preheat to 350°. Butter a 9 x 5 x 3\" loaf pan.", "Melt 1/2 cup butter in a small saucepan over medium-high heat. Continue cooking until butter solids at bottom of pan turn golden brown, about 3 minutes. Scrape butter into a medium bowl. Set aside and let cool. Whisk in eggs and buttermilk.", "Trim zucchini ends. Thinly slice five 1/8\" rounds from 1 end of zucchini and reserve for garnish. Coarsely grate remaining zucchini. Add to bowl with butter mixture and stir until well blended.", "Sift both flours, sugar, baking powder, salt, and baking soda into a large bowl. Whisk in cornmeal. Add zucchini mixture; fold just to blend (mixture will be very thick). Transfer batter to prepared pan and smooth top. Place reserved zucchini slices atop batter down center in a single layer.", "Bake bread until golden and a tester inserted into center comes out clean, 55-65 minutes. Let cool in pan 10 minutes. Remove from pan; let cool completely on a wire rack. DO AHEAD Can be made 1 day ahead. Store airtight at room temperature."]}, "Za'atar": {"ingredients": ["1 tablespoon chopped fresh oregano", "1 tablespoon sumac", "1 tablespoon ground cumin", "1 tablespoon sesame seeds", "1 teaspoon kosher salt", "1 teaspoon freshly ground black pepper"], "instructions": ["Combine chopped fresh oregano, sumac, ground cumin, and sesame seeds. Stir in kosher salt and freshly ground black pepper. DO AHEAD Can be made 2 weeks ahead. Store airtight at room temperature."]}, "Zucchini Keftedes with Feta and Dill": {"ingredients": ["1 1/3 pounds medium zucchini, trimmed", "1 teaspoon coarse kosher salt", "1/2 cup thinly sliced green onions", "3 tablespoons chopped fresh dill", "3 tablespoons chopped fresh mint", "2 garlic cloves, minced", "1 teaspoon finely grated lemon peel", "1 cup panko (Japanese breadcrumbs)", "1 large egg, beaten to blend", "1 cup coarsely crumbled feta cheese", "Canola oil (for frying)", "Plain whole-milk or reduced-fat Greek-style yogurt (for garnish)", "Additional chopped fresh dill (for garnish)"], "instructions": ["Grate zucchini on large holes of box grater onto clean kitchen towel. Sprinkle zucchini with 1 teaspoon coarse salt; let stand at least 30 minutes and up to 1 hour.", "Line rimmed baking sheet with parchment or foil. Wrap zucchini in towel; squeeze out as much liquid as possible. Place zucchini in medium bowl. Mix in green onions, 3 tablespoons chopped dill, mint, garlic, lemon peel, and 1/2 teaspoon black pepper. Gently stir in panko and egg, then feta. Using 2 tablespoons zucchini mixture for each, shape mixture into 1 3/4- to 2-inch-diameter patty; place on baking sheet. Chill at least 1 hour. DO AHEAD Can be made 4 hours ahead. Keep chilled.", "Pour enough canola oil into heavy large skillet to reach depth of 1/4 inch; heat over medium-high heat. Working in batches, add patties to skillet. Cook until golden and cooked through, adjusting heat if browning too quickly, 3 to 4 minutes per side. Using slotted metal spoon, transfer to paper towels.", "Arrange keftedes on platter. Top each with dollop of yogurt. Sprinkle each with dill. Serve warm or at room temperature."]}, "Ziti with Roasted Zucchini": {"ingredients": ["2 pounds medium zucchini, trimmed, cut into 1/4-inch-thick rounds", "12 garlic cloves, peeled, halved", "8 large shallots, halved, thinly sliced", "7 tablespoons olive oil, divided", "1/2 teaspoon dried crushed red pepper", "2 1-pound boxes ziti, cooked, drained, 3/4 cup cooking liquid reserved", "1 cup chopped fresh basil, divided", "3/4 cup grated Pecorino Romano cheese"], "instructions": ["Preheat oven to 400°F. Toss zucchini, garlic, shallots, 5 tablespoons oil, and crushed red pepper in bowl. Spread on 2 large rimmed baking sheets; sprinkle with salt and pepper. Roast vegetables until tender, turning occasionally, 30 to 35 minutes.", "Toss cooked pasta in large bowl with 1 tablespoon oil. Transfer half of pasta (8 cups) to another bowl; cool, stirring occasionally. Cover; chill (reserve for mac and cheese).", "Place remaining pasta in large pot. Add roasted vegetables, 1/4 cup pasta cooking liquid, and 1 tablespoon oil; stir over medium heat until heated through. Add 3/4 cup basil and cheese. Toss, adding reserved cooking liquid by tablespoonfuls to moisten if dry. Season with salt and pepper. Transfer pasta to large platter. Sprinkle pasta with remaining 1/4 cup basil."]}, "Zucchini-Pecan Cake with Cream Cheese Frosting": {"ingredients": ["Nonstick vegetable oil spray", "1 1/2 cups all purpose flour", "1 1/2 teaspoons baking powder", "1 teaspoon coarse kosher salt", "1 teaspoon ground cinnamon", "1/2 teaspoon ground ginger", "1/4 teaspoon ground nutmeg", "3/4 cup olive oil (not extra-virgin)", "1 cup (packed) golden brown sugar", "3 large eggs", "1 teaspoon vanilla extract", "1 1/2 cups coarsely grated zucchini (about 8 ounces)", "3/4 cup chopped pecans", "1/2 8-ounce package Philadelphia-brand cream cheese (do not use reduced-fat or fat-free), room temperature", "3 tablespoons unsalted butter, room temperature", "3/4 cup powdered sugar", "1/2 teaspoon vanilla extract", "1/2 teaspoon ground cinnamon"], "instructions": ["Position rack in center of oven and preheat to 350°F. Line 9-inch-diameter cake pan with 2-inch-high sides with parchment paper. Coat parchment paper with nonstick spray.", "Whisk flour, baking powder, coarse salt, cinnamon, ginger, and nutmeg in medium bowl to blend well. Whisk oil, sugar, eggs, and vanilla in large bowl to blend well; fold in flour mixture, then grated zucchini and pecans. Transfer cake batter to prepared pan.", "Bake cake until tester inserted into center comes out clean, about 45 minutes. Cool cake completely in pan on rack, about 1 hour. Cut around sides of pan to loosen. Turn cake out onto platter; peel off parchment paper.", "Using electric mixer, beat cream cheese and butter in medium bowl until blended. Beat in sugar, vanilla, and cinnamon. Spread frosting thickly over top of cake. DO AHEAD Can be made 1 day ahead. Cover and chill.", "Cut cake into wedges and serve."]}, "Zucchini Cakes with Smoked Trout": {"ingredients": ["1 pound zucchini, trimmed, coarsely grated in processor", "1 teaspoon salt", "1/4 cup all purpose flour", "2 tablespoons finely grated Parmesan cheese", "2 tablespoons minced shallot", "1 large egg plus 1 large egg white, beaten to blend", "1/2 teaspoon freshly ground black pepper", "Canola oil (for frying)", "1/3 cup (about) sour cream", "2 ounces smoked trout or smoked salmon, broken into 1x1/2-inch pieces", "Chopped fresh dill"], "instructions": ["Place zucchini in colander set over bowl; sprinkle with salt and toss to coat. Place small plate atop zucchini to weigh down. Let stand 30 minutes to drain.", "Squeeze zucchini as dry as possible in kitchen towel. Transfer zucchini to medium bowl. Stir in flour, Parmesan, and shallot, then stir in beaten egg mixture and pepper.", "Line large rimmed baking sheet with parchment paper. Brush large nonstick skillet with enough oil to coat; heat over medium-high heat. Working in batches, drop zucchini mixture into skillet by scant 1 tablespoonfuls, spacing apart. Using spatula, flatten cakes to 2-inch rounds. Cook until golden on bottom, brushing skillet with more oil as needed between batches, about 1 to 1 1/2 minutes per side. Transfer cakes to prepared baking sheet. DO AHEAD Can be made 1 day ahead. Cool completely, then cover and chill. Rewarm uncovered in 325°F oven until heated through, about 10 minutes.", "Place warm zucchini cakes on platter. Top each with small dollop of sour cream and piece of smoked trout. Sprinkle with chopped dill and serve."]}, "Zeppole with Chocolate Sauce": {"ingredients": ["8 oz. 70% bittersweet chocolate, chopped", "1 cup heavy whipping cream", "1/4 cup honey", "2 cups plus 1/2 Tbsp. bread flour", "1/2 cup plus 1/2 Tbsp. whole milk", "3 Tbsp. sugar", "1 1/2 tsp. lemon zest", "3/4 tsp. active dry yeast (from 1 envelope)", "3/4 tsp. fine sea salt", "2 large eggs", "3/4 cup (1 1/2 sticks) unsalted butter, room temperature, cut into cubes", "Vegetable oil (for deep-frying)", "Powdered sugar"], "instructions": ["Put chocolate in a medium bowl. Stir cream and honey in a small saucepan over medium heat until mixture starts to bubble; pour over chocolate and whisk until smooth. Keep warm. DO AHEAD Can be made 3 days ahead. Cover and chill. Rewarm before using.", "In the bowl of a stand mixer fitted with a paddle, combine flour and next 6 ingredients. Beat at low speed until dough forms. Gradually add butter, beating until absorbed between additions and occasionally scraping down sides of bowl. Increase speed to medium and beat until smooth and glossy, about 3 minutes. Scrape dough from paddle and sides of bowl. Cover with plastic wrap; let rise for 2 hours.", "Pour enough oil into a deep, heavy 5-qt. pot to reach a depth of 1 1/2\". Attach a deep-fry thermometer to side of pot and heat oil over medium heat until it reaches 325°. Working in batches, drop dough into oil by heaping teaspoonfuls (about 1\"-diameter rounds). Cook, turning occasionally, until zeppole are golden and cooked, about 4 minutes per batch. Using a slotted spoon, transfer zeppole to paper towels; drain.", "Sift powdered sugar over zeppole or put sugar in a paper bag and add zeppole; shake gently to coat. Serve with sauce for dipping."]}, "Zucchini Carpaccio with Homemade Ricotta Cheese": {"ingredients": ["5 medium zucchini, trimmed", "Coarse kosher salt", "Freshly ground black pepper", "2 green onions, thinly sliced", "3 tablespoons fresh lemon juice", "3 tablespoons extra-virgin olive oil", "Homemade Ricotta Cheese (see recipe)", "2 tablespoons chopped fresh basil"], "instructions": ["Using knife or V-slicer, cut zucchini into paper-thin rounds. Arrange rounds, slightly overlapping, on large platter. Sprinkle lightly with coarse salt and pepper, then green onions. Whisk lemon juice and oil in small bowl. Drizzle dressing evenly over zucchini. Drop small spoonfuls of cheese all over zucchini. Sprinkle with basil and serve."]}, "Zinfandel-Braised Beef Short Ribs with Rosemary-Parsnip Mashed Potatoes": {"ingredients": ["3 tablespoons room-temperature butter, divided", "8 3- to 4-inch-long meaty beef short ribs (about 4 pounds)", "Coarse kosher salt", "2 1/2 cups chopped red onions", "2 cups 1/2-inch cubes peeled parsnips", "6 garlic cloves, chopped", "2 tablespoons chopped fresh rosemary", "1 750-ml bottle Zinfandel", "2 cups low-salt beef broth", "1 tablespoon all purpose flour", "3 pounds russet potatoes, peeled, cut into 1-inch cubes", "1 pound large parsnips, peeled, peeled, cut into 3/4-inch cubes", "1 cup whole milk", "6 tablespoons (3/4 stick) butter", "1 tablespoon chopped fresh rosemary"], "instructions": ["Preheat oven to 325°F. Melt 1 tablespoon butter in heavy large ovenproof pot over medium-high heat. Sprinkle ribs with coarse salt and pepper. Add to pot in single layer and sauté until brown on all sides, about 10 minutes. Transfer ribs to large bowl. Add 1 tablespoon butter to pot. onions; sauté until brown, about 6 minutes. parsnips; sauté until beginning to color, about 6 minutes. Mix in garlic, then rosemary. Add wine and broth; bring to boil, scraping up browned bits.", "Return ribs and any accumulated juices to pot, arranging in single layer. Bring to simmer; cover and place in oven. Braise until ribs are very tender, about 2 1/2 hours.", "Using tongs, transfer ribs to clean bowl. Spoon fat from pan juices. Boil juices until just beginning to thicken, about 10 minutes. Mix 1 tablespoon butter and flour in small bowl to smooth paste. Whisk into juices in pot; simmer until thickened enough to coat spoon, about 5 minutes longer. Season gravy with coarse salt and pepper. Return ribs to pot; spoon gravy over. DO AHEAD Can be made 2 days ahead. Chill uncovered until cold, then cover and keep chilled. Rewarm over low heat before serving.", "Cook potatoes and parsnips in large pot of boiling salted water until tender, about 15 minutes.", "Meanwhile, bring milk, butter, and rosemary to simmer in small saucepan.", "Drain potato mixture and return to pot. Stir briefly over medium heat to evaporate excess moisture. Add milk mixture and mash well. Season to taste with salt and pepper.", "Transfer ribs and gravy to large shallow bowl. Serve short ribs with mashed potatoes."]}, "Ziti with Skillet-Roasted Root Vegetables ": {"ingredients": ["2 tablespoons olive oil", "2 1/2 cups coarsely chopped red onion", "2 cups 1/2-inch pieces peeled parsnips", "2 cups 1/2-inch pieces peeled red-skinned sweet potatoes (yams)", "2 cups 1/2-inch pieces peeled golden beets, greens coarsely chopped and reserved", "1 tablespoon chopped fresh rosemary", "1 2/3 cups (about) vegetable broth, divided", "1 pound ziti or other tubular pasta", "2 tablespoons (1/4 stick) butter", "1 1/2 cups grated Parmesan cheese, divided"], "instructions": ["Heat oil in large nonstick skillet over high heat. Add onion and all vegetables except beet greens; sauté until vegetables begin to soften and brown, 8 to 9 minutes. Add rosemary; stir 1 minute. Add 1 cup broth; bring to boil. Reduce heat to medium; sprinkle with salt and pepper. Cover skillet and cook until vegetables are tender, stirring occasionally, 15 to 18 minutes.", "Meanwhile, cook pasta in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain. Return pasta to pot.", "Stir beet greens and butter into vegetables; add to pasta. Stir in 1 cup Parmesan and more vegetable broth by 1/3 cupfuls to moisten. Season with salt and pepper. Serve with remaining Parmesan."]}, "Za'atar Aioli": {"ingredients": ["1 large garlic clove, peeled", "1 cup mayonnaise", "4 teaspoons fresh lemon juice", "1/4 cup extra-virgin olive oil", "1/4 cup za'atar"], "instructions": ["With machine running, drop garlic through feed tube of processor and chop finely. Add mayonnaise and lemon juice. With machine running, drizzle in oil in thin stream, blending until smooth. Transfer to small bowl. Whisk in za'atar and season with salt and pepper. Let stand at least 30 minutes to allow flavors to develop. DO AHEAD Can be made 1 day ahead. Cover and chill. Bring to room temperature before using."]}, "Zabaglione Gelato": {"ingredients": ["4 large egg yolks", "1/2 cup sugar", "1 cup whole milk", "1 cup heavy whipping cream", "6 tablespoons imported dry Marsala", "2 tablespoons dark rum", "1 teaspoon vanilla extract"], "instructions": ["Whisk yolks and sugar in medium bowl until thick, about 2 minutes. Heat milk and cream in medium saucepan over medium heat until mixture bubbles at edges. Gradually whisk hot milk mixture into yolk mixture; return to saucepan. Stir over medium heat until custard leaves path on back of spoon when finger is drawn across and temperature registers 170°F, about 6 minutes. Immediately pour custard through sieve set over another medium bowl. Stir Marsala, rum, and vanilla into custard. Cover; refrigerate at least 3 hours.", "Process custard in ice cream maker. Transfer gelato to container. Cover and freeze until firm, at least 6 hours. DO AHEAD Can be made 2 days ahead. Keep frozen."]}, "Zucchini Blossom and Chicken Saltimbocca": {"ingredients": ["12 zucchini blossoms, stems removed (about 2 ounces)", "2 skinless boneless chicken breast halves (about 1 pound total)", "8 thin 6 1/2 x 3 1/2-inch slices prosciutto", "1 tablespoon unsalted butter", "1 tablespoon extra-virgin olive oil", "1/2 cup dry white wine"], "instructions": ["Gently rinse and dry zucchini blossoms.", "Place each chicken breast between two 12-inch squares of parchment paper; using mallet, pound chicken to 1/4- to 1/3-inch thickness. Remove chicken from parchment paper and cut each breast in half lengthwise.", "Season chicken with salt and pepper; top each with 3 zucchini blossoms. Wrap each chicken breast with 2 prosciutto slices, using toothpick to secure prosciutto and blossoms.", "Melt butter with olive oil in heavy large skillet over medium-high heat. Add chicken, blossom side down, and sauté until browned, about 3 minutes per side. Add white wine and continue cooking until wine is reduced and thickens slightly, about 2 minutes longer. Season to taste with salt and pepper. Transfer chicken to serving platter. Remove toothpicks and pour sauce over chicken."]}, "Zucchini Blossom and Fontina Panini": {"ingredients": ["20 zucchini blossoms, stems removed (about 3 ounces)", "3 tablespoons extra-virgin olive oil plus additional for brushing", "1/4 teaspoon fleur de sel or coarse kosher salt", "1/8 teaspoon freshly ground white pepper", "8 5x3-inch slices rustic country-style bread", "2 cups grated Fontina cheese (about 8 ounces)"], "instructions": ["Gently rinse and dry zucchini blossoms. Heat 3 tablespoons oil in large nonstick skillet over medium-high heat. Add blossoms and sauté until beginning to brown in spots, turning often, about 2 minutes. Sprinkle with 1/4 teaspoon fleur de sel and 1/8 teaspoon white pepper. Transfer blossoms to paper towels and gently blot off excess oil.", "Place 4 bread slices on work surface. Sprinkle 1/2 cup Fontina on each slice. Top each with 5 blossoms. Top with remaining 4 bread slices; press down to compact. Lightly brush both sides of bread with oil.", "If using panini grill, cook each sandwich until golden brown, about 7 minutes. If using nonstick skillet, heat skillet over medium heat; add sandwiches to skillet, then top with second heavy skillet to weigh down. Grill sandwiches until golden brown and cheese melts, about 4 minutes per side."]}, "Zucchini \"Tagliatelle\" with Mint, Cucumber, and Lemon": {"ingredients": ["6 small to medium zucchini (about 1 1/2 pounds total), trimmed", "1 large cucumber (about 13 ounces), peeled, seeded, diced", "1 cup finely chopped Vidalia or Maui onion", "1 1/2 cups (loosely packed) fresh mint leaves, coarsely chopped, divided", "2 teaspoons finely grated lemon peel", "4 tablespoons fresh lemon juice", "2 tablespoons pistachio oil*"], "instructions": ["Using mandoline or V-slicer and working with 1 zucchini at a time, thinly slice lengthwise, discarding first strip. Slice up to seeded core; turn zucchini and continue to slice until only rectangle of seeded core remains; discard core. Place slices in medium bowl.", "Add cucumber, onion, 1/2 of chopped mint, and lemon peel. Whisk lemon juice and pistachio oil in small bowl, then pour over zucchini mixture; toss to coat. Season with salt and generously with pepper. Cover zucchini mixture and refrigerate at least 1 hour and up to 3 hours.", "Sprinkle remaining chopped mint over salad and toss to coat.", "*Pistachio oil can be found at specialty foods stores, some farmers' markets, and at amazon.com. If unavailable, substitute walnut or olive oil."]}, "Zucchini Blossom Frittata": {"ingredients": ["20 zucchini blossoms, stems removed (about 3 ounces)", "3 tablespoons extra-virgin olive oil", "1/2 cup finely chopped onion", "1/2 teaspoon salt", "1/2 teaspoon piment d'Espelette or 1/4 teaspoon cayenne pepper", "7 large eggs, whisked to blend", "1 tablespoon coarsely chopped fresh Italian parsley"], "instructions": ["Gently rinse and dry zucchini blossoms. Preheat broiler.", "Heat oil in 10-inch nonstick ovenproof skillet over medium-high heat. Add onion; reduce heat to medium and sauté until soft, about 4 minutes. Add blossoms and sauté just until wilted, turning often, about 1 minute. Sprinkle with salt and piment d'Espelette.", "Spread blossoms in skillet in single layer; increase heat to medium-high. Add eggs and cook until beginning to set around edges, lifting frittata with heatproof rubber spatula and allowing eggs to flow underneath. Continue cooking until eggs are softly set, about 5 minutes. Transfer skillet to broiler; broil until top of frittata is set, 1 minute. Slide frittata onto platter. Sprinkle with parsley."]}, "Zeppole": {"ingredients": ["3/4 cup plus 1 tablespoon sugar", "1 1/2 teaspoons ground cinnamon", "1 cup water", "1/2 cup (1 stick) unsalted butter, cut into 1/2-inch cubes", "1 tablespoon salt", "1 cup all purpose flour, sifted", "4 large eggs", "Vegetable oil (for frying)"], "instructions": ["Whisk 3/4 cup sugar and cinnamon in medium bowl. Set aside.", "Bring 1 cup water, butter, 1 tablespoon salt, and remaining 1 tablespoon sugar to boil in heavy medium saucepan, stirring until butter melts. Add flour to mixture and stir until dough forms ball. Cook over medium heat 4 minutes to remove raw flour taste, stirring constantly. Transfer dough to medium bowl. Using electric mixer, beat dough mixture until crumbly, about 1 minute. Add eggs 1 at a time to dough, blending well between additions to form smooth dough. DO AHEAD Dough can be made 4 hours ahead. Press plastic wrap directly onto prepared dough and let stand at room temperature until ready to use.", "Pour enough vegetable oil into heavy large saucepan to reach depth of 2 inches. Attach deep-fry thermometer to side of pan. Heat oil to 350°F. Working in batches, scoop rounded teaspoonful of dough, then use second teaspoon to scrape dough into oil. Cook dough balls until puffed and golden brown on all sides, about 7 minutes. Using slotted spoon, transfer fritters to paper towels to drain.", "Toss zeppole in cinnamon sugar and serve warm."]}, "Zucchini Vichyssoise": {"ingredients": ["3 tablespoons butter", "1 1/2 pounds large leeks (white and pale green parts only), thinly sliced (about 2 1/2 cups)", "8 garlic cloves, chopped", "1 1/2 pounds Yukon Gold potatoes, peeled, cut into 2-inch pieces", "1 pound zucchini, cut into 1-inch rounds", "4 1/2 cups (or more) canned low-salt chicken broth", "", "2 cups half and half", "", "Chopped fresh chives"], "instructions": ["Melt butter in heavy large pot over medium heat. Add leeks and garlic; sauté until tender, about 6 minutes. Add potatoes and zucchini; sauté 5 minutes. Add 4 1/2 cups broth and bring to a boil. Reduce heat and simmer until potatoes are tender, about 15 minutes. Cool 30 minutes.", "Working in batches, puree soup in blender. Transfer soup to large bowl. Mix in half and half. Season to taste with salt and pepper. Cover and refrigerate until cold, about 4 hours. DO AHEAD Can be made 2 days ahead. Keep refrigerated. Before serving, thin with additional broth, if necessary.", "Ladle soup into bowl. Sprinkle with chives and serve."]}, "Zucchini Patties with Feta": {"ingredients": ["2 1/2 cups coarsely grated zucchini (from about 3 medium)", "1 teaspoon salt, divided", "1 large egg", "1 large egg yolk", "1/2 cup (or more) all purpose flour", "1/2 cup crumbled feta cheese", "1 cup chopped fresh Italian parsley", "1/2 cup chopped green onions", "1 1/2 tablespoons chopped fresh dill", "", "1/2 cup (about) olive oil", "1/2 cup (about) corn oil", "", "Plain Greek yogurt"], "instructions": ["Toss zucchini and 1/2 teaspoon salt in large bowl. Let stand 5 minutes. Transfer to sieve. Press out excess liquid; place zucchini in dry bowl. Mix in egg, yolk, 1/2 cup flour, cheese, and 1/2 teaspoon salt. Mix in parsley, onions, and dill. If batter is very wet, add more flour by spoonfuls.", "Heat 2 tablespoons olive oil and 2 tablespoons corn oil in large skillet over medium heat. Working in batches, drop batter by rounded tablespoonfuls into skillet. Fry patties until golden, 5 minutes per side, adding more olive oil and corn oil as needed. Transfer to paper towels.", "DO AHEAD Can be made 1 day ahead. Place on baking sheet, cover, and chill. Rewarm uncovered in 350°F oven 12 minutes. Serve with yogurt."]}, "Zucchini, Potato, and Cilantro Soup": {"ingredients": ["3 tablespoons butter", "1 tablespoon (or more) chopped jalapeño chile with seeds", "1/4 teaspoon (generous) fennel seeds", "1 7- to 8-ounce Yukon Gold potato, peeled, cut into 1/2-inch cubes", "16 to 18 ounces zucchini (about 4 medium), trimmed, cut into 1/2-inch rounds", "1 cup chopped green onions", "2 1/2 cups low-salt chicken broth", "", "1/2 cup (packed) fresh cilantro", "1 teaspoon (or more) fresh lime juice"], "instructions": ["Melt butter in heavy large saucepan over medium-high heat. Add chile and fennel seeds; stir 30 seconds. Add next 3 ingredients; sauté 2 minutes. Add broth and bring to boil. Reduce heat to medium-low, cover, and simmer until vegetables are tender, about 15 minutes.", "Puree soup in batches in blender, adding cilantro and 1 teaspoon lime juice to first batch. Return puree to same pan. Season to taste with salt, pepper, and more lime juice, if desired. Rewarm, if necessary, and serve."]}, "Zucchini and Carrots with Green Onions and Dill  ": {"ingredients": ["1 1/2 to 1 3/4 pounds zucchini, trimmed, coarsely grated", "3 tbsp olive oil", "1 1/2 cups chopped green onions (about 6 large), divided", "1 1/2 pounds carrots (about 5 large), peeled, coarsely grated", "4 tablespoons chopped fresh dill, divided"], "instructions": ["Roll up grated zucchini in large kitchen towel; press to dry.", "Heat oil in large deep skillet over high heat. Add 1 cup green onions and sauté 30 seconds. Add zucchini, carrots, and 2 tablespoons dill. Sauté until vegetables are just tender, tossing often, about 8 minutes. Mix in remaining 1/2 cup green onions and 2 tablespoons dill. Season to taste with salt and pepper."]}, "Ziti with Roasted Peppers, Green Olives, and Spicy Salami  ": {"ingredients": ["1 large red bell pepper", "1 large yellow bell pepper", "1 large green bell pepper", "", "2 garlic cloves", "1 small shallot, halved", "1 cup pitted green olives in brine, drained", "1 cup fresh Italian parsley leaves", "6 tablespoons extra-virgin olive oil", "3 tablespoons fresh oregano leaves", "", "1 pound ziti", "4 ounces 1/8-inch-thick slices spicy salami, cut into matchstick-size strips", "1 cup coarsely grated Parmesan cheese"], "instructions": ["Char bell peppers directly over gas flame or in broiler until blackened on all sides. Enclose peppers in paper bag and cool completely. Peel, stem, and seed peppers. Cut peppers lengthwise into 1/4-inch-wide strips.", "With machine running, drop garlic and shallot through processor feed tube and chop coarsely. Add olives, parsley, olive oil, and oregano and chop finely. Season to taste with salt and pepper. DO AHEAD: Peppers and olive mixture can be made 1 day ahead. Cover and refrigerate separately. Bring to room temperature before continuing.", "Cook pasta in large pot of boiling salted water until tender but still firm to bite, stirring occasionally. Drain well. Return pasta to pot; stir in peppers and olive mixture. Add salami and cheese; toss to combine. Serve warm or let stand at room temperature up to 2 hours."]}, "Zucchini, Sun-Dried Tomato, and Mozzarella Tart": {"ingredients": ["1 sheet frozen puff pastry (half of 17.3-ounce package), thawed", "", "1 1/2 cups shredded mozzarela cheese", "6 tablespoons plus 1/4 cup freshly-grated Parmesan cheese", "1/2 cup drained oil-packed sun-dried tomatoes, thinly sliced", "1/2 cup thinly sliced fresh basil", "1/4 cup chopped green onions", "1 tablespoon chopped fresh oregano", "1 small zucchini, cut into thin rounds", "2 large eggs", "2 cups half and half", "1/4 teaspoon salt", "1/4 teaspoon ground black pepper"], "instructions": ["Roll out pastry on floured surface to 1/8-inch-thick square. Trim pastry edges to form 13-inch round. Transfer to 11-inch tart pan with removable bottom. Fold in overhang to form double-thick sides. Pierce with fork. Cover; chill 1 hour.", "Preheat oven to 425°F. Line pastry with foil; fill with beans or pie weights. Bake pastry until sides are set, about 20 minutes. Remove foil and beans. Bake crust until bottom is golden brown, pressing with back of fork if bubbles form, about 8 minutes. Cool 5 minutes.", "Reduce oven temperature to 400°F. Sprinkle mozzarella over bottom of crust. Top with 6 tablespoons Parmesan, tomatoes, basil, green onions, and oregano. Arrange zucchini rounds in concentric circles to cover top of tart. Whisk eggs, half and half, salt, and pepper in medium bowl. Pour mixture into tart. Sprinkle with remaining 1/4 cup Parmesan.", "Bake tart until custard is set and crust is golden brown, about 35 minutes. Serve warm or at room temperature."]}, "Zinfandel Beef Stock": {"ingredients": ["2 tablespoons vegetable oil", "3 1/2 to 4 pounds meaty beef bones (such as neck bones, beef back ribs, or crosscut beef shank)", "2 cups chopped onions", "2/3 cup chopped carrots", "2/3 cup chopped celery", "3 quarts cold water", "1 cup Zinfandel or other hearty red wine", "4 large fresh thyme sprigs", "3 large fresh parsley sprigs", "1/4 teaspoon whole black peppercorns"], "instructions": ["Heat oil in large pot over medium-high heat. Add beef bones; sprinkle with salt and pepper. Sauté until deep brown, turning occasionally, about 15 minutes. Using tongs, transfer bones to bowl. Add onions, carrots, and celery to pot. Sauté until deep brown, about 10 minutes. Return bones and any juices to pot. Add 3 quarts cold water, wine, and next 3 ingredients. Bring to boil. Reduce heat to medium-low and simmer until reduced to 3 1/2 cups liquid, about 3 hours. Strain stock into bowl. Refrigerate uncovered until cold, at least 4 hours. DO AHEAD Can be made 3 days ahead. Cover; keep chilled. Spoon off fat before using stock."]}, "Zucchini with Garlic and Dried Crushed Red Pepper": {"ingredients": ["3 tablespoons olive oil", "2 pounds zucchini, halved crosswise, each half cut lengthwise into 4 flat slices", "4 garlic cloves, minced", "1/2 teaspoon dried crushed red pepper", "Sea salt (preferably fleur de sel)", "1 tablespoon chopped fresh parsley"], "instructions": ["Heat oil in heavy large skillet over medium heat. Add zucchini; sauté until slices are light golden and tender, about 5 minutes. Add garlic and red pepper; stir 1 minute. Season to taste with sea salt. Transfer zucchini to serving platter, sprinkle with parsley, and serve."]}, "Zucchini and Spinach Soup": {"ingredients": ["1/4 cup olive oil", "2 medium onions, chopped", "1 1/2 pounds zucchini, trimmed, cut into 1/2-inch-thick rounds", "1 12 ounce russet potato, peeled, thinly sliced", "4 cups (or more) low-salt chicken broth", "1 6-ounce bag baby spinach leaves", "1 1/2 cups coarsely chopped cilantro"], "instructions": ["Heat oil in large pot over medium heat. Add onions; sauté until soft, about 8 minutes. Add zucchini and potato; stir to coat. Add 4 cups broth and bring soup to boil. Reduce heat to medium-low, cover, and simmer until potato is soft, about 15 minutes. Working in batches, puree soup in blender until smooth, adding some spinach and cilantro to each batch. Return puree to same pot. Thin with more broth by 1/4 cupfuls, if desired. Season soup with salt and pepper. DO AHEAD Can be made 1 day ahead. Chill until cold, then cover and keep refrigerated. Rewarm soup before serving."]}, "Zucchini with Cilantro and Cream": {"ingredients": ["2 tablespoons (1/4 stick) butter", "2 large garlic cloves, minced", "1 3/4 pounds zucchini, trimmed, cut into 1/3-inch-thick rounds", "4 tablespoons chopped fresh cilantro", "1/3 cup whipping cream"], "instructions": ["Melt butter in heavy large skillet over medium heat. Add garlic and sauté 10 seconds. Add zucchini and 2 tablespoons cilantro; sauté until zucchini is crisp-tender, about 5 minutes. Add cream and simmer until juices thicken slightly, about 1 minute. Season with salt and pepper; sprinkle with 2 tablespoons cilantro."]}, "Zucchini Fritters with Herbs and Cheese": {"ingredients": ["5 zucchini (about 1 1/4 pounds), grated", "1 cup finely chopped red onion", "1 1/2 teaspoons salt", "1 cup chopped fresh Italian parsley", "1 cup freshly grated pecorino Romano cheese (about 3 ounces)", "1 cup (scant) toasted whole wheat breadcrumbs", "2 large eggs, lightly beaten", "1/2 cup chopped fresh mint", "1 tablespoon dried oregano", "", "Vegetable oil (for frying)", "1 cup plain yogurt"], "instructions": ["Toss zucchini, onion and salt in large colander. Let stand 1 hour; squeeze as dry as possible. Transfer mixture to large bowl. Mix in next 6 ingredients.", "Pour vegetable oil into heavy large saucepan to depth of 1 inch. Attach deep-fry thermometer to side of saucepan; heat oil over medium-high heat to 350°F. Working in batches, shape zucchini-onion mixture by tablespoonfuls into balls. Add to hot oil. Fry in batches until fritters are brown, turning once, about 3 minutes total. Using slotted spoon, transfer fritters to paper towels to drain. Transfer to platter. Serve with yogurt."]}, "Zucchini with Lemon-Basil Dressing": {"ingredients": ["2 tablespoons fresh lemon juice", "1 teaspoon grated lemon peel", "1 teaspoon Dijon mustard", "5 tablespoons olive oil", "1/2 cup thinly sliced fresh basil", "1/2 cup paper-thin slices red onion", "", "1 1/2 pounds medium zucchini, trimmed, quartered lengthwise, then cut crosswise in half"], "instructions": ["Combine lemon juice, lemon peel and mustard in bowl; gradually whisk in oil. Stir in basil and onion. Season with salt and pepper. Let stand at least 1 hour and up to 6 hours, stirring occasionally.", "Steam zucchini until just crisp-tender, about 5 minutes. Transfer to large bowl; cool completely. Add dressing and toss to coat. Let stand 1 hour for flavors to develop, stirring often."]}}