{"Éclairs": {"ingredients": ["100g/3½oz plain flour or strong white flour", "pinch salt", "75g/2½oz butter ", "4 free-range eggs", "200g/7oz icing sugar", "25g/1oz cocoa powder", "50g/1¾oz icing sugar, sifted", "1 tsp vanilla extract", "400ml/14fl oz whipped cream, whipped volume (about 200ml/7fl oz unwhipped double cream)"], "instructions": ["For the pastry, sift the flour and a pinch of salt into a large bowl and set aside. ", "Put 150ml/5½fl oz water and the butter into a saucepan set over a medium-high heat and stir until the butter melts. Allow the mixture to come to a rolling boil, then immediately remove the pan from the heat. ", "Add the flour and salt and beat very well with a wooden spoon until the mixture comes together. ", "Reduce the heat to medium and replace the saucepan over the heat. Stir for a minute until the mixture starts to slightly stick to the base of the pan. Remove from the heat and allow to cool for a minute. ", "Beat three eggs together and pour about one-quarter of the beaten egg into the pan. Using the wooden spoon, beat very well until incorporated. Add a little more egg and beat well again until the mixture comes back together. Continue to add the egg, beating vigorously all the time, until the mixture has softened, is nice and shiny and has a dropping consistency. You may not need to add all the egg or you may need a little extra. If the mixture is too stiff (not enough egg) then the choux pastries will be too heavy, but if the mixture is too wet (too much egg), they will not hold their shape when spooned onto baking paper. ", "Preheat the oven to 220C/425F/Gas 7. Line a baking tray with parchment paper (not greaseproof paper, as the éclairs may stick when cooked).", "Place the dough into a piping bag fitted with the 5-8mm/¼ - 3/8in nozzle and pipe into lengths approximately 10cm/4in long onto the prepared baking tray, spaced about 4cm/1½in apart to allow for expansion. Use a small wet knife to stop the dough coming out when you have finished piping each éclair.", "Beat the remaining egg and gently brush it over the éclairs. Bake in the oven for ten minutes, then reduce the oven temperature to 200C/400F/Gas 6 and continue to cook for a further 15–20 minutes, or until the éclairs are puffed up, golden-brown and crisp.", "Remove the éclairs from the oven and, using a skewer or the tip of a small sharp knife, make a hole in the side or the base of each éclair. Return to the oven and bake for a further five minutes to allow the steam to escape. Transfer the éclairs to a wire rack to cool.", "For the chocolate glacé icing, sift the icing sugar and cocoa powder into a bowl. Add 1-2 tablespoons of boiling water and stir to mix, adding a little more boiling water if necessary until the icing is spreadable but not too watery.", "For the crème Chantilly filling, fold the sifted icing sugar and vanilla extract into the whipped cream. Chill in the fridge until you are ready to use it.", "When the éclairs are cool, spoon the crème chantilly into a clean piping bag fitted with the small, plain nozzle and pipe the cream into the éclairs through the hole made during cooking until they are well filled.", "Using a small palette knife or table knife that has been standing in a jug of hot water (to make spreading the icing easier), spread the icing over the top of each éclair, dipping the knife into the hot water between each éclair. Serve."]}, "Éclair roll": {"ingredients": ["200ml/7fl oz water", "85g/3oz unsalted butter, plus a little extra for greasing ", "1 tbsp caster sugar  ", "pinch salt ", "115g/4oz plain flour, sifted  ", "3 free-range eggs, beaten ", "300ml/10fl oz whipping cream ", "2 tbsp icing sugar ", "1 tsp vanilla bean paste", "4 tbsp salted caramel spread", "200g/7oz dark chocolate ", "100ml/3½fl oz double cream ", "100g/3½oz milk chocolate, chopped "], "instructions": ["Preheat the oven to 200C/180C Fan/Gas 6. Lightly grease a baking tray and line it with baking paper. ", "Put the water, butter, sugar and salt into a pan. Put it on a medium–high heat and just barely bring to the boil. The sugar and butter need to dissolve. ", "Once the butter and sugar have dissolved, turn the heat down and drop the flour in quickly in one go. Stir straight away and make sure to keep going, to avoid any lumps. The mixture should look smooth and be coming away from the sides of the pan as you mix it. ", "Take off the heat and start adding the eggs a little at a time, making sure to mix after each addition. The mixture will look like it is separating as soon as you add each egg, but keep mixing and it will come together as one. Keep doing this until all the eggs have been added. The dough should be smooth. ", "Pour the mixture into the centre of the prepared tray. Using an offset spatula or the back of a spoon, spread the mixture to a rectangle shape, roughly 20cm x 30cm/8in x 12in. Wet your fingers and pat down any peaks that may have formed, then pop it into the oven for 30 minutes.", "Meanwhile have a clean tea towel ready for when you take out the pastry. Take the éclair roll out of the oven and turn it out on to the tea towel. Roll up the pastry from the shorter end, using the tea towel to help – being sure to roll up the tea towel inside the pastry too. Leave for 20 minutes to cool. ", "Make the filling by whipping the cream with the icing sugar and vanilla bean paste in a bowl until soft peaks form when the whisk is removed from the bowl. Set aside.", "To make the ganache, chop the dark chocolate and put it into a bowl. Warm the cream in a small pan, being careful not to let it boil. As soon as it just begins to come up to the boil, take it off the heat and pour it onto the chocolate. Mix until the chocolate has melted completely. ", "Unroll the pastry, spread the cream all over and drizzle over the salted caramel. Re-roll the pastry, starting from the shorter end as before (this time don’t wrap up the tea towel – tea towels are not tasty!).", "Put the roll on a serving plate, spread the ganache on top and sprinkle over the chopped chocolate. Serve in slices. "]}}